{
  "guid": "032fdd30-9488-55b8-968c-dbce19a3f446",
  "code": "7GSZAD",
  "id": 2122,
  "logo": "https://cfp.cccv.de/media/39c3/submissions/7GSZAD/freebox_hd_hacked_Ff7V3CM.jpg",
  "date": "2025-12-29T17:15:00+01:00",
  "start": "17:15",
  "duration": "01:00",
  "room": "Ground",
  "slug": "39c3-2122-set-top-box-hacking-freeing-the-freebox",
  "url": "https://cfp.cccv.de/39c3/talk/7GSZAD/",
  "title": "Set-top box Hacking: freeing the 'Freebox'",
  "subtitle": "",
  "track": "Security",
  "type": "Talk",
  "language": "en",
  "abstract": "The French ISP 'Free' was the first to introduce a set-top box in France in 2002, named the Freebox. Four years later, the fifth version of the Freebox was released and distributed to customers. It comprises two devices: a router, and a PVR called the Freebox HD, both running Linux. The Freebox HD had innovative features at the time, such as live television control and HD capabilities.\r\n\r\nSuch a device has a lot of potential for running homebrew, so I decided to hack it. I present how I got arbitrary code execution on the Freebox HD and then root privileges, using a chain of two 0-day exploits, one of which is in the Linux kernel. I then analyze the device, run homebrew software, and explain the structure of the ISP's private network that I uncovered while exploring the device.",
  "description": "The Freebox HD is a set-top box with media player capabilities designed and built by the French ISP 'Free' in 2006, and distributed to customers since (including me). It is still in use and will be maintained until the end of 2025.\r\n\r\nWhen I got it, I wanted to run homebrew software on it, so I decided to reverse engineer it. The initial goal was to get arbitrary code execution. The Freebox HD being largely undocumented, this talk shows the full process of reverse engineering it from scratch:\r\n* Initial visual inspection\r\n* Disassembly and inspection of the insides\r\n* Attack surface analysis and choice of the target\r\n* Search and exploitation of a vulnerability in PrBoom (a Doom source port running on the Freebox HD)\r\n* Analysis of the Linux system running on the Freebox HD\r\n* Search and exploitation of a Linux kernel exploit to escape the sandbox and gain root privileges\r\n* Decryption and dump of the firmware\r\n* Analysis of the Linux system and the programs of the Freebox HD\r\n* Playing with the remote control capabilities\r\n* Reverse engineering of the private networks of the ISP\r\n\r\nThe two exploits used to gain full root access were both discovered for this specific hack, which makes them 0-day exploits.\r\n\r\nThe analysis leads to some interesting discoveries about the device itself, but also the ISP, how their technical support works and accesses the devices remotely, and much more!",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "XQDTSC",
      "name": "Frédéric Hoguin",
      "avatar": "https://cfp.cccv.de/media/avatars/XQDTSC_XkVC25r.jpg",
      "biography": "I'm a low-level software engineer working at CERN, and I've been researching and hacking embedded devices for 20 years.\r\n\r\nI always try to get arbitrary code execution on devices I'm not supposed to run code on, and sometimes I manage :)",
      "public_name": "Frédéric Hoguin",
      "guid": "ef5dffa4-d8ab-5fc0-a7e7-f4ac3a0f90c2",
      "url": "https://cfp.cccv.de/39c3/speaker/XQDTSC/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/7GSZAD/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/7GSZAD/",
  "attachments": []
}