{
  "guid": "0425efd8-fec5-5dbc-860b-8478857dc9ac",
  "code": "AEHLZT",
  "id": 1840,
  "logo": null,
  "date": "2025-12-28T16:35:00+01:00",
  "start": "16:35",
  "duration": "00:40",
  "room": "Fuse",
  "slug": "39c3-1840-auf-die-dauer-hilft-nur-power-herausforderungen-fur-dezentrale-netzwerke-aus-sicht-der-soziologie",
  "url": "https://cfp.cccv.de/39c3/talk/AEHLZT/",
  "title": "Auf die Dauer hilft nur Power:  Herausforderungen für dezentrale Netzwerke aus Sicht der Soziologie",
  "subtitle": "",
  "track": "Science",
  "type": "Talk",
  "language": "de",
  "abstract": "Der Vortrag diskutiert Herausforderungen dezentraler Netzwerke aus soziologischer Perspektive. Als dezentrale Netzwerke werden technische Infrastrukturen verstanden, die nicht von einer zentralen Autorität, sondern verteilt über Instanzen zur Verfügung gestellt werden. Nutzer:innen profitieren von dieser Infrastruktur, nutzen beispielsweise das Fediverse oder das Tor-Netzwerk, ohne zur Infrastruktur beizutragen. Zugleich können dezentrale Netzwerke nur dann bestehen, wenn hinreichende Ressourcen von Personen oder Organisationen mobilisiert werden, um das Netzwerk überhaupt zur Verfügung zu stellen. Dies führt zur originären Instabilität dezentraler Netzwerke, wenn nicht der Weg der Kommodifizierung des Nutzer:innenverhaltens eingeschlagen wird. Aufbauend auf dieser Zustandsbeschreibung, werden Bedingungen erörtert, um Kollektivgüter wie dezentrale Netzwerke organisatorisch (und nicht technisch) herzustellen. Hierzu zählen Partizipation oder die Idee einer öffentlichen Grundfinanzierung. Der Vortrag wird neben soziologischen Ideen und harten Zahlen auch durch eine ordentliche Portion Idealismus zu Fragen der Souveränität und Autonomität in der Digitalisierung motiviert.",
  "description": "Die Soziologie hat immer etwas mitzuteilen, sobald Fragen kollektiven Handelns auftreten. Dies gilt sowohl für soziale wie auch digitale Räume. So hat der Soziologe Peter Kollock bereits in den 1990er Jahren festgestellt, „the Internet is filled with junk and jerks“ (Kollock, 1999, S. 220). Gegenwärtig dürfte die Mehrheit dieser Aussage anstandslos zustimmen. Aber dies ist nicht der entscheidende Punkt, sondern die weitere Beobachtung: „Given that online interaction is relatively anonymous, that there is no central authority, and that it is difficult or impossible to impose monetary or physical sanctions on someone, it is striking that the Internet is not literally a war of all against all” (1999, S. 220).\r\n\r\nDie Welt kennt inzwischen zahlreiche Gegenbeispiele, bei denen Autoritäten das Internet nutzen, um das Nutzungsverhalten zu monetarisieren oder Überwachungstechnologien zur Sanktionierung einsetzen (Zuboff, 2019). Diese Ausgangslage beziehe ich in meiner Forschung ein, wenn ich dezentrale Netzwerke wie das Fediverse oder das Tor-Netzwerk aus soziologischer Perspektive betrachte. In erster Linie bin ich daran interessiert zu verstehen, wie dezentrale Netzwerke – organisatorisch nicht technisch – entstehen und welche Herausforderungen es dabei zu überwinden gilt (Sanders & Van Dijck, 2025). Eine zentrale Motivation orientiert sich an der Frage, wie ein Internet ohne zentrale Autorität, verringert von Marktabhängigkeiten, resilient gegenüber Sanktionsmechanismen und Souverän bezüglich eigener Daten, aufgebaut werden kann. Motiviert durch diesen präskriptiven Rahmen, betrachte ich im Vortrag die Herausforderungen zunächst deskriptiv und beziehe meine soziologische Perspektive ein. Denn in der Regel profitieren Menschen, die einen Vorteil aus der Realisierung eines bestimmten Ziels ziehen, unabhängig davon, ob sie persönlich einen Anteil der Kooperation tragen – oder eben nicht. Das kollektive Handeln fällt mitunter schwer, obwohl oder gerade, weil ein begründetes kollektives Interesse zur Umsetzung eines bestimmten Zieles besteht. Gleiche Interessen sind nicht gleichbedeutend mit gemeinsamen Interessen. Diese Situationsbeschreibung ist vielfältig anwendbar von WG-Aufräumplänen bis zu Fragen der klimaneutralen Transformation. Der Grund ist, dass kollektives Handeln ein Mindestmaß an Zeit, Aufwand oder Geld verursacht, sodass vielfach ein Trittbrettfahren gewählt wird in der Hoffnung, dass immer noch genug andere kooperieren, um das gewünschte Ziel zu erreichen (Hardin, 1982). \r\n\r\nAus dieser Perspektive betrachte ich dezentrale Netzwerke. So kann das Fediverse oder der Tor-Browser genutzt werden, ohne eine eigene Instanz oder Knoten zu hosten. Dies ist auch nicht das Ziel der genannten dezentralen Netzwerke. Dennoch: Die Kosten und der Aufwand für die technische Infrastruktur müssen von einem kleinen Teil getragen werden, während die überwältigende Mehrheit der Nutzer:innen von der Infrastruktur profitieren, ohne einen Beitrag zu dieser zu leisten. Dies führt zur originären Instabilität dezentraler Netzwerke und stellt eine relevante Herausforderung für die Zukunft dar. Während durch Netzwerkanalysen das Wachstum und die Verstetigung von dezentralen Netzwerken beschrieben wird, fehlt es an einem vertieften Verständnis über Bedingungen wie dezentrale Netzwerke überhaupt entstehen. Während des Vortrags werde ich empirische Daten zur Entwicklung des Fediverse und des Tor-Netzwerkes zeigen, um die Herausforderung zu verdeutlichen. Insbesondere das Tor-Netzwerk steht dabei vor dem Problem, dass die Möglichkeit zur De-Anonymisierung steigt, wenn die Anzahl an Knoten sinkt. Die Überwindung des von mir dargestellten Kollektivgutproblems nimmt demnach eine zentrale Rolle zur Aufrechterhaltung ein.\r\n\r\nDie Motivation sich mit dezentralen Netzwerken auseinanderzusetzen, resultiert aus der Umkehr der Argumentation, wenn Netzwerke über eine zentrale Autorität verfügen und zugleich in der Lage sind, Sanktionsmechanismen zu nutzen, beispielsweise um unliebsame User:innen zu sperren, das Nutzungsverhalten zu überwachen und zu monetarisieren (Zuboff, 2019). Hierbei beziehe ich mich offensichtlich auf die Entwicklung sozialer Medien, die das oben beschriebene Problem kollektiven Handelns durch Kommodifizierung der Infrastruktur lösen. Ähnliches ist aus dem Bereich der Kryptowährung bekannt, welche ebenfalls durch den individualisierten monetären Vorteil, das heißt der Verheißung einer Kapitalakkumulation, Kooperationsprobleme überwindet. Stellen wir uns so die Zukunft des Internets vor?\r\nDezentrale Netzwerke sind nicht per se eine allumfassende technische Lösung für gesellschaftlich-soziale Probleme. Im Gegenteil: Dezentrale Netzwerke, wenn sie nicht auf Kommodifizierung basieren, unterliegen einer sozialen Ordnung, die sich eben nicht technisch lösen lässt. Ein Bewusstsein über die Notwendigkeit dezentraler Netzwerke ist hierbei leider nicht ausreichend, sondern es braucht Menschen und Organisationen, die bereit sind einen Teil der Infrastruktur zu tragen, ohne einen direkten Vorteil hiervon zu erhalten. Diese Selbstorganisation steht im Vergleich zu profitorientierten Unternehmen immer im Nachteil (Offe & Wiesenthal, 1980). \r\n\r\nIn meiner Forschung verbinde ich mein Interesse an Grundstrukturen und Bedingungen sozialer Ordnung, wie dem Kooperationsproblem, mit dem Anspruch gesellschaftlicher Gestaltung. Allein das Bewusstsein über diese Bedingungen kann noch kein Kooperationsproblem lösen. Es kann allerdings helfen, den Rahmen dieser Bedingungen aktiv zu gestalten. Ich werde mich dabei zwischen kritischen Realitäten und hoffnungsvollen Ausblicken bewegen, denn ganz offensichtlich existieren dezentrale Netzwerke, die eine organisatorische und technische Alternative anbieten. Doch wie der Titel suggeriert, hilft hier auf die Dauer nur die (zivilgesellschaftliche) Power.\r\n\r\nLiteratur\r\nHardin, R. (1982). Collective Action. Hopkins University Press.\r\nKollock, P. (1999). The Economies of Online Cooperation: Gifts and Public Goods in Cyberspace. In M. A. Smith & P. Kollock (Hrsg.), Communities in Cyberspace (S. 220–239). Routledge.\r\nOffe, C., & Wiesenthal, H. (1980). Two Logics of Collective Action: Theoretical Notes on Social Class and Organizational Form. Political Power and Social Theory, 1, 67–115.\r\nSanders, M., & Van Dijck, J. (2025). Decentralized Online Social Networks: Technological and Organizational Choices and Their Public Value Trade-offs. In J. Van Dijck, K. Van Es, A. Helmond, & F. Van Der Vlist, Governing the Digital Society. Amsterdam University Press. https://doi.org/10.5117/9789048562718_ch01\r\nZuboff, S. (2019). Surveillance Capitalism—Überwachungskapitalismus. Aus Politik und Zeitgeschichte, 24–26, 4–9.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "XJQQVC",
      "name": "Marco Wähner",
      "avatar": null,
      "biography": "Ich bin wissenschaftlicher Mitarbeiter am Center for Advanced Internet Studies (CAIS) in der Abteilung \"Research Data & Methods\". In meiner Forschung bewege ich mich an der Schnittstelle zwischen Sozialwissenschaften und Informatik. Ich habe zum Thema politischer Online-Partizipation promoviert und interessiere mich darüber hinaus für Fragen der politischen Soziologie. Ein Schwerpunkt meiner Arbeit ist die Auseinandersetzung mit Kooperationsproblemen, beispielsweise in dezentralen Netzwerken. Die Deutsche Bahn und Windows haben mich politisiert.",
      "public_name": "Marco Wähner",
      "guid": "67576dbb-2347-55a2-a0b3-740c028cf56c",
      "url": "https://cfp.cccv.de/39c3/speaker/XJQQVC/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/AEHLZT/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/AEHLZT/",
  "attachments": []
}