{
  "guid": "0c6e2d25-7014-5aaf-9c6a-b4347f0ff85c",
  "code": "9DYZXG",
  "id": 2090,
  "date": "2025-12-28T16:35:00+01:00",
  "start": "16:35",
  "duration": "00:40",
  "room": "Zero",
  "slug": "39c3-lessons-from-building-an-open-architecture-secure-element",
  "title": "Lessons from Building an Open-Architecture Secure Element",
  "subtitle": null,
  "language": "en",
  "track": "Hardware",
  "type": "Talk",
  "abstract": "The talk will be about our experience from building an open-architecture secure element from the ground up. It explains why openness became part of the security model, how it reshaped design and development workflows, and where reality pushed back — through legal constraints, third-party IP, or export controls. It walks through the secure boot chain, attestation model, firmware update flow, integration APIs, and the testing framework built for external inspection. Real examples of security evaluations by independent researchers are presented, showing what was learned from their findings and how those exchanges raised the overall security bar. The goal is to provoke discussion on how open collaboration can make hardware more verifiable, adaptable, auditable and while keeping secure.",
  "description": "This talk shares our engineering experience from designing and implementing an open-architecture secure element — a type of chip that is traditionally closed and opaque. We’ll outline the practical consequences of choosing openness as part of the security model: how it affected hardware architecture, firmware design, verification, and development workflows.\nThe session dives into concrete technical areas including the secure boot chain, attestation and update flow, key storage isolation, and the testing and fuzzing infrastructure used to validate the design. It also covers the boundaries of openness — where third-party IP, export control, or certification requirements force certain blocks to remain closed — and how we document and mitigate those limits.\nWe’ll present anonymized examples of external security evaluations, show how responsible disclosure and transparent fixes improved resilience, and reflect on what “community-driven security” means in a hardware context. Attendees should leave with a clearer view of what it takes to make security verifiable at the silicon level — and why that process is never finished.\n",
  "logo": null,
  "persons": [
    {
      "guid": "b5730a2e-a7b1-51b1-83ee-3c38d3870b7b",
      "name": "Jan Pleskac",
      "public_name": "Jan Pleskac",
      "avatar": null,
      "biography": "CEO & Co-founder Tropic Square with 20+ years experience in custom ASIC and FPGA designs, embedded systems HW design and cybersecurity.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_b5730a2e-a7b1-51b1-83ee-3c38d3870b7b"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/lessons-from-building-an-open-architecture-secure-element",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/9DYZXG/"
}