{
  "guid": "0cd9234b-1abb-5fa2-85a9-af1ec76569bb",
  "code": "9P8YNR",
  "id": 1460,
  "logo": null,
  "date": "2025-12-30T12:50:00+01:00",
  "start": "12:50",
  "duration": "00:40",
  "room": "One",
  "slug": "39c3-1460-security-of-cardiac-implantable-electronic-devices",
  "url": "https://cfp.cccv.de/39c3/talk/9P8YNR/",
  "title": "Security of Cardiac Implantable Electronic Devices",
  "subtitle": "",
  "track": "Security",
  "type": "Talk",
  "language": "en",
  "abstract": "Cardiac Implantable Electronic Devices (CIED), such as cardiac pacemakers and defibrillators, are a fairly niche target for security researchers, in part due to a lack of manufacturer cooperation and device accessibility. This talk aims to provide insights into the challenges in device development and methods with which to research device security. Data accessibility to patients will be touched upon.",
  "description": "CIEDs may adversely affect patients implanted with such devices should their security be compromised. Although some efforts to secure these devices can be noted, it has quite often been lacking and may thus enable patient harm or data confidentiality compromise by malicious actors. Given the vast consequences of security vulnerabilities within this industry, the author aims to provide insight into the challenges associated with designing security architectures for such platforms, as well as possible methodology of researching these devices safely even when lacking manufacturer cooperation and access to device programmers. \r\n\r\nData collected by CIEDs and transmitted through remote monitoring is an additional concern for patients. Whilst research has shown that most manufacturers do respond in a timely and comprehensive fashion to GDPR requests, immediate data access is not yet possible and requires the patient to reach out to their doctors to obtain the requisite (event) data. A proposed solution is presented on how a patient communicator may be designed to allow patients interested in their autonomy to perform limited device interrogation in a safe and secure manner.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "U9HCFM",
      "name": "dilucide",
      "avatar": null,
      "biography": "The author wishes to not publicly disclose information.",
      "public_name": "dilucide",
      "guid": "ccfcadec-fb46-51ef-9d5c-553fc4938158",
      "url": "https://cfp.cccv.de/39c3/speaker/U9HCFM/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/9P8YNR/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/9P8YNR/",
  "attachments": []
}