{
  "guid": "0d8b2ff3-3f35-5fb7-abd2-a196ca3b1be2",
  "code": "MJXDV7",
  "id": 82333,
  "date": "2025-12-30T10:00:00+01:00",
  "start": "10:00",
  "duration": "02:00",
  "room": "Stonewall IO (Saal Y 06)",
  "slug": "39c3-chaotischer-schreiben-mehr-erzahlen-ein-kollaborat",
  "title": "Chaotischer schreiben - mehr erzählen. Ein kollaborativer Schreibworkshop zum Congress, für alle, die was zu schreiben haben. [all creatures welcome]",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "Workshop long",
  "abstract": "„Hattest du einen schönen Congress?“ „Ja klar, also…ähm…was erzähle ich jetzt?“\r\nDer Congress ist intensiv. Er inspiriert, überfordert, überrascht und berührt. Gemeinsam extrahieren wir unsortierte Congress-Erlebnisse aus dem Cache und booten neu.",
  "description": "Gar nicht so einfach, in Worte zu fassen, was zwischen LEDs und Gesprächen, Vorträgen und Hallen, Workshops und Zufallsmomenten entsteht. in diesem Workshop erproben wir Methoden des kreativen und ethnographischen Schreibens. Wir schreiben für uns allein und kollaborativ, ausgehend vom Congress, über uns und diese Welt.\n\nSchreiben kann mehr sein als eine Technologie, um sensorische Signale zu speichern. Schreibend lässt sich reflektieren und die Welt gestalten. Schreiben ist in diesem Sinne eine politische Praxis. Die Geschichten, die wir über die Welt erzählen und uns darin erzählen, prägen, was wir für möglich halten. Kultur, Wissen, Weltordnungen werden von Menschen geschrieben, gelesen und weitergetragen. Wenn wir selbst zu Schreibenden werden, können wir diese Geschichten anders erzählen, verschieben und aufbrechen. Hier knüpfen wir an „speculative fabulations“ (Donna Haraway) an: die Idee, neue Zukünfte zu erfinden, indem wir anders erzählen.\nWir begreifen ethnografisches Schreiben als eine Praxis des „reflecting selves and others“: eine Form, die uns erlaubt wahrzunehmen, wie wir selbst und andere in Beziehung stehen, sich bewegen, fühlen, handeln.\n\nMit praktischen Übungen, kleinen Inputs und gemeinsamen Diskussionen probieren wir verschiedene Zugänge aus: vom freien Schreiben über Vignetten bis hin zu kollaborativen Texten, die aus unseren Congress-Erlebnissen heraus entstehen.\n\nVorkenntnisse sind nicht erforderlich, aber willkommen. Bringt euch angenehmes Schreibzeug mit: Laptop, Telefon oder Papier und Stift. Zusätzlich haben wir auch Papier und Stifte da.\n",
  "logo": null,
  "persons": [
    {
      "guid": "f7b2a1ed-4efe-5bee-b31d-12712c8fa3d5",
      "name": "Lisa Tschorn",
      "public_name": "Lisa Tschorn",
      "avatar": "https://pretalx.c3voc.de/media/avatars/9R8HXJ_MCog8dB.jpg",
      "biography": "Lisa Tschorn ist Künstlerin und Geografin. Sie arbeitet interdisziplinär. Kollaboration ist zentral. Ihre Praxis umfasst Performances, Textarbeiten und Installationen. Sie veranstaltet Salons als offene Austauschformate und studiert jetzt auch noch biografisches und kreatives Schreiben im Master.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_f7b2a1ed-4efe-5bee-b31d-12712c8fa3d5"
    },
    {
      "guid": "64b913b7-31ac-5ee7-aabc-6248a4643710",
      "name": "Isabella Kölz",
      "public_name": "Isabella Kölz",
      "avatar": null,
      "biography": "Dr. Isabella Kölz ist Kulturanthropologin, Aktivistin und queer-feminstische Süßmaus. Ihre Forschungsarbeiten thematisieren Fragen nach Arbeit, Geschlecht, Digitalität und Gestaltung, hinterfragen common-sense Annahmen und finden kollaborativ, angewandt und experimentell statt. Sie bringt Wissenschaft, Kunst und Aktivismus, aber vor allem Menschen in ihren Projekten zusammen.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_64b913b7-31ac-5ee7-aabc-6248a4643710"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/chaotischer-schreiben-mehr-erzahlen-ein-kollaborat",
  "links": [],
  "origin_url": "https://pretalx.c3voc.de/39c3-haecksen-workshops-2025/talk/MJXDV7/",
  "feedback_url": "https://pretalx.c3voc.de/39c3-haecksen-workshops-2025/talk/MJXDV7/feedback/"
}