{
  "guid": "0fdda2f0-88c1-518f-858f-fd41d48325f4",
  "code": "8WYX73",
  "id": 1537,
  "date": "2025-12-28T15:40:00+01:00",
  "start": "15:40",
  "duration": "00:40",
  "room": "Fuse",
  "slug": "39c3-uber-europaische-grenzen-hinweg-auf-klinischen-daten-rechnen-aber-sicher",
  "title": "Über europäische Grenzen hinweg auf klinischen Daten rechnen - aber sicher!",
  "subtitle": null,
  "language": "de",
  "track": "Science",
  "type": "Talk",
  "abstract": "Der Trend geht dahin, aus Gesundheitsdaten große zentralisierte Datenbanken aufzubauen. Eine datensparsame Alternative dazu ist, in einem verschlüsseltem Netzwerk gemeinsam auf verteilten privaten Daten zu rechnen, ohne sie miteinander teilen zu müssen. Perspektivisch können so demokratischere Datenströme geschaffen werden, die Patient:innen als aktiv Teilhabende statt als passive Datenquellen einbinden. Kommt mit auf eine Reise, die vor sechs Jahren in Deutschland gestartet ist und jetzt die erste europäische klinische Studie mit Secure Multiparty Computation (SMPC) realisiert hat.",
  "description": "**Klinische Forschung 101:** Warum sind \"multizentrische\" klinische Studien der Goldstandard und wie läuft das ab? Welche Daten werden da gesammelt und wie funktioniert in der Praxis der Datenaustausch? Was sagt die DSGVO dazu?\n\n**Sicheres verteiltes Rechnen 101:** Wie kann man in verschlüsselten peer-to-peer Netzwerken gemeinsam auf verteilten Daten rechnen, ohne die Eingabedaten untereinander austauschen zu müssen? Was sind technische Vor- und Nachteile? Was ändert das an den Rollen der Akteure im System?\n\n**Der Prototyp in Deutschland 2019:** Das LMU Klinikum in München kooperiert mit der Charité in Berlin und der TU München. Zum ersten Mal gelingt das gemeinsame Rechnen auf verteilten Patient:innendaten. Diverse lessons were learned.\n\n**Die erste europäische Studie 2024:** Das LMU Klinikum in München kooperiert mit der Policlinico Universitario Fondazione Agostino Gemelli in Rom. Aus der Pilotstudie ergibt sich auch ein DSGVO-konformer Blueprint und eine wiederverwendbare Architektur.\n\n**Fazit und Ausblick:** Sicheres verteiltes Rechnen in der Wissenschaft und darüber hinaus.\n",
  "logo": null,
  "persons": [
    {
      "guid": "ad209b3d-e184-5833-9d56-2678c8d6aab2",
      "name": "Hendrik Ballhausen",
      "public_name": "Hendrik Ballhausen",
      "avatar": "https://cfp.cccv.de/media/avatars/VPXTJ9_wEn017y.jpg",
      "biography": "Hendrik ist Professor an der Ludwig-Maximilians-Universität München und leitet dort das Forschungsdekanat der Medizinischen Fakultät.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_ad209b3d-e184-5833-9d56-2678c8d6aab2"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/uber-europaische-grenzen-hinweg-auf-klinischen-daten-rechnen-aber-sicher",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/8WYX73/",
  "do_not_record": true
}