{
  "guid": "11d5c612-0e50-500b-b071-c4ba0dd076cd",
  "code": "L8REGS",
  "id": 1492,
  "logo": null,
  "date": "2025-12-29T16:00:00+01:00",
  "start": "16:00",
  "duration": "01:00",
  "room": "Zero",
  "slug": "39c3-1492-apt-down-and-the-mystery-of-the-burning-data-centers",
  "url": "https://cfp.cccv.de/39c3/talk/L8REGS/",
  "title": "APT Down and the mystery of the burning data centers",
  "subtitle": "",
  "track": "Security",
  "type": "Talk",
  "language": "en",
  "abstract": "In August 2025 Phrack published the dump of an APT member's workstation. It was full of exploits and loot from government networks, cell carriers and telcos. \r\nThe dump sparked a government investigation, and corpos like LG and Korea Telecom were asked to explain themselves. Hours before an onsite audit, the data center mysteriously caught fire, destroying almost a hundred servers. Then another data center burned - and unfortunately, there was even one death.\r\nThe talk aims to revisit this mysterious sequence of tragic incidents.",
  "description": "In August 2025 Phrack published the dump of an APT member's workstation. The attacker was most likely Chinese, working on targets aligned with North Korea's doctrine. The dump was full of exploits, attacker tools and loot. Data from government networks, cell carriers and telcos, including server databases and loads or private keys stemming from the government PKI. The attacker had maintained a steady foothold in various targets in South Korea and Taiwan before accidentally \"losing\" their workstation.\r\n\r\nThe dump sparked a government investigation, and big corporations like LG, Lotte and Korea Telecom were asked to explain themselves. The government also mandated an on-site audit in the data center where the hacks had taken place. On the day of the audit, some li-ion batteries in the data center mysteriously caught fire. The blaze destroyed close to 100 servers (which had no backup) and plunged public service in South Korea into disarray. \r\nShortly after, the Lotte data center burned as well - the corporation had been victim of a breach recently, albeit by a different threat actor. In the beginning of October, one of the officers examining the government data center fire tragically died by his own hand.\r\n\r\nThe talk aims to revisit this mysterious sequence of events that was started by an article in Phrack #72. It doesn't hope to give answers or a solution, but narrates a story that could be from a spy thriller. Caution: Conspiracies and technical gore could be present.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "KSUSUS",
      "name": "Christopher Kunz",
      "avatar": null,
      "biography": null,
      "public_name": "Christopher Kunz",
      "guid": "94f47ca3-3388-5957-b42b-90ca449d8550",
      "url": "https://cfp.cccv.de/39c3/speaker/KSUSUS/"
    },
    {
      "code": "DUCHCH",
      "name": "Sylvester",
      "avatar": "https://cfp.cccv.de/media/avatars/DUCHCH_s598AhL.png",
      "biography": "Sylvester is an editor and author for the German computer magazine c’t and its sister publication heise online. He writes mostly about Linux and open source, IT security, and topics adjacent to programming and software engineering. He also co-hosts a podcast on IT security.",
      "public_name": "Sylvester",
      "guid": "1b7bbb43-32d9-56cc-8c6e-1f191fa43148",
      "url": "https://cfp.cccv.de/39c3/speaker/DUCHCH/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/L8REGS/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/L8REGS/",
  "attachments": []
}