{
  "guid": "11ede3bc-662b-580b-9ecb-e84edabee369",
  "code": "UNNRYM",
  "id": 1908,
  "logo": null,
  "date": "2025-12-29T23:00:00+01:00",
  "start": "23:00",
  "duration": "01:00",
  "room": "Fuse",
  "slug": "39c3-1908-von-fuzzern-zu-agenten-entwicklung-eines-cyber-reasoning-systems-fur-die-aixcc",
  "url": "https://cfp.cccv.de/39c3/talk/UNNRYM/",
  "title": "Von Fuzzern zu Agenten: Entwicklung eines Cyber Reasoning Systems für die AIxCC",
  "subtitle": "",
  "track": "Security",
  "type": "Talk",
  "language": "de",
  "abstract": "Die AI Cyber Challenge (AIxCC) der DARPA hatte zum Ziel, die Grenzen der autonomen Cybersicherheit zu erweitern: Können AI-Systeme Software-Schwachstellen unabhängig, in Echtzeit und ohne menschliche Hilfe identifizieren, verifizieren und beheben?\r\nIm Laufe von zwei Jahren entwickelten Teams aus aller Welt „Cyber Reasoning Systems“ (CRS), die in der Lage sind, komplexe Open-Source-Software zu analysieren, Code zu analysieren, reproducer zu generieren, um zu zeigen, dass ein gemeldeter Fehler kein Fehlalarm ist, und schließlich Patches zu synthetisieren.\r\nUnser Team nahm an dieser Challenge teil und entwickelte von Grund auf ein eigenes CRS. In diesem Vortrag geben wir Einblicke in den Wettbewerb: Wie funktioniert die LLM-gesteuerte Schwachstellenerkennung tatsächlich, welche Designentscheidungen sind wichtig und wie sind die Finalisten-Teams an das Problem herangegangen?",
  "description": "Die AIxCC (DARPA’s AI Cyber Challenge) ist ein zweijähriger Wettbewerb, dessen Ziel es war, die Möglichkeiten der automatisierten Erkennung und Behebung von Sicherheitslücken zu verbessern.\r\nDabei sollte ein autonomes, in sich geschlossenes System entwickelt werden, das Software analysiert, Schwachstellen erkennt, diese mithilfe von Reproducern nachweist und anschließend sichere Patches erzeugt.\r\n\r\nUnser Team hat sich diesem globalen Experiment angeschlossen und ein eigenes Cyber Reasoning System (CRS) von Grund auf neu entwickelt. Dazu haben wir mehrere Agenten entwickelt. Unser System profitierte von der Kombination klassischer Techniken wie Fuzzing mit modernen Large Language Models (LLMs). Die Synergie zwischen diesen Ansätzen erwies sich als leistungsfähiger als jede der beiden Techniken für sich allein, sodass unser CRS Software auf eine Weise untersuchen und patchen konnte, wie es weder Fuzzing noch LLMs allein leisten konnten.\r\n\r\nIn diesem Vortrag werden wir:\r\n- das Konzept und die Ziele hinter AIxCC erläutern\r\n- durchgehen, wie ein CRS tatsächlich funktioniert und wie wir unseres entwickelt haben\r\n- zeigen, wie LLMs traditionelle Fuzzing- und Analyse-Techniken unterstützen können\r\n- Beobachtungen zu den Strategien der Finalisten-Teams teilen",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "GRFASX",
      "name": "Mischa Meier (mmisc)",
      "avatar": "https://cfp.cccv.de/media/avatars/GRFASX_faM4AmE.jpg",
      "biography": "Hacker and security researcher.\r\nLikes to climb rocks.",
      "public_name": "Mischa Meier (mmisc)",
      "guid": "d2de089a-80f3-5428-a63d-dfde9f96a51c",
      "url": "https://cfp.cccv.de/39c3/speaker/GRFASX/"
    },
    {
      "code": "LU99TG",
      "name": "Annika Kuntze",
      "avatar": "https://cfp.cccv.de/media/avatars/LU99TG_uQSf6Z9.jpeg",
      "biography": "CTF-Spielerin und Cyber-Security-Nerd mit Faszination für Maschinen, die selbst hacken lernen",
      "public_name": "Annika Kuntze",
      "guid": "8002efc5-2730-5942-8e01-31862e452f68",
      "url": "https://cfp.cccv.de/39c3/speaker/LU99TG/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/UNNRYM/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/UNNRYM/",
  "attachments": []
}