{
  "guid": "13360c32-568f-519d-a8fd-0a9740089ccf",
  "code": "SBN89V",
  "id": 1676,
  "logo": null,
  "date": "2025-12-28T11:00:00+01:00",
  "start": "11:00",
  "duration": "01:00",
  "room": "Ground",
  "slug": "39c3-1676-hatupangwingwi-the-story-how-kenyans-fought-back-against-intrusive-digital-identity-systems",
  "url": "https://cfp.cccv.de/39c3/talk/SBN89V/",
  "title": "Hatupangwingwi: The story how Kenyans fought back against intrusive digital identity systems",
  "subtitle": "",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "language": "en",
  "abstract": "The session title is fashioned after the Kenyan movement building rhetoric “Hatupangwingwi” which is Kenyan slang meant as a call to action to counter anti-movement building techniques by the political class and resist infiltration and corruption. This is true for the organisation and movement building towards inclusive identity regimes in Kenya. \r\nThe session seeks to explore the lessons from Kenya’s journey to digitalization of public services  and the uptake of Digital Public infrastructure. It digs deeper on the power of us and how civil society could stop a destructive surveillance driven digitalisation thus protecting millions of Kenyans.",
  "description": "In 2019, the Kenyan government announced the transition to a centralised database named National integrated Identity management system (Huduma Namba) in a bid to develop a digital Identity system that went on to be termed a “single source of truth. Historically, Kenya has not had the best track record with civil registration and identity systems. This is particularly due to the linkages with colonial practices with the first ID “Kipande” being used as a tool for surveillance of natives and imposed for restriction of movement. This system carried on post independence creating different classes of citizens in terms of access to nationality documents. \r\nIt is for this reason that CSOs, mostly community-based, chose a three pronged approach to counter this; seeking legal redress, grassroots/community mobilization and advocacy and spotlighting ways in which in a shrinking civil society space, Kenyan civil society was able not only take up space, but make their impact felt in protecting the rights of those on the margins. The session shares lessons of how we shaped the Media narrative that took down a multi million dollar project that was not people centered but rather oppression driven. This session shares experiences of how we created a heightened sense of citizenry awareness to shoot down oppressive digitalisation agendas. \r\nThe aim is to show how these efforts led to over 10 million Kenyans resisting to enroll in the system especially the young people (Gen Z) who felt they were being coerced to join a system due to the poor messaging by the government and they connected with the NGO campaign thus choosing to resist the system in the true spirit of Hatupangwingwi,  with Hashtags like #DOIDRIGHT and #DEPORTME trending on social media as a sign of resistance. This led to the collapse of the whole project.\r\nFinally, the session will share how in 2022, when the new government wanted to roll out the new DPI project known as Maisha Namba, they realised the importance of including civil society voices and they convened over 50 NGOs to try to build buy-in for the new digital ID program. It was the first time the government and NGOs were on the same table discussing how to build an inclusive digital ID system. This is the story of how the power of us led to civil society earning their space in the designing phase of the new Digital Public Infrastructure.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "NP8N3Y",
      "name": "Mustafa Mahmoud Yousif",
      "avatar": "https://cfp.cccv.de/media/avatars/NP8N3Y_dRyjC9J.jpg",
      "biography": "Mustafa Mahmoud is a citizenship and digital identity advocate with over twelve years of experience working in Kenya, Bangladesh, Jordan, and Myanmar. He co-directs Namati Kenya, where he leads strategies on inclusion, legal empowerment, and citizenship rights, and mentors community paralegals. Mustafa has represented civil society in Kenya’s government–CSO working group on Maisha Namba and received the 2021 hashtag#GoodID Award for Inclusion. His work covers program design, donor engagement, policy advocacy, and technical support to NGOs. He has contributed to publications such as The World’s Stateless Reports and Kenya’s Citizenship and Nationality Rights Case Digest. Outside his professional work, Mustafa is a wildlife and travel photographer, documentary director, and active community volunteer.",
      "public_name": "Mustafa Mahmoud Yousif",
      "guid": "67bf0710-540d-53ec-94ae-a6beea3ba305",
      "url": "https://cfp.cccv.de/39c3/speaker/NP8N3Y/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/SBN89V/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/SBN89V/",
  "attachments": []
}