{
  "guid": "13468ffb-06e8-53ca-9e7c-3cfa56cd44af",
  "code": "9KWKDP",
  "id": 1652,
  "date": "2025-12-27T23:55:00+01:00",
  "start": "23:55",
  "duration": "00:40",
  "room": "Ground",
  "slug": "39c3-ai-generated-content-in-wikipedia-a-tale-of-caution",
  "title": "AI-generated content in Wikipedia - a tale of caution",
  "subtitle": null,
  "language": "en",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "abstract": "I successfully failed with a literature related project and accidentally built a ChatGPT detector. Then I spoke to the people who uploaded ChatGPT generated content on Wikipedia.",
  "description": "It began as a standard maintenance project: I wanted to write a tool to find and fix broken ISBN references in Wikipedia. Using the built-in checksum, this seemed like a straightforward technical task. I expected to find mostly typos. But I also found texts generated by LLMs. These models are effective at creating plausible-sounding content, but (for now) they often fail to generate correct checksums for identifiers like ISBNs. This vulnerability turned my tool into an unintentional detector for this type of content. This talk is the story of that investigation. I'll show how the tool works and how it identifies this anti-knowledge. But the tech is only half the story. The other half is human. I contacted the editors who had added this undeclared AI content. I will talk about why they did it and how the Wikipedians reacted and whether \"The End is Nigh\" calls might be warranted.\n",
  "logo": null,
  "persons": [
    {
      "guid": "1ca8b022-2be2-5af1-b563-4ced084e5692",
      "name": "Mathias Schindler",
      "public_name": "Mathias Schindler",
      "avatar": null,
      "biography": "Ich habe einige Jahre lang bei Wikimedia Deutschland Open Data-Themen gemacht, dann als Mitarbeiter eines Europaparlamentsabgeordneten Urheberrecht, Open Data und andere Themen und habe nun erfolgreich Open Data zu meinem Hobby gemacht, seit ich in der Privatwirtschaft bin.\n\nAußerdem mag ich IFG, VIG, UIG und DSGVO.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_1ca8b022-2be2-5af1-b563-4ced084e5692"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/ai-generated-content-in-wikipedia-a-tale-of-caution",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/9KWKDP/",
  "attachments": [
    {
      "url": "/media/39c3/submissions/9KWKDP/resources/39C3_-_AI-generated_content_in_1REKZ1p.pdf",
      "type": "related",
      "title": "Slides"
    }
  ]
}