{
  "guid": "134bc4e1-a519-5655-a233-c903af791105",
  "code": "KWC79V",
  "id": 134415,
  "date": "2025-12-29T20:00:00+01:00",
  "start": "20:00",
  "duration": "01:00",
  "room": "Stonewall IO (Saal Y 06)",
  "slug": "39c3-austauschrunde-wie-kann-online-dating-in-einem-dat",
  "title": "Austauschrunde: Wie kann Online-Dating in einem datensicheren, nicht-kommerziellen Safe(r) Space stattfinden? [all creatures welcome]",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "Workshop",
  "abstract": "Ich habe keine Lösungen, möchte aber einen Raum für Austausch schaffen.",
  "description": "Diese Austauschrunde ist vielleicht für dich interessant, wenn du dich hierdurch angesprochen fühlst:\n\n- Du willst gern einen neuen Menschen kennenlernen, möchtest aber in deinem Tempo und selbstbestimmt entscheiden, wann du welche Informationen über dich in einem Kennenlernprozess teilst?\n- Du möchtest nicht, dass deine Daten kommerziell genutzt werden?\n- Aktuell bestehende Dating-Apps fühlen sich für dich nicht nach einem Safe Space an?\n- Du möchtest gern die Vorteile von Online-Dating nutzen, z.B. weil du schüchtern bist oder eine Lebenssituation hast, in der du wenig neue Menschen kennenlernen kannst?\n- Du möchtest dich mit anderen austauschen und erwartest dabei keine \"fertigen Lösungen\"?\n\nDie Austauschrunde richtet sich an Personen, die aktuell gern einen neuen Menschen kennenlernen möchten. Es ist aber KEIN SPEED-DATING, sondern es geht um einen inhaltlichen Austausch, z.B. auf persönlicher, gesellschaftlicher, gern auch technischer Ebene.\n\nDie Austauschrunde ist für Menschen ab 18 Jahren, denen ein wertschätzender und rücksichtsvoller Austausch zum Thema wichtig ist.\n",
  "logo": null,
  "persons": [
    {
      "guid": "5fbbf96b-09af-586d-a566-0d2b8c5b4584",
      "name": "Okapi",
      "public_name": "Okapi",
      "avatar": null,
      "biography": "Das Okapi ist eine Frau.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_5fbbf96b-09af-586d-a566-0d2b8c5b4584"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/austauschrunde-wie-kann-online-dating-in-einem-dat",
  "links": [],
  "origin_url": "https://pretalx.c3voc.de/39c3-haecksen-workshops-2025/talk/KWC79V/",
  "feedback_url": "https://pretalx.c3voc.de/39c3-haecksen-workshops-2025/talk/KWC79V/feedback/"
}