{
  "guid": "1511188c-92ca-5002-b411-591b5f848e14",
  "code": "9M7DLC",
  "id": 2232,
  "date": "2025-12-28T21:05:00+01:00",
  "start": "21:05",
  "duration": "00:40",
  "room": "Zero",
  "slug": "39c3-wie-wir-alte-flipperautomaten-am-leben-erhalten",
  "title": "Wie wir alte Flipperautomaten am Leben erhalten",
  "subtitle": null,
  "language": "de",
  "track": "Hardware",
  "type": "Talk",
  "abstract": "Der Vortrag beschreibt, wie eine Gruppe von Begeisterten eine Sammlung von ca. 100 Flipperautomaten (Pinball Machines) am Leben und in spielbereitem Zustand erhält.",
  "description": "Der Vortrag gibt einen Einblick in die verschiedenen Generationen von Flippern und deren Technik. Angefangen von elektromechanischen Geräten aus den frühen Sechzigern, über erste Prozessorsteuerungen, bis hin zu modernsten computergesteuerten Automaten mit Bussystemen. Jede Generation hat ihre technischen Eigenheiten, ihre typischen Fehlermuster und Schwachstellen. \nIn öffentlichen Räumen sind heutzutage kaum mehr Flipper anzutreffen. Das liegt insbesondere daran, dass deren Wartung aufwändig ist, weil durch die mechanische Beanspruchung häufig Fehler auftreten. Bereits kleinste technische Probleme können den Spielspaß zunichte machen.\nDas Finden und Beheben von Fehlern erfordert viel Erfahrung – und manchmal Kreativität, insbesondere wenn alte Bauteile nicht mehr verfügbar sind oder kaum Dokumentation vorhanden ist. Technisch ist Sachverstand auf vielen Ebenen erforderlich, vom Schaltplanlesen über Löten und elektronische Messtechnik, bis hin zu mechanischem Know-how.\nDie Community der Flipper-Enthusiasten ist allerdings groß und kooperativ, sodass auch private Sammler ihre Flipper am Laufen halten können.\n",
  "logo": null,
  "persons": [
    {
      "guid": "092084dc-2c4f-5e64-9eea-45b156c56b79",
      "name": "Axel Böttcher",
      "public_name": "Axel Böttcher",
      "avatar": "https://cfp.cccv.de/media/avatars/XMXQFR_iLDWfm8.png",
      "biography": "Ich restauriere, sammle und warte seit 20 Jahren Flipperautomaten. Im echten Leben bin ich Prof für Softwareentwicklung an der Hochschule München.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_092084dc-2c4f-5e64-9eea-45b156c56b79"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/wie-wir-alte-flipperautomaten-am-leben-erhalten",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/9M7DLC/"
}