{
  "guid": "151d4fb0-5d25-586b-8063-c7706bbd9094",
  "code": "V9PXC3",
  "id": 1374,
  "logo": "https://cfp.cccv.de/media/39c3/submissions/V9PXC3/pnp-w-mrk_smF9l2Y_GKMot5v_cCPoueV_3FlIBaq.webp",
  "date": "2025-12-28T19:15:00+01:00",
  "start": "19:15",
  "duration": "00:40",
  "room": "One",
  "slug": "39c3-1374-in-house-electronics-manufacturing-from-scratch-how-hard-can-it-be",
  "url": "https://cfp.cccv.de/39c3/talk/V9PXC3/",
  "title": "In-house electronics manufacturing from scratch: How hard can it be?",
  "subtitle": "",
  "track": "Hardware",
  "type": "Talk",
  "language": "en",
  "abstract": "Why is electronics manufacturing hard? Can it ever be made easy and more accessible? What will it take to relocate industrial production to Europe?\r\n\r\nWe share with you what we learned when we spent more than 1 year setting up our own production line in our office in Hamburg. Turns out a lot of the difficulties are rarely talked about or hidden behind \"manufacturing is high CAPEX\". \r\n\r\nCome and learn with us the nitty gritty details of batch reflow ovens, stencil printing at scale, and how OpenPnP is a key enabler in our process. While we are far from done with this work, we hope to see others replicate it and collectively reclaim the ownership of the means of electronics production.",
  "description": "Our industry needs a reboot as well, it no longer serves the people.\r\n\r\nOur work is based on our belief that high-quality high-mix/low volume manufacturing of electronics in Europe is economically viable and accessible to small companies with a lower-than-expected up-front investment.\r\n\r\nWe believe that relocation of industry to Europe depends on small innovative companies, and will not come from slow and bloated industry giants whose products are victims of enshittification and maximum profit extraction.\r\n\r\nBy using open-source hardware and software whenever possible, we are attempting to set up our own production operation in Hamburg and we want to share the solutions and enable others to do the same and collectively reclaim ownership of the means of production.\r\n\r\nWe will cover:\r\n- How we acquired and set up production machines, their costs, and our learnings\r\n- Quirks of paste printing and reflow soldering at scale (up to 50 batches a day)\r\n- Component inventory, tracking, DfM, etc.\r\n- How OpenPnP is a key enabler of our prcesses\r\n    - Our proposed changes to OpenPnP\r\n    - Our work integrated Siemens Siplace Feeders in OpenPnP",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "J87VYG",
      "name": "Augustin Bielefeld",
      "avatar": "https://cfp.cccv.de/media/avatars/J87VYG_QCV4e7D.png",
      "biography": "Principal Engineer at Eilbek Research GmbH",
      "public_name": "Augustin Bielefeld",
      "guid": "a01f4f91-2231-51fe-b7ae-1c243aca18da",
      "url": "https://cfp.cccv.de/39c3/speaker/J87VYG/"
    },
    {
      "code": "WK8MQC",
      "name": "Alexander Willer",
      "avatar": "https://cfp.cccv.de/media/avatars/WK8MQC_AHoG1C9.jpg",
      "biography": "Hacker at night and Managing Director at Eilbek Research GmbH at day.",
      "public_name": "Alexander Willer",
      "guid": "4037854e-1815-57b7-b51f-20eeb04f62bb",
      "url": "https://cfp.cccv.de/39c3/speaker/WK8MQC/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/V9PXC3/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/V9PXC3/",
  "attachments": []
}