{
  "guid": "184bb132-6a17-5aa5-9ebe-08b1d5e3a767",
  "code": "TYX9VG",
  "id": 1456,
  "date": "2025-12-28T11:00:00+01:00",
  "start": "11:00",
  "duration": "01:00",
  "room": "Fuse",
  "slug": "39c3-digitale-inklusion-wie-wir-digitale-barrierefreiheit-fur-alle-erreichen-konnen",
  "title": "Digitale Inklusion: Wie wir digitale Barrierefreiheit für alle erreichen können",
  "subtitle": null,
  "language": "de",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "abstract": "Könntest du jetzt noch sagen, was du heute online gemacht hast? Für viele ist das Internet so selbstverständlich, dass sie es kaum noch merken, wenn sie es benutzen. Dennoch sind viele Menschen unfreiwillig aus der digitalen Welt ausgeschlossen. Wie könnte das Internet für alle nutzbar werden?",
  "description": "Für viele Menschen ist es selbstverständlich, online unterwegs zu sein. Dennoch sind weiterhin viele Menschen mit Beeinträchtigung online ausgeschlossen. Seit Juni 2025 sind durch das Barrierefreiheitsstärkungsgesetz ist digitale Barrierefreiheit für Unternehmen verpflichtend. Damit ist digitale Barrierefreiheit von einer Option zu einem Recht geworden. Trotz der gesetzlichen Vorgaben scheitert die digitale Barrierefreiheit in der Praxis häufig an der fehlenden Expertise von Verantwortlichen. Wir möchten aus drei Perspektiven auf Barrierefreiheit in der digitalen Welt schauen:\n\nLena Müller ist Entwicklerin und für die barrierefreie Gestaltung von Inhalten verantwortlich. Kathrin Klapper promoviert und nutzt in ihrem Alltag zum Sprechen einen Sprachcomputer mit Augensteuerung. Und Jakob Sponholz setzt sich in seiner Forschung mit der Frage auseinander, wie digitale Medien zur Inklusion beitragen können.\n\nWir möchten zunächst einen Einblick in die Mechanismen geben, die digitale Inklusion verhindern - sowohl theoretisch als auch praktisch. Anschließend möchten wir anhand von einfachen Beispielen zeigen, dass der Einstieg in die Gestaltung von barrierefreien Inhalten eigentlich gar nicht so schwer ist und es sich lohnt, einfach anzufangen.\n",
  "logo": "https://cfp.cccv.de/media/39c3/submissions/TYX9VG/IMG_9887_j2MEwqX_lDI1yY6_oBqmKeW_LUKCPJu.webp",
  "persons": [
    {
      "guid": "7b10030b-28d1-5716-a54f-10d9bfa6daef",
      "name": "Jakob Sponholz",
      "public_name": "Jakob Sponholz",
      "avatar": "https://cfp.cccv.de/media/avatars/7UJZXT_cep1qIw.jpg",
      "biography": "**Jakob Sponholz** ist wissenschaftlicher Mitarbeiter und Doktorand an der Universität zu Köln. \nSeine Arbeits- und Forschungsschwerpunkte liegen in den Bereichen **digitale Teilhabe**, **inklusive Medienbildung** und dem **Einsatz digitaler Medien in sonderpädagogischen Kontexten**. Außerdem forscht er zu digitaler Barrierefreiheit, der Entwicklung Asstistiver Technologien aus dem 3D-Drucker und dem Einsatz Künstlicher Intelligenz in inklusiven Bildungsprozessen.\n\n**KI-Stimme für Dozentin an der Uni Köln**: http://inklusivemedienbildung.de/stimme\n**Individuelle Hilfen aus dem 3D-Drucker**: https://www.thingiverse.com/jakobsponholz/designs\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_7b10030b-28d1-5716-a54f-10d9bfa6daef"
    },
    {
      "guid": "04e8658b-c2eb-5941-9619-956005287fa1",
      "name": "Kathrin Klapper",
      "public_name": "Kathrin Klapper",
      "avatar": "https://cfp.cccv.de/media/avatars/LLHWJT_aca7bMU.jpg",
      "biography": "Kathrin Klapper ist Wissenschaftliche Mitarbeiterin der Universität zu Köln und forscht zu kommunikativer Teilhabe von unterstützt kommunizierender Menschen. Als selbst unterstützt kommunizierende Frau hält sie Vorträge und Seminare, verknüpft darin ihre eigenen Erfahrungen mit Fachwissen und setzt sich in Politik und Gesellschaft dafür ein, dass Unterstützte Kommunikation in der Öffentlichkeit bekannter wird.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_04e8658b-c2eb-5941-9619-956005287fa1"
    },
    {
      "guid": "0ebea638-a19a-57d1-b0c4-a44e518b7139",
      "name": "Lena Christina Müller",
      "public_name": "Lena Christina Müller",
      "avatar": "https://cfp.cccv.de/media/avatars/83NG7W_TembRQC.jpeg",
      "biography": "In her work as a IT-solution architect and coordinator for software solutions, Lena focuses on the sustainability and reusability of software modules at Siemens. Her mission is to advance the accessible design of web applications.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_0ebea638-a19a-57d1-b0c4-a44e518b7139"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/digitale-inklusion-wie-wir-digitale-barrierefreiheit-fur-alle-erreichen-konnen",
  "links": [
    {
      "url": "http://inklusivemedienbildung.de/stimme",
      "type": "related",
      "title": "Link zum Projekt: Neue Stimme für Dozentin an der Universität zu Köln"
    }
  ],
  "origin_url": "https://cfp.cccv.de/39c3/talk/TYX9VG/"
}