{
  "guid": "1b61fba3-1056-523d-a9b4-e15c18f24d42",
  "code": "N7K8KG",
  "id": 2429,
  "date": "2025-12-27T15:20:00+01:00",
  "start": "15:20",
  "duration": "00:15",
  "room": "Am Spätverkauf",
  "slug": "39c3-zwischen-brandanschlagen-und-platzbesetzungen-eine",
  "title": "Zwischen Brandanschlägen und Platzbesetzungen: Eine antirassistische Geschichte aus Bern (1980 - 2000)",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "Antifa Lightning Talk",
  "abstract": "Anfang der 90er brennen in der Schweiz die Asylheime. Nicht Rostock oder Hoyerswerda, sondern auch Chur, Lotzwil und Konolfingen bei Bern. Das ist die oft vergessene Welle rechtsextremen Terrors mitten in der Schweiz.\r\nRechtsextreme Skinheadgruppen, später Blood & Honour- und Hammerskins-Strukturen, traten offen auf, organisierten Konzerte, patrouillierten in Gruppen durch Städte und agierten äusserst brutal. Die staatliche Reaktion blieb lange verhalten – Bagatellisierung, Wegschauen, fehlende Ermittlungen. Antifaschistische Organisation und Selbstschutz wurden damit zur Notwendigkeit.\r\nParallel dazu entwickelte sich in Bern eine kraftvolle antirassistische Bewegung, die weit über Szenepolitik hinausging. Während rechts motivierte Gewalt zunahm und Asylgesetzverschärfungen politische Mehrheiten fanden, begann ein breiter gesellschaftlicher Widerstand, getragen von migrantischen Communities, Gewerkschaften und linken Gruppen. In dieser Zeit fanden grosse Demonstrationen für die Antirassismusstrafnorm statt – ein Gesetz, das damals hart umkämpft war und dessen Annahme erst durch massiven öffentlichen Druck möglich wurde. Gleichzeitig entstand eine breite Sans-Papiers-Bewegung: Platzbesetzungen, Kirchenasyle, Streiks, «Papierlose Restaurants» und lokale Netzwerke machten sichtbar, dass Tausende Menschen ohne geregelten Status in der Schweiz leben und arbeiten.\r\nDie Kämpfe dieser Jahre zeigen deutlich, dass antifaschistische und antirassistische Arbeit nicht getrennt voneinander existierten: Sie waren eine gemeinsame Antwort auf rechte Gewalt, und staatliche Ignoranz.",
  "description": "",
  "logo": null,
  "persons": [
    {
      "guid": "87a595dc-b58a-5548-986e-96e597a7cafa",
      "name": "gabel",
      "public_name": "gabel",
      "avatar": null,
      "biography": "Aktivisti aus Bern\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_87a595dc-b58a-5548-986e-96e597a7cafa"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/zwischen-brandanschlagen-und-platzbesetzungen-eine",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3-call-for-punk/talk/N7K8KG/",
  "feedback_url": "https://cfp.cccv.de/39c3-call-for-punk/talk/N7K8KG/feedback/",
  "do_not_record": true
}