{
  "guid": "1bbd6873-6f69-59a8-8eb2-926acc763d7e",
  "code": "ZLNZUS",
  "id": 2149,
  "logo": null,
  "date": "2025-12-27T16:00:00+01:00",
  "start": "16:00",
  "duration": "01:00",
  "room": "Ground",
  "slug": "39c3-2149-of-boot-vectors-and-double-glitches-bypassing-rp2350-s-secure-boot",
  "url": "https://cfp.cccv.de/39c3/talk/ZLNZUS/",
  "title": "Of Boot Vectors and Double Glitches: Bypassing RP2350's Secure Boot",
  "subtitle": "",
  "track": "Security",
  "type": "Talk",
  "language": "en",
  "abstract": "In August 2024, Raspberry Pi released their newest MCU: The RP2350. Alongside the chip, they also released the RP2350 Hacking Challenge: A public call to break the secure boot implementation of the RP2350. This challenge concluded in January 2025 and led to five exciting attacks discovered by different individuals.\r\n\r\nIn this talk, we will provide a technical deep dive in the RP2350 security architecture and highlight the different attacks. Afterwards, we talk about two of the breaks in detail---each of them found by one of the speakers. In particular, we first discuss how fault injection can force an unverified vector boot, completely bypassing secure boot. Then, we showcase how double glitches enable direct readout of sensitive secrets stored in the one-time programmable memory of the RP2350.\r\n\r\nLast, we discuss the mitigation of the attacks implemented in the new revision of the chip and the lessons we learned while solving the RP2350 security challenge. Regardless of chip designer, manufacturer, hobbyist, tinkerer, or hacker: this talk will provide valuable insights for everyone and showcase why security through transparency is awesome.",
  "description": "The RP2350 is one of the first generally available microcontrollers with active security-features against fault-injection such as glitch-detectors, the redundancy co-processor, and other pieces to make FI attacks more difficult.\r\n\r\nBut security on paper often does not mean security in real-life. Luckily for us, Raspberry Pi also ran the RP2350 Hacking Challenge: A public bug bounty that has exactly these attacks in-scope. During the hacking challenge 5 different attacks were found on the secure-boot process - one of which was shown at 38C3 by Aedan Cullen.\r\n\r\nIn this talk, we talk about all successful attacks - including laser fault-injection, a reset glitch, and a double-glitch during execution of the bootrom - to show all the different ways in which a chip can be attacked.\r\n\r\nWe also talk about the awesomeness of an open security-ecosystem for chips: Raspberry Pi was very transparent on the findings, and worked with researchers to improve the new revision of the chip.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "GQK3WY",
      "name": "stacksmashing",
      "avatar": null,
      "biography": "Thomas Roth, also known as stacksmashing, is a security researcher with focus on embedded systems. His published research includes research on vulnerabilities in microcontrollers, hardware wallets, industrial systems, TrustZone and mobile devices. He is also well known for publishing educational material on his YouTube channel “stacksmashing”, and released a lot of open-source hardware security tools, such as the chip.fail glitcher.t",
      "public_name": "stacksmashing",
      "guid": "62483a61-3c63-5fb0-84be-e2c981e8bc23",
      "url": "https://cfp.cccv.de/39c3/speaker/GQK3WY/"
    },
    {
      "code": "VX9FZB",
      "name": "nsr",
      "avatar": null,
      "biography": null,
      "public_name": "nsr",
      "guid": "f3c3f333-b481-5608-a11d-8475e883e0cf",
      "url": "https://cfp.cccv.de/39c3/speaker/VX9FZB/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/ZLNZUS/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/ZLNZUS/",
  "attachments": []
}