{
  "guid": "1bcccacb-a81c-5adc-87ee-b2cc40421bce",
  "code": "TFEDKN",
  "id": 400012,
  "date": "2025-12-27T19:00:00+01:00",
  "start": "19:00",
  "duration": "01:00",
  "room": "FNF Assembly",
  "slug": "39c3-widerspruch-gegen-die-elektronische-patientenakte-",
  "title": "Widerspruch gegen die elektronische Patientenakte - jetzt gleich hier erledigen",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "Help desk",
  "abstract": "Bei uns kannst Du sehr einfach Deiner ePA widersprechen. Hierfür haben wir für Dich ein Formular vorbereitet, dass Du ausfüllst, wir schicken das dann an Deine Krankenkasse. \r\nDas geht auch außerhalb unserer \"Sprechzeiten\", komm einfach jederzeit vorbei, auch wenn wir nicht da sind liegt eine Anleitung aus wie das funktioniert.\r\nDarüber hinaus bieten wir noch andere Widersprüche und Auskünfte an.",
  "description": "Als gesetzlich Versicherter hast Du Anfang 2025 eine ePA erhalten, in der fortan alle Deine Behandlungsdaten (Diagnosen, Medikamente, Zahnbehandlungen, ...) protokolliert werden. Wir raten zum Widerspruch und helfen gerne dabei und stehen für Fragen zur Verfügung.\n\nDarüber hinaus bieten wir Widerspruchsformulare gegen das Durchsuchen Deiner Abrechnungsdaten durch die Krankenkassen an. Damit will die Krankenkasse auf Basis Deiner persönlichen Daten ein sog. Risikoprofil für Dich erstellen.\n\nAußerhalb unserer \"Sprechzeiten\" findest Du an unserem Stand eine Anleitung, die Dir zeigt wie Du Deiner ePA widersprechen kannst.\n\nAlternativ kannst Du auch unseren Widerspruchsgenerator dafür nutzen, den Du auf unserer Webseite 'https://widerspruch-epa.de' findest.\n\nZusätzlich kannst Du auch eine Auskunft bei Deiner Krankenasse zu allen dort vorliegenden Daten von Dir machen.\n",
  "logo": null,
  "persons": [
    {
      "guid": "0393f5c1-0680-5062-b5d8-5bc994f335d6",
      "name": "flysch",
      "public_name": "flysch",
      "avatar": null,
      "biography": null,
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_0393f5c1-0680-5062-b5d8-5bc994f335d6"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/widerspruch-gegen-die-elektronische-patientenakte-",
  "links": [],
  "origin_url": "https://fnf-39c3-pretalx.my-server.in/fnf-at-39c3-2025/talk/TFEDKN/",
  "feedback_url": "https://fnf-39c3-pretalx.my-server.in/fnf-at-39c3-2025/talk/TFEDKN/feedback/"
}