{
  "guid": "1c7a26ad-1d1d-53f2-aa09-23e623b6fa3e",
  "code": null,
  "id": 300090,
  "date": "2025-12-28T18:00:00+01:00",
  "start": "18:00",
  "duration": "00:40",
  "room": "CDC Triangle",
  "slug": "39c3-the-bitcoin-security-budget-and-its-implications-a",
  "title": "The Bitcoin Security Budget and Its Implications A Look at the Security, Scaling and Spam Resistance of Proof of Work Cryptocurrencies",
  "subtitle": null,
  "language": "en",
  "track": null,
  "type": "Talk",
  "abstract": "The Bitcoin security budget has profound implications for the long term security of Bitcoin and similar proof of work cryptocurrencies. In this talk we discuss the various types of transaction fee markets for different cryptocurrencies and the possibility of transaction fees replacing falling block rewards to provide security in the future. The results from our analysis of the Monero fee market in particular do pose some very serious questions regarding the long term security and viability of cryptocurrencies that do not have a minimum fixed block reward or tail emission. We will discuss these questions and their implications for the possibility of a worldwide peer-to-peer electronic cash system.",
  "description": "Satoshi Nakamoto released Bitcoin: A Peer-to-Peer Electronic Cash System, in October 2008, https://bitcoin.org/bitcoin.pdf,  during the 2008 financial crisis. The Bitcoin genesis block was mined in January 2009 launching the Bitcoin network. The design of Bitcoin has a maximum money supply of 21 million Bitcoin (BTC). The security budget consisting of the block reward and transaction fees per block is paid to the miner (creator) of each block as an incentive to secure the network. The blocks in Bitcoin are approximately every 10 minutes. The block reward is required by consensus to halve approximately every 4 years, starting at 50 BTC per block in 2009, and is currently at 3.125 BTC per block. This leads to a current annual growth rate of the total Bitcoin money supply that is below 1%. The next halving to 1.5625 BTC is estimated to occur in April of 2028. Transaction fees are currently less than 1% of the total Bitcoin security budget.\n\nIt is claimed in section 6 of the Bitcoin whitepaper that:\n\n“Once a predetermined number of coins have entered circulation, the incentive can transition entirely to transaction fees and be completely inflation free”;\n\nhowever no evidence, theory or references are provided to support this claim.\n\nThe above model, with some variations, has been followed by most of the top proof of work cryptocurrencies, including Bitcoin Cash (BCH), Litecoin (LTC), and ZCash (ZEC). There are however some notable exceptions, Dogecoin (DOGE) and Monero (XMR). Both Dogecoin and Monero have fixed block rewards. In Dogecoin this was the result of a bug in the code; however in Monero a fixed minimum block reward or tail emission was deliberately set at the constant rate 0.6 XMR per block. The blocks in Monero are approximately every 2 minutes. This leads to an annual growth rate of the total Monero money supply that is below 1%. For comparison the historical annual compounded rate of growth of the gold money supply is close to 1%.\n\nThe fee market in a cryptocurrency is also highly dependent on whether the blocksize is fixed, as in  Bitcoin, Dogecoin, Litecoin and ZCash or adaptive as in Bitcoin Cash and Monero. In the case of adaptive blocksizes the question becomes: Is there a penalty (cost) to increase the blocksize as in Monero or no cost to increase the blocksize as in Bitcoin Cash?\n\nA balance needs to be found in the design of a cryptocurrency between allowing for blocksize growth in order to support the transaction demand for peer to peer electronic cash, and the necessity of spam mitigation.   The use of privacy preserving technologies can also have a profound impact on this balance, by increasing the transaction size, while at the same time preventing the use of censorship, as a means of spam mitigation. In Monero for example this increase will be by a factor of around 20 times, after the upcoming Full Chain Membership Proofs, plus plus (FCMP++) hard fork. This makes finding this balance in cryptocurrencies such as Monero with no option to opt out of privacy, by far the hardest. On the other hand a solution that works in Monero will also work in a cryptocurrency with a lesser degree of privacy.\n\nIn the presentation we will discuss the following questions:\nHow do the various types of fee markets: fixed blocksize, adaptive blocksize with penalty, and adaptive blocksize without penalty work?\nCan transaction fees replace the falling block rewards or are fixed block rewards necessary?\nAre there advantages or disadvantages to replacing block rewards with transaction fees?\nIs it possible to have a fixed block reward and still be inflation free? \nDo we have a peer-to-peer electronic cash system or just another kind of asset for investment and speculation using centralized financial institutions?\nIs a worldwide peer-to-peer electronic cash system possible now or in the foreseeable future?\n\nWe will also discuss some of the broader implications\n",
  "logo": null,
  "persons": [
    {
      "guid": "6b601054-fb6f-53a1-8bfd-95a761079e68",
      "name": "Francisco \"ArticMine\" Cabañas",
      "public_name": "Francisco \"ArticMine\" Cabañas",
      "avatar": null,
      "biography": "Francisco  Cabañas (articmine@getmonero.org): Based in Canada, Francisco holds a PhD and MSc in Physics, a BSc in Physics and Mathematics, and has extensive business and non-profit experience. He has actively researched and invested in cryptocurrencies, since 2011, and focuses on the economic, social, regulatory and long-term economic viability aspects of cryptocurrencies. Francisco has researched and studied scaling. POW security, spam mitigation, fees, fee markets and the adaptive block weight in Monero since 2014. He is currently working on the scaling, spam mitigation and fees of Monero, ahead of the upcoming fork of Monero to implement the Full Chain Membership Proofs plus plus (FCMP++) privacy and fungibility upgrade. Francisco  also has been a Core Team Member of the Monero Project, https://getmonero.org/, since 2016.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_6b601054-fb6f-53a1-8bfd-95a761079e68"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/the-bitcoin-security-budget-and-its-implications-a",
  "links": [],
  "origin_url": "https://pretalx.riat.at/39c3/talk/9ZX9ET/"
}