{
  "guid": "1e0b17f8-d1e2-5d75-b052-811b8f722b38",
  "code": "BX3NXQ",
  "id": 1495,
  "logo": "https://cfp.cccv.de/media/39c3/submissions/BX3NXQ/Steuerbetrug_vs._Sozialbetrug_7Ns8GOb.png",
  "date": "2025-12-29T17:15:00+01:00",
  "start": "17:15",
  "duration": "01:00",
  "room": "Zero",
  "slug": "39c3-1495-wer-liegt-hier-wem-auf-der-tasche-genug-mit-dem-burgergeld-fetisch-sturmt-die-palaste",
  "url": "https://cfp.cccv.de/39c3/talk/BX3NXQ/",
  "title": "Wer liegt hier wem auf der Tasche? Genug mit dem Bürgergeld-Fetisch. Stürmt die Paläste!",
  "subtitle": "",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "language": "de",
  "abstract": "Das Bürgergeld ist Geschichte. An seine Stelle tritt eine Grundsicherung, die auf kalkulierten Verfassungsbruch setzt. Totalsanktionen, Vermittlungsvorrang, Quadratmeterdeckel, jeder Move bedeutet umfassendere staatliche Überwachung. Die Bezahlkarte soll in Hamburg perspektivisch zunächst auf Sozialhilfe‑ und Jugendhilfebeziehende ausgeweitet werden. Sind Bürgergeldbeziehende als nächstes dran?",
  "description": "Die neue Grundsicherung trumpft Hartz IV in seiner Grausamkeit und ist ein Damoklesschwert über Erwerbslosen und allen, die Lohnarbeit machen. Zugleich nimmt die Zahl der Milliardäre und Mulitmillionäre stetig zu. Finanzbetrug durch Überreiche wird mehr oder weniger tatenlos zugesehen, während das Phantom des Bürgergeld-Totalverweigerers seit Jahren durch die Medien getrieben wird. \r\n\r\nWie der Angriff auf den Sozialstaat sich auf die Betroffenen in der Praxis auswirkt und was wir als Zivilgesellschaft tun können, um nicht nur tatenlos zusehen zu müssen, darum geht es in diesem Talk.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "VV7YBE",
      "name": "Helena Steinhaus",
      "avatar": "https://cfp.cccv.de/media/avatars/VV7YBE_v6yyr3D.jpg",
      "biography": "Helena Steinhaus ist Gründerin des Vereins Sanktionsfrei, der sich seit 2015 für eine menschenwürdige Grundsicherung einsetzt. Ihr Buch \"Es braucht nicht viel - Wie wir unseren Sozialstaat demokratisch, fair und armutsfest machen\" ist 2023 im Fischerverlag erschienen.",
      "public_name": "Helena Steinhaus",
      "guid": "8ae205f6-f51c-54ce-8183-58d0fd9a1604",
      "url": "https://cfp.cccv.de/39c3/speaker/VV7YBE/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/BX3NXQ/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/BX3NXQ/",
  "attachments": []
}