{
  "guid": "228baf20-b5bc-533a-b24a-b58169d7a134",
  "code": "TTX83E",
  "id": 228205,
  "date": "2025-12-27T13:45:00+01:00",
  "start": "13:45",
  "duration": "01:30",
  "room": "Stonewall IO (Saal Y 06)",
  "slug": "39c3-flinta-neurodivergenz-meetup",
  "title": "FLINTA* Neurodivergenz-Meetup [FLINTA* only]",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "Workshop long",
  "abstract": "EN below\r\nFLINTA\\*-Workshop zu Neurodivergenz im Chaos: Austausch, gegenseitige Unterstützung und drei Themenrunden zu allem, was euch bewegt. Safe Space für ADHS, Autismus & Co – bringt eure Themen mit, ohne Diagnose, ohne Druck, ganz im eigenen Tempo.\r\n- - -\r\nFLINTA\\*-Workshop on Neurodivergence in the chaos community: Exchange, mutual support, and discussion rounds about whatever is on your mind. A safe space for ADHD, autism & Co - bring your own topics, no diagnosis required, no pressure, at your own pace.",
  "description": "**If needed, the session can be led in English, and English-speaking discussion groups can be formed.**\nEN description below\n\n### System overload? Executive dysfunction in progress? Willkommen im Chaos!\n\nDieser Workshop ist für alle neurodivergenten FLINTA\\* (Frauen, Lesben, inter, nicht-binäre, trans und agender Personen). Gemeinsam schaffen wir Raum für Austausch, gegenseitige Unterstützung und Sichtbarkeit neurodiverser Erfahrungen – von ADHS über Autismus bis Tourette und darüber hinaus.\n\nWir starten mit einer kurzen Vorstellungsrunde, sammeln gemeinsam Themen und tauchen dann in zwei aufeinanderfolgende Kleingruppenphasen à 30 Minuten ein. So kannst du zu mehreren Themen reinspringen, dich austauschen, zuhören oder einfach dabeisein.\nBringt gerne eure eigenen Themen, Fragen oder Gedanken mit – alles, was euch bewegt, hat hier Platz.\n\nWenn ihr nach den 2h noch in Gesprächen vertieft seid, könnt ihr es euch in der Haecksen Assembly neben dem Workshopraum gemütlich machen - ganz ohne Zeitlimit, ganz im eigenen Tempo\n\nDieser Workshop ist ein Safe Space für FLINTA\\* , um neurodivergente Erfahrungen aus dieser Perspektive zu teilen, neues zu lernen und sich gegenseitig zu stärken.\nKeine Diagnose nötig, kein Druck: Wenn die Zeitblindheit kickt oder das Chaos zu viel wird – komm später, geh früher, alles okay!\n\n- - -\nSystem overload? Executive dysfunction in progress? Welcome to the chaos!\n\nThis workshop is for all neurodivergent FLINTA* individuals (women, lesbians, intersex, non-binary, trans, and agender people). Together we'll create space for exchange, mutual support, and visibility of neurodiverse experiences - from ADHD to autism to Tourette's and beyond.\n\nWe'll start with a brief round of introductions, gather some topics, and then dive into two consecutive small group sessions of 30 minutes each. This way you can jump into multiple topics, share experiences, listen, or simply be present.\nFeel free to bring your own topics, questions, or thoughts - whatever is currently on your mind.\n\nIf you're still deep in conversation after the 90 minutes are over, you're welcome to continue in the Haecksen Assembly next to the workshop room without any time limit, completely at your own pace.\n\nThis is a safe space for FLINTA* folks to share neurodivergent experiences from this perspective, learn new things, and support each other.\n\nNo diagnosis required, no pressure: If time blindness kicks in or the chaos gets overwhelming, feel free to come late or leave early, whatever works for you!\n",
  "logo": null,
  "persons": [
    {
      "guid": "e0f0b209-83b6-5e30-b65f-d29e8150fdf8",
      "name": "Tschotsch",
      "public_name": "Tschotsch",
      "avatar": "https://pretalx.c3voc.de/media/avatars/XVLS87_OPLHdQs.jpeg",
      "biography": "She/Her\n- Biomedical Information Technology Engineering  Student  - also known as Certified Nerd™\n- Chaotic | Neurodivergent | Feminist | Haeckse | Chronically ill\n- loves: Bouldering, CTFs, being creative\n- Proud Owner of three Hajs🦈🦈🦈\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_e0f0b209-83b6-5e30-b65f-d29e8150fdf8"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/flinta-neurodivergenz-meetup",
  "links": [],
  "origin_url": "https://pretalx.c3voc.de/39c3-haecksen-workshops-2025/talk/TTX83E/",
  "feedback_url": "https://pretalx.c3voc.de/39c3-haecksen-workshops-2025/talk/TTX83E/feedback/"
}