{
  "guid": "244236eb-d9c5-524b-bfd8-9e77a5326430",
  "code": "VBJ7X9",
  "id": 2523,
  "date": "2025-12-30T01:00:00+01:00",
  "start": "01:00",
  "duration": "01:00",
  "room": "Chaos Computer Music Club",
  "slug": "39c3-rob-strobe",
  "title": "Rob StrobE",
  "subtitle": null,
  "language": "de",
  "track": "DJ-Set",
  "type": "DJ Set",
  "abstract": "THE SECOND DECADE \r\n\r\nBorn `78 in Germany Rob StrobE grew up and being influenced with classical music, swing and jazz in his childhood. \r\nHe early discovered the likes of Depeche Mode, Michael Jackson, Kraftwerk and more early electronic music approaches. \r\nIn his late youth/early adult life he frequently travelled to Frankfurt attending nights at the Omen. Those nights and weekends were filled with DJs like Sven Vaeth, Dj Rush, Chris Liebing, G-Man aka Gez Varley, Hardfloor and so many more, celebrating and transporting the spirit of those days! \r\nAfter the closing of the Omen in late 1998 he went on to clubs like u60311, Tanzhaus West, MTW and others and eventually started his career as professional (sound) technician and light jockey. \r\nAround the year 2002 he started music production - mostly for personal fun and recreational purposes - but some records and remixes have been released since then...some of this older work can still be found on his Soundcloud! \r\nSince then he developed his own company specialized on music studio technology, room acoustic, signal flow schemes and studio furniture. Meanwhile his own studio transformed from a small Home Studio to a „room-in-room“ environment in the Logic Haus - the former home of Harthouse, Eye-Q and Snap! If he had to describe his musical style and give it a name: it would be „DubHouseTechno with a pinch of Detroit\" ;) FastFoward: Year 2021 - after a 7 year break of releasing music, Rob StrobE is back with releases on imprints like Lucidflow, ASrecords, Tantara, Motech and numerous others! Rob used the time to do a major swap from software based production over to the modular and hardware world and the output speaks for itself! Enjoy his music and come pass for a visit on his social media outlets and say „hello“! \r\n\r\nTHANKS FOR YOUR SUPPORT!!! \r\n\r\nCOLLABORATIONS with \r\nG-Man aka Gez Varley (Swim/Quo Vadis/UK) Bo_Irion (Conaisseur/FFM)\r\nAPro (Audio Emissions/FFM)\r\nVoodoe (Audio Emissions/FFM)\r\nFrank Kusserow (Data Punk/WhiteNoise/FFM)\r\nIsrael Toledo (ASRecords/Mexico)",
  "description": "",
  "logo": "https://cfp.cccv.de/media/39c3-chaos-computer-music-club/submissions/VBJ7X9/A6330F24-62CA_FxBwxji.webp",
  "persons": [
    {
      "guid": "764946ba-cec5-555a-a1d8-c8596581f426",
      "name": "Rob StrobE",
      "public_name": "Rob StrobE",
      "avatar": null,
      "biography": null,
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_764946ba-cec5-555a-a1d8-c8596581f426"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/rob-strobe",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3-chaos-computer-music-club/talk/VBJ7X9/",
  "feedback_url": "https://cfp.cccv.de/39c3-chaos-computer-music-club/talk/VBJ7X9/feedback/"
}