{
  "guid": "272591e8-0754-5fa1-8472-50f00dab31ac",
  "code": "WHGYRX",
  "id": 1743,
  "date": "2025-12-29T14:45:00+01:00",
  "start": "14:45",
  "duration": "01:00",
  "room": "Fuse",
  "slug": "39c3-learning-from-south-korean-telco-breaches",
  "title": "Learning from South Korean Telco Breaches",
  "subtitle": null,
  "language": "en",
  "track": "Security",
  "type": "Talk",
  "abstract": "2025 was a bad year for South Korean mobile network operators. All three operators (SK Telecom, KT, LG U+) were affected by breach in some part of their respective network: HSS of SK Telecom, femtocells of KT. Meanwhile, handling of the breach by each operators and post-mortem analysis of each breaches have stark differences. The technical details and implemented mitigations are often buried under the vague terms, and occasionally got lost in translation to English. In this talk, I will cover the technical aspects of SK Telecom and KT's breach, and how the operators are coping to the breach and what kind of measurements have been performed to secure their network.",
  "description": "This talk will cover the public information and experiments related to the South Korean telco breaches in 2025. This talk will cover SK Telecom's HSS breach (final results announced), KT's femtocell breach (investigation ongoing) and related operator billing fraud, and revisit Phrack report on KT and LG U+ breach. We also give a light on the detail regarding the implemented mitigation and diaster response of each operators.\n\nSK Telecom's HSS breach is attributed to a variant of BPFDoor malware, resulting leakage of critical operator data related to subscriber authentication and accounting. They replaced the SIM cards of all 23 million subscribers, and implemented additional mechanism to track the possible cloning of the SIM card. We analyze the aftermath and how it will effectively protect against the said attack.\n\nKT's femtocell and operator billing breach (investigation still ongoing as the time of writing) is attributed to the mismanagement of KT's femtocell, allowing an external attacker to mimick the behavior of KT's legitimate femtocell and use as a cellular interception device. This is a modern implementation of the remarkable research \"Weaponizing Femtocells\" back in 2012, and new cellular technologies like VoLTE have changed the possible attack vectors. We provide a possible theory on how the attack would be possible, based on the publicly available information and previous researches.\n\nFinally, we also cover the characteristics of South Korean mobile market and how the media caused the inaccurate analysis and FUD (fear, uncertainty, and doubt). In particular, how SMS-based 2FA is tied to personal authentication and how everything is strongly bound to the personal identity. Early media reports could be attributed to the information \"lost in translation\" and inaccurate information in English-language articles when the details of the breach were not widely shared. We try to correct the information (also in the official incidence report) and showcase how not to report the breach in general.\n",
  "logo": null,
  "persons": [
    {
      "guid": "33de4ca2-d09c-578d-bdb9-bbc166d2b568",
      "name": "Shinjo \"peremen\" Park",
      "public_name": "Shinjo \"peremen\" Park",
      "avatar": null,
      "biography": "Shinjo Park (peremen) is a security researcher with focus on cellular network equipment and modems.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_33de4ca2-d09c-578d-bdb9-bbc166d2b568"
    },
    {
      "guid": "1816e392-479a-5c68-a21a-2c16a8a641cb",
      "name": "Yonghyu \"perillamint\" Ban",
      "public_name": "Yonghyu \"perillamint\" Ban",
      "avatar": null,
      "biography": ". \n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_1816e392-479a-5c68-a21a-2c16a8a641cb"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/learning-from-south-korean-telco-breaches",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/WHGYRX/"
}