{
  "guid": "29d6f081-8e67-5f0c-84ac-2e7dbb64109d",
  "code": "ZER37T",
  "id": 2437,
  "date": "2025-12-28T15:20:00+01:00",
  "start": "15:20",
  "duration": "00:15",
  "room": "Am Spätverkauf",
  "slug": "39c3-infrastruktur-fur-aktivistis",
  "title": "Infrastruktur für Aktivistis",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "Antifa Lightning Talk",
  "abstract": "Aktivistis haben das Problem, dass sie sich Hauptsächlich um ihre Aktion kümmern wollen. Da bleibt oft keine Zeit zu entscheiden, wie eine sichere Infrastruktur gestaltet werden kann. Ich möchte einmal vorstellen, was unsere Gruppe als Idee hat um dieses Problem zu lösen.  Der Code hierfür ist noch nicht fertig, das ist eine Konzept vorstellung.",
  "description": "Aktivistis haben das Problem, dass sie sich Hauptsächlich um ihre Aktion kümmern wollen. Da bleibt oft keine Zeit zu entscheiden, wie eine sichere Infrastruktur gestaltet werden kann. Ich möchte einmal vorstellen, was unsere Gruppe als Idee hat um dieses Problem zu lösen.\n\nHierfür haben wir ein Programm geplant, welches einen Kubernetescluster zusammen stellt und diesen Korrekt einstellt. Zusätzlich soll es eine Oberfläche geben um sich Applikationen dazu zu buchen.\n\nHier wird erstmal nur ein Konzept vorgestellt um auch Personen zu finden die hier mitarbeiten möchten.\n",
  "logo": null,
  "persons": [
    {
      "guid": "d4cfa9aa-1d5c-5994-a311-42abed295cc9",
      "name": "w1ntermute",
      "public_name": "w1ntermute",
      "avatar": null,
      "biography": "Ich bin aktiv im CCCHH und habe Workshops für Aktivists gemacht für sichere Handys und IT-Geräte.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_d4cfa9aa-1d5c-5994-a311-42abed295cc9"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/infrastruktur-fur-aktivistis",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3-call-for-punk/talk/ZER37T/",
  "feedback_url": "https://cfp.cccv.de/39c3-call-for-punk/talk/ZER37T/feedback/",
  "do_not_record": true
}