{
  "guid": "2b5a6a8e-327e-594d-8f92-b91201d18a02",
  "code": "ZG8SZ9",
  "id": 2403,
  "date": "2025-12-29T17:15:00+01:00",
  "start": "17:15",
  "duration": "01:00",
  "room": "One",
  "slug": "39c3-schlechte-karten-it-sicherheit-im-jahr-null-der-epa-fur-alle",
  "title": "Schlechte Karten - IT-Sicherheit im Jahr null der ePA für alle",
  "subtitle": null,
  "language": "de",
  "track": "Security",
  "type": "Talk",
  "abstract": "Seit Mitte 2025 steht die elektronische Patientenakte für alle zur Verfügung – nach ein paar kleineren oder größeren Sicherheitsproblemen im Vorfeld, sei es vor einem Jahr auf dem 38C3 oder Ende April zum deutschlandweiten Start. \r\nZeit ein Fazit zu ziehen: Ist die ePA jetzt sicher? Wurden nachhaltige Veränderungen durchgeführt, die zu mehr Sicherheit führen? Kann der Umgang mit der IT-Sicherheit «eines der größten IT-Projekte der Bundesrepublik» für zukünftige Digitalprojekte hilfreich sein?\r\n\r\nZeit, mit etwas Abstand auf das zu blicken, was war, was ist und was sich abzeichnet nicht nur bei der ePA, sondern auch beim Umgang mit IT-Sicherheit bei ähnlichen Vorhaben in Deutschland. Eine umfassende Analyse der Historie und der Ursachen einer der weitreichendsten Fehlentwicklungen im Bereich der IT-Sicherheit der letzten Jahre, die sich in weit mehr zeigt, als nur in schlechter Prüfung der Anwesenheit von Gesundheitskarten im Gesundheitswesen.",
  "description": "Zum letzten Chaos Communication Congress konnten Martin Tschirsich und Bianca Kastl eine Ansammlung größerer und kleiner Sicherheitsprobleme in der elektronischen Patientenakte für alle aufzuzeigen – sei es in der Ausgabe von Identifikationsmitteln, in Systemen in der Telematikinfrastruktur oder in angebundenen Systemen. All diese Probleme kumulierten in einem veränderten und reduzierten Rollout der ePA für alle in den Modellregionen Anfang 2025, bei dem bereits erste Maßnahmen zur Schadensminimierung unternommen wurden. \nEnde April 2025 wurde die ePA für alle dann auch wirklich für alle deutschlandweit bereitgestellt – allerdings traten am gleichen Tag die scheinbar sicher gelösten Sicherheitslücken im Zugangsmanagement wieder zu Tage und wurden alsbald wieder nur provisorisch abgedichtet.\n\nDieser Talk will etwas zurückblicken auf die Geschichte und die Ursachen dieser Sicherheitsprobleme der ePA für alle. Als «eines der größten IT-Projekte der Bundesrepublik» steht die ePA sinnbildlich für den digitalpolitischen Umgang mit Sicherheitsversprechen und interessensgetriebenen Anforderungen über die Köpfe von Patient*innen oder Bürger*innen hinweg.\n\nDabei geht es nicht nur um technische Probleme und deren Behebungsversuche, sondern auch um die strukturellen Ursachen, die große digitale Vorhaben immer wieder in manchen Bereichen scheitern lassen. Diese tiefergehende Betrachtung kann uns dabei helfen, die Ursachen für schlechte IT-Sicherheit auch bei zukünftigen digitalpolitischen Vorhaben in Deutschland besser zu verstehen. Nicht für die ePA für alle und Anwendungen im Bereich der Telematikinfrastruktur, sondern auch weit darüber hinaus.\n\nTiefergehende Analyse und Nachwirkungen zu 38C3 „Konnte bisher noch nie gehackt werden“: Die elektronische Patientenakte kommt - jetzt für alle!\n",
  "logo": null,
  "persons": [
    {
      "guid": "d3f41abc-c067-5eac-a53c-208e01740a00",
      "name": "Bianca Kastl",
      "public_name": "Bianca Kastl",
      "avatar": "https://cfp.cccv.de/media/avatars/MHLNJ7_njA787L.jpg",
      "biography": "Bianca Kastl, Entwicklerin und digitale Erklärbärin, beschäftigt sich längerem beruflich und zivilgesellschaftlich mit digitalen Infrastrukturen und ihren Technikfolgen im Bereich öffentlicher Verwaltung und Gesundheitswesen. Nach diversen Erfahrungen mit digitalen Pandemieanwendungen ist ihr aktueller Fokus die Beschäftigung mit großen Digitalisierungsvorhaben im Kontext der öffentlichen Verwaltung wie dem Onlinezugangsgesetz, Registermodernisierung, Digitale Identitäten sowie dem digitalen Gesundheitswesen wie der elektronischen Patientenakte – besonders intensiv im letzten Jahr – dem europäischen Gesundheitsdatenraum und dem Gesundheitsdatennutzungsgesetz.\n\nSie ist Vorsitzende des Innovationsverbunds Öffentliche Gesundheit (InÖG) und setzt sich dort für bessere Digitalisierung von Verwaltung und Gesundheitswesen ein.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_d3f41abc-c067-5eac-a53c-208e01740a00"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/schlechte-karten-it-sicherheit-im-jahr-null-der-epa-fur-alle",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/ZG8SZ9/"
}