{
  "guid": "2dc5fbcf-c327-4df4-95ab-7f9e18f42155",
  "code": null,
  "id": 253274,
  "date": "2025-12-27T18:00:00+01:00",
  "start": "18:00",
  "duration": "02:00",
  "room": "Food Hacking Base",
  "slug": "39c3-cider-flows-fhb",
  "title": "Cider Flows @ FHB",
  "subtitle": null,
  "language": "en",
  "track": null,
  "type": "other",
  "abstract": "This is a cider tasting presented by František Apfelbeck who is experienced brewer and cider maker, kvasir. We will go through variety of cider styles, please do your booking so there are spots on this session. Entrance is donation at your will no one turned away for lack of funds.\r\nhttps://dud-poll.inf.tu-dresden.de/cf1_39c3/m",
  "description": "[To secure spot on this guided tasting workshop, session I. please sign in here.](https://dud-poll.inf.tu-dresden.de/cf1_39c3/)\n\n[To secure spot on this guided tasting workshop, session II. please sign in here.](https://dud-poll.inf.tu-dresden.de/cf2_39c3/)\n\n[[Image:Cider_selection_and_snacks_faa2017.jpg|thumb|Cider tasting at [https://voidwarranties.be/ Voidwarranties], Antwerpen 2017, the cider selection got much better since then]]\n[[Image:Algoldor workshop 27122019.jpg|thumb|Cider workshop at 36c3]]\n[[Image:Specific_density_ld032020.jpeg|thumb|Measuring specific density of cider]]\n[[Image:Pressage_nettoyage_faa102019.jpg|thumb|Cleaning of apples before pressing]]\n[[Image:Apple_crasher_hereford_cider_museum_faa_1600_082018.jpg|thumb|Old apple crasher, [http://www.cidermuseum.co.uk/ Cider Museum Hereford] ]] \n[[Image:800px-Moi nuren 1600 faa05122019.jpg|thumb|Pressing apples with a friend]]\n[[File:Cider_apples_distance_ferme_du_vastel_faa112016.jpg|thumb|Cider apples, [http://www.lafermeduvastel.net/ Ferme du Vastel] ]]\n[[Image:Pressage_pressoir_mout_faa102019.jpg|thumb|Pressing the moût]]\n\nThis event is dedicated to cider, cidre, sidra or how ever you would like to call beverage prepared by fermentation of apple juice. This event is run by František [[User:Algoldor|Algoldor]] Apfelbeck and is one of the activities of the [https://cidreriejara.com/wiki/Main_Page Cidrerie Jara/Kvasírna Jara] project which is a commercial one.\n\n'''Aims&Selection'''\nThe aim of this event is to educate people about cider in a nice and socially friendly environment. It is guided tasting with short foreword and then after opening first bottle just continuing with other ones when talking on the subject of cider and it's making. We provide a high quality selection of ciders focusing on \"typical\" products, plus we add some really special samples depending what we have available. At the core of the tasting are French ciders, especially from Normandie region and partly Bretagne. From the geographical point of view we generally have at least one sample from North of Spain, Andalusia or Basque. There is cider from England, because of strong connections to Czech Republic we try to have there one from there and generally we include at least one [https://en.wikipedia.org/wiki/Apfelwein German Apfelweine], the rest depends what interesting samples we get. From the point of view of style of production we are selecting mostly the more \"complex\" \"natural ciders\" made from cider apples, if possible without any additives, unfiltered and secondary fermented in the bottle (prise de mousse naturelle). That would be the highest end. It is however hard to make whole tasting in quality like this so we also get small scale bio/organic production. These are good quality ciders which may be for example filtered, some enzymes added, sulfur etc. We generally include one classic big scale commercial cider for comparison. To increase a bit of spectrum of what can be done we like to have some flavoured ciders, like raspberry cider, honey cider etc. We do like to include one or two [https://fr.wikipedia.org/wiki/Poir%C3%A9 poirés (perry)] into the selection. It happens quite often that it is the first poiré which people had in their life and if you are not in the region or you don't have next to you really good alcohol shop it is really hard to get a high quality one. To finish the tasting we have at least one or two cider related products like pommeau, calvados or vinegar.\n\n'''Style'''\nThis tasting workshop is based on \"donation at your will no one turned away for lack of funds\" creed. However please keep in mind that samples and ingredients for this event will be around 150-200 eu and ending up in a decent plus would help covering costs related to my, [[User:Algoldor|Algoldor]], presence at this event. This is a guided tasting. During the presentation we talk about the cider in general as mentioned above. At the beginning of the tasting it is explained how to taste and evaluate the product properly. We talk about the proper shape of glasses, temperature of serving, preparing the pallet and so on. We discuss also the colour, difference of astringency, bitterness and acidity, levels of sparkliness and more. Concerning the products we start with the extra-bruts and we go in the direction of increasing sweetness towards bruts, demi-secs and douce. We try to make a list of ciders which we taste at the event with the contact details so you can get them if you like. At the end of the event we offer [https://cidreriejara.com/wiki/Main_Page Cidrerie Jara's ciders] and other products for sale for suggested donation in a legal manner so you can get a receipt, the taxes are paid. However we are trying to avoid \"commercialization\" of the CCC events, so it is rather about getting a bottle or two and buying more later on through delivery, inviting us to do cider tasting at your place or getting stock of bottles stocked for your local hackerspace. Part of the funds which we got from this event goes to fhb and the larger part to [[User:Algoldor|Algoldor]] covering costs for participation and also using it for fermentation projects and day to day life expenses.\n\n\n'''Most Frequent Candidates'''\nHere you can find some basic tips for nice ciders which I either liked or are introduced at the tastings. Not all of them are always \"on\" but several of them are core members. It changes of course with time to reflect the seasonality and the specificity of the product.\n\n'''List of Ciders'''\n{| class=\"wikitable sortable\"\n! Cidre Name\n! Producer\n! Amount\n! Country of origin\n! Person Trafficking it\n! Notes\n|-\n|Opiédumur Lemasson\n|[http://www.cidre-lemasson.fr/ Cidrerie Lemasson]\n|Le Vaucher, 50570 Cametours, Normandie, France\n|75 cl\n|[[User:Algoldor|Algoldor]]\n| Top batch of the year, 5% alc. brewer Damien Lemasson, produced at la Ferme du Vaucher, bottle fermented.                                                            |                                                                     |\n| -------------------------------------------------------------------------------------------------------------------------------------------------------------------- | ------------------------------------------------------------------- |\n| Le Grosse Brute                                                                                                                                                      |                                                                     |\n| [https://www.lafermeduvastel.net/ La Ferme du Vastel]                                                                                                                |                                                                     |\n| 6 Le Hameau Vastel, Tuerthéville-Bocage, 50630, France                                                                                                               |                                                                     |\n| 75 cl                                                                                                                                                                |                                                                     |\n| [[User:Algoldor                                                                                                                                                      | Algoldor]]                                                          |\n| Cidre which reminds by style old traditional farmer's cidre which is hard to come by these days with slide acetic volatile, 5% alc, bottle fermented millésime 2020. |                                                                     |\n| -                                                                                                                                                                    |                                                                     |\n| Cidre du Pays de Quimperle                                                                                                                                           |                                                                     |\n| [https://www.desbouteillesalamere.bzh/ Des Bouteilles à l'Àmère]                                                                                                     |                                                                     |\n| Marc Frocrain & Isabelle Richard, Vieux village du Kérou, 29 360  Clohars-Carnoët, France                                                                            |                                                                     |\n| 75 cl                                                                                                                                                                |                                                                     |\n| [[User:Algoldor                                                                                                                                                      | Algoldor]]                                                          |\n| Really nice cider from Bretagne, Finistère, small high quality production.                                                                                           |                                                                     |\n| -                                                                                                                                                                    |                                                                     |\n| Brut                                                                                                                                                                 |                                                                     |\n| [[User:Algoldor                                                                                                                                                      | Algoldor]], [https://cidreriejara.com/wiki/Main_Page Cidrerie Jara] |\n| Val de Saire, Valcanville, France                                                                                                                                    |                                                                     |\n| 75 cl                                                                                                                                                                |                                                                     |\n| [[User:Algoldor                                                                                                                                                      | Algoldor]]                                                          |\n| Brut, organic, hand picked, wild fermentation, millésime 2019, 2020 and 2022 bottle fermented.                                                                       |                                                                     |\n| -                                                                                                                                                                    |                                                                     |\n| Black Fox Cider                                                                                                                                                      |                                                                     |\n| [https://www.dunkertonscider.co.uk/ Dunkertons Organic Cider]                                                                                                        |                                                                     |\n| London Rd, Charlton Kings, Cheltenham GL52 6UT, United Kingdom                                                                                                       |                                                                     |\n| 500 ml???                                                                                                                                                            |                                                                     |\n| [[User:Algoldor                                                                                                                                                      | Algoldor]]                                                          |\n| Medium dry, sparkling, 7% alc. winner of our cidre flows at EMF2018 in UK.                                                                                           |                                                                     |\n| -                                                                                                                                                                    |                                                                     |\n| Bio sidro allo Zenzero e mela                                                                                                                                        |                                                                     |\n| [https://bauernladen.it/it Floribunda]                                                                                                                               |                                                                     |\n| Strada Principale 78, 39025 Naturno - Alto Adige, Italia                                                                                                             |                                                                     |\n| 75 cl                                                                                                                                                                |                                                                     |\n| [[User:Algoldor                                                                                                                                                      | Algoldor]]                                                          |\n| I would say brut, with very nice flavour of ginger, added honey, 6% alc. no sulphates added, bottle fermented.                                                       |                                                                     |\n| -                                                                                                                                                                    |                                                                     |\n| Poiré Domfront                                                                                                                                                       |                                                                     |\n| [http://pacory.eu/ Pacory, Ferme des Grimaux]                                                                                                                        |                                                                     |\n| Les Grimaux, 61350 Mantilly, Basse Normandie, France                                                                                                                 |                                                                     |\n| 75 cl                                                                                                                                                                |                                                                     |\n| [[User:Algoldor                                                                                                                                                      | Algoldor]]                                                          |\n| Fourth generation of cider and poiré makers, Domfront regional poiré (one of my favourits). 4% alc, bottle fermented.                                                |                                                                     |\n| -                                                                                                                                                                    |                                                                     |\n| Cidronoix                                                                                                                                                            |                                                                     |\n| [https://www.calyce-cider.com/produit/sydra-maison-rouge/ Maison Rouge]                                                                                              |                                                                     |\n| Mathias Faurie, Molières, Périgord, France                                                                                                                           |                                                                     |\n| 75 cl                                                                                                                                                                |                                                                     |\n| [[User:Algoldor                                                                                                                                                      | Algoldor]]                                                          |\n| Interesting cider from South of France with marination of walnuts.                                                                                                   |                                                                     |\n| -                                                                                                                                                                    |                                                                     |\n| Guillevic                                                                                                                                                            |                                                                     |\n| [https://www.maisoncidricoledebretagne.bzh/earl-du-ienen/ Cidrerie du Pays d'Auray]                                                                                  |                                                                     |\n| Yves Maho, Lieu dit Kervihern, 56550 Locoal Mendon, France                                                                                                           |                                                                     |\n| 75 cl                                                                                                                                                                |                                                                     |\n| [[User:Algoldor                                                                                                                                                      | Algoldor]]                                                          |\n| Nice, sweeter style of guillevic, prise de mousse naturelle.                                                                                                         |                                                                     |\n| -                                                                                                                                                                    |                                                                     |\n| Cidre mielé                                                                                                                                                          |                                                                     |\n| [[User:Algoldor                                                                                                                                                      | Algoldor]], [https://cidreriejara.com/wiki/Main_Page Cidrerie Jara] |\n| Val de Saire, Valcanville, France                                                                                                                                    |                                                                     |\n| 75 cl                                                                                                                                                                |                                                                     |\n| [[User:Algoldor                                                                                                                                                      | Algoldor]]                                                          |\n| Brut with addition of 5% honey, organic, hand picked, wild fermentation, millésime 2019, boottle fermented.                                                          |                                                                     |\n| -                                                                                                                                                                    |                                                                     |\n| Kliment Cidre Brut 2019                                                                                                                                              |                                                                     |\n| [http://cidrerie.cz/ Cidrerie Kliment]                                                                                                                               |                                                                     |\n| Cidrerie Kliment Všenory, Na Návsi 37, 252 31, Praha-západ, Czech Republic                                                                                           |                                                                     |\n| 75 cl                                                                                                                                                                |                                                                     |\n| [[User:Algoldor                                                                                                                                                      | Algoldor]]                                                          |\n| French style of cidre  made from Czech aples, +-5.5% alc, bottle fermented.                                                                                          |                                                                     |\n| -                                                                                                                                                                    |                                                                     |\n| Euskal Sagardoa                                                                                                                                                      |                                                                     |\n| [http://www.bereziartuasagardoa.com/en/ Bereziartuasagardoa]                                                                                                         |                                                                     |\n| Bere-Aran Extea - Ipparalde Bidea 16, 20115 - Astigarraga (Gipuzkoa), Spain                                                                                          |                                                                     |\n| 75 cl                                                                                                                                                                |                                                                     |\n| [[User:Algoldor                                                                                                                                                      | Algoldor]]                                                          |\n| Sidra natural, made 100% from apples from Basque County, volatile acidity: 1.5-2, 6% alc.                                                                            |                                                                     |\n| -                                                                                                                                                                    |                                                                     |\n| Stassen Cider                                                                                                                                                        |                                                                     |\n| [http://www.stassen.be/site/index.php Stassen]                                                                                                                       |                                                                     |\n| Stassen SA, Rue de Kan 7, 4880 Aubel, Belgium                                                                                                                        |                                                                     |\n| 75 cl                                                                                                                                                                |                                                                     |\n| [[User:Algoldor                                                                                                                                                      | Algoldor]]                                                          |\n| Big producer in Belgium, 5% alc.                                                                                                                                     |                                                                     |\n| -                                                                                                                                                                    |                                                                     |\n| Odnasilder Rosé 2017                                                                                                                                                 |                                                                     |\n| [https://siidritalu.ee/ Siidritalu]                                                                                                                                  |                                                                     |\n| Tori Siidritalu, Jõesuu, 86802 Pärnu maakond, Estonia                                                                                                                |                                                                     |\n| 75 cl                                                                                                                                                                |                                                                     |\n| [[User:Algoldor                                                                                                                                                      | Algoldor]]                                                          |\n| Cidre rosé with [https://en.wikipedia.org/wiki/Aronia Aronia], 5.8% alc.                                                                                             |                                                                     |\n| -                                                                                                                                                                    |                                                                     |\n| Suchý Cider                                                                                                                                                          |                                                                     |\n| [https://www.tatuvsad.cz/ Tátův Sad]                                                                                                                                 |                                                                     |\n| V Líšnici 17, Praha – západ, PSČ 56184 (probably), Czech Republic                                                                                                    |                                                                     |\n| 500ml                                                                                                                                                                |                                                                     |\n| [[User:Algoldor                                                                                                                                                      | Algoldor]]                                                          |\n| Polosuchý cider, 6.2% alc.                                                                                                                                           |                                                                     |\n| }                                                                                                                                                                    |                                                                     |\n\n'''Interesting Cidre Related Pages'''\n\nhttp://www.cider.org.uk/ pages of specialist Andrew Lea\n\nhttp://www.ciderroute.co.uk/cider-producers/  places to visit around Hereford.\n\nhttps://herefordcamra.org.uk/cider.htm#list  list of ciders in Hereford region.\n\nhttps://www.cambridgebeerfestival.com/products/cbf44-cider/  famous UK beer festival which also offers some ciders.\n\nhttp://cfppa.le-robillard.fr/  french research and educational cidre institute le Robillard\n",
  "logo": null,
  "persons": [
    {
      "guid": "50bb350a-b277-436d-aa51-1fb6d4ea611e",
      "name": "algoldor",
      "public_name": "algoldor",
      "avatar": null,
      "biography": null,
      "url": "https://events.ccc.de/congress/2025/hub/user/algoldor"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/cider-flows-fhb",
  "links": []
}