{
  "guid": "304dd87b-7de5-557c-9951-1add24396a0b",
  "code": "TWEDR3",
  "id": 2026,
  "date": "2025-12-27T11:00:00+01:00",
  "start": "11:00",
  "duration": "00:40",
  "room": "One",
  "slug": "39c3-all-sorted-by-machines-of-loving-grace-ai-cybernetics-and-fascism-and-how-to-intervene",
  "title": "All Sorted by Machines of Loving Grace? \"AI\", Cybernetics, and Fascism and how to Intervene",
  "subtitle": null,
  "language": "en",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "abstract": "While the extreme right is on the rise in many countries and climate change is unrolling, a promising future seems to be written: According to Elon Musk, Sam Altman, and some other “tech bros” it is to leave the dying planet to go to space. With the help of something called “A(G)I”.\r\nBut what kind of future is the one that is promised? And what is the connection between power cycles of tech company owners and people who's believes can be called fascist? As we moved power through data in the hands of very view, it is important to examine what ideas these view have in their heads.\r\nThis talk will explore the roots of today's tech fascism and its love for tech. From the early thoughts and movements in the US and Europe to Futurism and the Holocaust, organised with Hollerith punching cards. It will dive into the its blooming relationship with cybernetics, and take a look in the future the “tech bros” want to lure us in.\r\nThis talk will address the often overlooked topic of how and when people get comfy with diving into movements of hate and how to stop a white supremacy future where we will be sorted by machines.\r\nAnd, in taking a look on past movements opposing authoritarianism and will examine mindsets and possibilities of resistance as well as the possibility of restarting everything. Because we have a planet and loved ones to lose.\r\nWear your safety cat-ears, buckle up, it will be a wild, but entertaining ride.",
  "description": "The idea of the Super-Human is not a new one, neither is the idea of charismatic „good“ leader nor to sort humans into classes, races, abilities. The idea of a view controlling many by force and ideas that justify their rulership and cruelties is an old one, as is the opposing idea of a free society and humans as equals.\nA central aspect is how people involved see the human nature and according to that what society they want to build. And what role is intended for technology.\nIn the 19th century the beliefs of both the opposing sides dripped into science, as well as individual’s heads, and social movements around the world. While some wanted to form a wold society of equals others wanted to breed a master race that to control everything.\n\nThe love of industrial leaders for authoritarianism has played an important role since the beginning in funding and providing access to powerful networks. Industrialists like Henry Ford loved and promoted ideas at least close to fascism. German, Italian, and Austrian counterparts funded Hitler and Mussolini. And it is not that they did it because they did not understand the fascist leader’s yearning – it was because they shared and loved their aims and violence.\n\nIn Futurism, one of the often overlooked roots of fascism, and its Manifesto the enemies and societal goals are proclaimed crystal clear: “We will glorify war — the only true hygiene of the world — militarism, patriotism, the destructive gesture of anarchist, the beautiful Ideas which kill, and the scorn of woman.“\n\nAfter WWII most of the people believing in dominating others by force and eugenics lived on, they and their cronies had slaughtered millions and destroyed whole social movements were opposing them. These people warning us about authoritarian prophets of doom and concentration camps are still missing.\n\nIn the post-war time ideas of authoritarianism met a new player: Cybernetics, the believe in a future, where all problems will be solved through technology and we are “All Watched Over by Machines of Loving Grace” (Richard Brautigam, 1967). The ideas split, merged, and melted into new beliefs and quasi-religions. Into something that is called “Cyber-Libertarianism” by David Golumbia or “TESCREAL” by Émile P. Torres and Timnit Gebru.\n\nThis talk will address an aspect that is often missing in analyses: What kind of breeding ground is it where ideas of fascism hatches best? And how can we stop iFascism instead of participating in it?\n\nFurthermore, as being sorted by machines is not everyone's secret dream, ways to stop iFascism will be provided.\n\nBecause we are more, we care for people in need – and we are the chaos!\n",
  "logo": null,
  "persons": [
    {
      "guid": "fef3cd0a-a955-5aeb-b604-ed774edc70c9",
      "name": "Katika Kühnreich",
      "public_name": "Katika Kühnreich",
      "avatar": "https://cfp.cccv.de/media/avatars/V7FXYT_jdOaj1a.JPG",
      "biography": "Katika Kühnreich is a political scientist and sinologist with a focus on philosophy. She gained international reputation through a lecture at the Chaos Communication Congress 2017. Her work foci are on the social impact of digitalization, the associated working conditions, and resource consumption. She also conducts research on social changes by \"AI\", social media, and gamification, as well as surveillance and the handling of dissent. She gives lectures and offers workshops on these and other topics, and works as a publicist and lecturer. She blogs at www.katika-kuehnreich.com and https://chaos.social/@katika.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_fef3cd0a-a955-5aeb-b604-ed774edc70c9"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/all-sorted-by-machines-of-loving-grace-ai-cybernetics-and-fascism-and-how-to-intervene",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/TWEDR3/"
}