{
  "guid": "321fe11d-960e-5f10-b364-2d758de8acfa",
  "code": "9QTF7D",
  "id": 1658,
  "date": "2025-12-27T21:00:00+01:00",
  "start": "21:00",
  "duration": "02:00",
  "room": "Chaos Computer Music Club",
  "slug": "39c3-analog-to-algorithm-rss-discos-underground-journey",
  "title": "Analog to Algorithm: RSS Disco’s Underground Journey",
  "subtitle": null,
  "language": "en",
  "track": "DJ-Set",
  "type": "DJ Set",
  "abstract": "From crackling Kraut and Disco records to hyper produced Techno tracks - dance music has come a long way in the last six decades, and was always strongly influenced by evolving technology.\r\n\r\nDance music’s history is a feedback system between culture and circuitry. Each new invention—from the disco subwoofer to today’s neural-driven mastering tools—reshapes sound itself. RSS Disco’s timeline approach celebrates this continuum: a story of machines learning to groove, and humans learning to listen differently through them.",
  "description": "From crackling Kraut and Disco records to hyper produced Techno tracks - dance music has come a long way in the last six decades, and was always strongly influenced by evolving technology.\n\nDance music’s history is a feedback system between culture and circuitry. Each new invention—from the disco subwoofer to today’s neural-driven mastering tools—reshapes sound itself. RSS Disco’s timeline approach celebrates this continuum: a story of machines learning to groove, and humans learning to listen differently through them.\n\nWe take you on a trip through music history in a two hour DJ-set. Starting with music from the early 1970s and closing with tracks produced in 2025. Have a dance with us and get a feeling for the changing sound aesthetics, style and fashion the over the decades.\nNot a lot of time to cover the sheer endless amount of music and information, you say? You are right! This can only be a tiny extract, filtered through our perspective and taste.\nWe’ll focus on a selection that feels representative for its time - exciting, beautiful, obscure or interesting. And of course some dirty bangers. \nTo make the set not only danceable but also offer hungry brains visual context, we provide a live timeline with info about the decade's musical developments, technical breakthroughs/curiosities and fun facts.\n",
  "logo": "https://cfp.cccv.de/media/39c3-chaos-computer-music-club/submissions/9QTF7D/RSS_Disco_2022_tQJQJOe.jpg",
  "persons": [
    {
      "guid": "213a98e7-e01e-53ad-bc6e-c159b947fef6",
      "name": "RSS Disco",
      "public_name": "RSS Disco",
      "avatar": "https://cfp.cccv.de/media/avatars/EFNTPH_rQEPJp5.png",
      "biography": "One’s company, two’s a crowd, and three’s a party!\n\nWhy are there three people dancing in the DJ booth, you may have asked yourself. But anyone who has experienced RSS Disco live will hear and see: every hand has a task in threading the seams of their genre-spanning sets.\n\nRSS Disco have become synonymous with euphoric experiences for festival & club audiences all over Europe. Coming from a background of house and techno they use their straws to slurp across (and to the very bottom of) the cosmic melange that is music.\n\nThey play big indie festivals as well as Ibiza, dark clubs as well as small dusty dancefloors by lakes. They release mixes for Dublab Radio in Los Angeles, ARTE Concert, or The Lot Radio from New York. Their live recordings or remixes for Tomemitsu, Keshavara, Rupa or Fotos have hundreds of thousands of clicks. And their version of \"Les Taxis Pour Les Galaxies / Le Vent Nous Portera\" is already a classic and will never stop generating goosebumps on dance floors all over the world.\n\nOff the dance floor they also keep busy, running their Label Mireia Records with releases by artists like Johannes Klingebiel, Tomemitsu, Das Komplex, Johannes Klingebiel, Jacques Bon, Zombies in Miami, Casino Times or Lauer and Erobique. The label’s aesthetic is grounded in DIY design principles: vinyl records are mostly screen printed, stamped and often become sought after limited editions.\n\nlisten: https://soundcloud.com/rss\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_213a98e7-e01e-53ad-bc6e-c159b947fef6"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/analog-to-algorithm-rss-discos-underground-journey",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3-chaos-computer-music-club/talk/9QTF7D/",
  "feedback_url": "https://cfp.cccv.de/39c3-chaos-computer-music-club/talk/9QTF7D/feedback/"
}