{
  "guid": "341961a3-599d-52b9-8262-34c1757c9698",
  "code": "PSG7QA",
  "id": 1431,
  "logo": "https://cfp.cccv.de/media/39c3/submissions/PSG7QA/14875859_1132872053446506_383638730_o-Be_dsBVW0p.jpg",
  "date": "2025-12-28T00:20:00+01:00",
  "start": "00:20",
  "duration": "01:00",
  "room": "One",
  "slug": "39c3-1431-unnecessarily-complicated-kitchen-die-wissenschaft-des-guten-geschmacks",
  "url": "https://cfp.cccv.de/39c3/talk/PSG7QA/",
  "title": "Unnecessarily Complicated Kitchen – Die Wissenschaft des guten Geschmacks",
  "subtitle": "",
  "track": "Entertainment",
  "type": "Talk",
  "language": "de",
  "abstract": "In unserer „Unnecessarily Complicated Kitchen“ hacken wir die Gesetze der Kulinarik. Ich zeige live, wie Hitze, Chemie und Chaos zusammenwirken, wenn Moleküle tanzen, Emulsionen kollabieren und Geschmack zu Wissenschaft wird. Zwischen Pfanne und Physik entdecken wir, warum Kochen im Grunde angewandtes Debugging ist – und wie man Naturgesetze so würzt, dass sie schmecken.",
  "description": "Willkommen in der „Unnecessarily Complicated Kitchen“ – einer Küche, in der Naturwissenschaft, Technik und kulinarisches Chaos aufeinandertreffen.\r\nWir sezieren das Kochen aus der Perspektive von Hacker*innen: Warum Hitzeübertragung ein thermodynamisches Protokoll ist, warum Emulsionen wie Netzwerke zusammenbrechen und wie sich die Kunst des Abschmeckens in Datenpunkten erklären lässt.\r\n\r\nIn diesem Talk verbinden wir naturwissenschaftliche Experimente mit kulinarischer Praxis. Wir erhitzen, rühren, messen und analysieren – live auf der Bühne. Dabei übersetzen wir Physik und Chemie in Geschmack, Textur und Aha-Momente.\r\nKochen wird so zum Laborversuch, zum Hack, zum Reverse Engineering des guten Geschmacks.\r\n\r\nIch zeige, dass hinter jeder gelungenen Sauce ein Protokoll steckt, hinter jedem Soufflé ein Algorithmus – und dass man auch in der Küche mit Trial & Error, Open Source und einer Prise Chaos zu erstaunlichen Ergebnissen kommt.\r\n\r\nAm Ende steht nicht nur Erkenntnis, sondern auch Genuss: Denn wer versteht, warum etwas schmeckt, kann die Regeln brechen – und sie dabei besser würzen.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "EBRMGZ",
      "name": "LukasQ",
      "avatar": "https://cfp.cccv.de/media/avatars/EBRMGZ_yqntgHZ.jpg",
      "biography": "Ich bin Lukas, Berater, Infrastruktur-Stratege und leidenschaftlicher Bastler – im Rechenzentrum wie am Herd. Beruflich bewege ich mich zwischen Automatisierung, Architektur und strategischer IT, privat zwischen Sous-vide-Bad, Espressomühle und Edelstahlpfanne.\r\nAufgewachsen in einer Gastro-Technik-Familie habe ich früh gelernt, dass gutes Kochen und gute Technik denselben Prinzipien folgen: Präzision, Verständnis und Neugier. Kochen ist für mich angewandte Wissenschaft – ein Spiel mit Temperatur, Zeit und Chemie, bei dem man durch Experimentieren lernt, Systeme zu verstehen.\r\nWenn ich nicht gerade Cloud-Strategien entwerfe oder neue Pair-Programming-Kulturen etabliere, verbringe ich meine Zeit damit, Rezepte zu debuggen, Geschmack zu analysieren und über die physikalische Eleganz eines perfekt gebratenen Steaks zu philosophieren.\r\nIch koche (semi-)professionell, gerne für Freundinnen, Familie und Kolleginnen – und genieße dabei mindestens so sehr das Experiment wie das Ergebnis. Für mich ist Kochen die schönste Form des Hackens: unmittelbar, multisensorisch und immer ein bisschen chaotisch.",
      "public_name": "LukasQ",
      "guid": "729a86f4-8e9e-5569-bf42-507fd2149072",
      "url": "https://cfp.cccv.de/39c3/speaker/EBRMGZ/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/PSG7QA/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/PSG7QA/",
  "attachments": []
}