{
  "guid": "34c3a81d-61fd-4cf5-b16b-519a1f5e0315",
  "code": null,
  "id": 343816,
  "date": "2025-12-28T13:00:00+01:00",
  "start": "13:00",
  "duration": "00:40",
  "room": "c4E-Roundtable",
  "slug": "39c3-naturlich-bin-ich-18-wo-stehen-wir-beim-thema-alte",
  "title": "Natürlich bin ich 18! - Wo stehen wir beim Thema Altersprüfungen im Netz?",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "other",
  "abstract": "Does the Internet need to be age aware? \r\nEin kurzes Update darüber, was im letzten Jahr auf der politischen Bühne passiert ist und eine anschließende offene Diskussion darüber, wie es weitergehen kann.",
  "description": "We usually encounter age verification checks online on pornography sites, gambling sites, or when we buy tobacco or alcohol online. There is much debate about whether this tool should also be used on other platforms. We usually encounter age verification checks online on pornography sites, gambling sites, or when we buy tobacco or alcohol online. There is much debate about whether this tool should also be used on other platforms. Following the social media ban in Australia and the Online Safety Act in the UK, the EU is also discussing a social media ban. I will give a short introduction to the political developments of the last year and then look forward to an open discussion. \nWhat does the expansion of age verification on the internet mean for you? \nIn which Areas can age verification make sense? Or can it? \nHow can age verification be designed technically? What are the pros and cons?\nWhat risks and opportunities are not discussed enough in current debate?\n\n(This discussion is a loose follow-up to the 38C3 Talk \"Natürlich bin ich 18! Altersprüfungen im Netz\" - You don't need to have seen the talk to participate here!)\n",
  "logo": null,
  "persons": [
    {
      "guid": "0934e483-7c74-4086-ba9e-c69ff936a90a",
      "name": "asypsilon (sie/ihr)",
      "public_name": "asypsilon (sie/ihr)",
      "avatar": null,
      "biography": null,
      "url": "https://events.ccc.de/congress/2025/hub/user/asypsilon"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/naturlich-bin-ich-18-wo-stehen-wir-beim-thema-alte",
  "links": []
}