{
  "guid": "34f3d9a6-9164-58df-81e6-51c112362a89",
  "code": "QWFPYT",
  "id": 1944,
  "date": "2025-12-28T22:05:00+01:00",
  "start": "22:05",
  "duration": "00:40",
  "room": "Fuse",
  "slug": "39c3-machine-vision-vom-algorithmus-zum-baumpilz-im-digitalen-metabolismus",
  "title": "Machine Vision – Vom Algorithmus zum Baumpilz im digitalen Metabolismus",
  "subtitle": null,
  "language": "de",
  "track": "Art & Beauty",
  "type": "Talk",
  "abstract": "Milliarden von Kameras produzieren täglich Bilder, die zunehmend von Maschinen analysiert werden. In dieser Lecture Performance beleuchten wir die Entwicklung des maschinellen Sehens – von den frühen algorithmischen Ansätzen bis zu den heutigen Anwendungen – und schauen, wie verschiedene Künstler:innen diese Technologien nutzen und reflektieren. Anhand der beiden Arbeiten „Throwback Environment” und „Fomes Fomentarius Digitalis” betrachten wir die Nutzung des maschinellen Sehens in einem künstlerischen Feedback-Loop. Die Arbeiten machen sichtbar, was die eingesetzten Algorithmen sehen und in welchen Mustern sie operieren.",
  "description": "Unmengen an Bilder werden Täglich in die Netzwerke hochgeladen. Doch nicht nur Menschen betrachten diese Bilder, auch Maschinen analysieren und „betrachten\" sie. Wie funktioniert dieses maschinelle „Sehen\" und wie wurde dieses den Computern beigebracht?\nDiese Lecture Performance gibt einen Überblick über die Entwicklung des maschinellen Sehens. Nach einem kurzen Einblick in die geschichtliche Entwicklung – von den ersten Ansätzen bis zu heutigen Anwendungen – betrachten wir, wie diese Technologien in unterschiedlichsten künstlerischen Arbeiten eingesetzt werden. Was reflektieren diese Arbeiten jenseits der reinen Anwendung von Machine Vision Algorithmen?\nAnhand der beiden Arbeiten \"Throwback Environment\" und \"Fomes Fomentarius Digitalis\" betrachten wir, wie Machine Vision in einem künstlerischen Feedbackloop genutzt worden ist und wie uns dies Perspektiven auf die Funktionsweise dieser Algorithmen eröffnet. Die Arbeiten machen sichtbar, was die Eingesetzten Alghorithmen sehen, in welchen Mustern sie operieren. Sie zeigen auch, wo ihre Grenzen liegen und was das ganze mit Baumpilzen zu tun hat.\n",
  "logo": "https://cfp.cccv.de/media/39c3/submissions/QWFPYT/Fomes_Fomentarius_Digitalis_Thomas_Knus_OQOGL1r.webp",
  "persons": [
    {
      "guid": "0fc7e04d-4473-5d6b-9af5-2ae1fde21243",
      "name": "Thomas Knüsel",
      "public_name": "Thomas Knüsel",
      "avatar": "https://cfp.cccv.de/media/avatars/EAXJGR_yJFcjvW.png",
      "biography": "Thomas Knüsel (*1984) ist Medienkünstler und Creative Technologist mit einem Bachelor of Arts der HSLU DFK und einem Master of Fine Arts der ZHdK. Seine künstlerische Praxis erforscht die Überschneidungen von Technologie, Materialität, Wahrnehmung, Wissenschaft und Kunst und nutzt verschiedene Medien, um Werke zu schaffen, die zwischen Kunst und Technologie oszillieren.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_0fc7e04d-4473-5d6b-9af5-2ae1fde21243"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/machine-vision-vom-algorithmus-zum-baumpilz-im-digitalen-metabolismus",
  "links": [
    {
      "url": "https://www.tknusel.ch/FomesFomentariusDigitalis.html",
      "type": "related",
      "title": "Fomes Fomentarius Digitalis"
    },
    {
      "url": "https://www.tknusel.ch/ThrowbackEnvironment.html",
      "type": "related",
      "title": "Throwback Environment"
    }
  ],
  "origin_url": "https://cfp.cccv.de/39c3/talk/QWFPYT/"
}