{
  "guid": "35e68e53-852a-56a2-8b3c-1bc27ce7fbb0",
  "code": "FZDXVY",
  "id": 2427,
  "date": "2025-12-30T00:15:00+01:00",
  "start": "00:15",
  "duration": "00:40",
  "room": "One",
  "slug": "39c3-pruf",
  "title": "PRÜF",
  "subtitle": null,
  "language": "de",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "abstract": "PRÜF! Prüfung Rettet übrigens Freiheit!\r\nAlles wird in Deutschland geprüft. Warum nicht auch mutmaßlich verfassungswidrige Parteien? Hier stelle ich vor, was PRÜF! anders machen will als bisherige Kampagnen.",
  "description": "Wir haben eine Forderung: „Alle Parteien, die vom Verfassungsschutz als rechtsextremer Verdachtsfall oder gesichert rechtsextrem eingestuft werden, sollen durch das Bundesverfassungsgericht überprüft werden.“ Wir demonstrieren so lange, bis der Bundesrat die Prüfung formal beantragt hat. PRÜF-Demos. Bald in allen Landeshauptstädten. Am 2. Samstag. Jeden Monat.\n\nWarum beim Schutz der Demokratie nicht mal einen Ansatz wählen, der so noch nicht probiert wurde? Nicht auf die anderen gucken, sondern auf uns? Auf das gemeinsame? Auf Spaß? Das nutzen, was wir haben und was wir können? Wir haben das Grundgesetz, dessen Stärken eingesetzt werden müssen. Wir haben uns, Millionen Menschen, die wir uns organisieren können. Wir haben Ideen, wir haben Geld, wir haben Macht, wir haben Wissen. Bisher haben wir nicht einmal ansatzweise unsere Möglichkeiten ausgeschöpft und es wäre absurd, wenn wir das nicht schaffen würden, die Freiheitliche Demokratische Grundordnung zu schützen.\n\nVortrag kann Spuren von Prüfen enthalten.\n",
  "logo": null,
  "persons": [
    {
      "guid": "a2ddd730-adc7-5f26-8827-134885dccadc",
      "name": "Nico Semsrott",
      "public_name": "Nico Semsrott",
      "avatar": null,
      "biography": null,
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_a2ddd730-adc7-5f26-8827-134885dccadc"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/pruf",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/FZDXVY/"
}