{
  "guid": "372f7089-b6ae-50ed-bc35-f60c5e9fd6e1",
  "code": "VN77T8",
  "id": 2376,
  "logo": null,
  "date": "2025-12-28T20:10:00+01:00",
  "start": "20:10",
  "duration": "00:40",
  "room": "Ground",
  "slug": "39c3-2376-recharge-your-batteries-with-us-an-empowering-journey-through-the-energy-transition",
  "url": "https://cfp.cccv.de/39c3/talk/VN77T8/",
  "title": "Recharge your batteries with us - an empowering journey through the energy transition",
  "subtitle": "",
  "track": "Science",
  "type": "Talk",
  "language": "en",
  "abstract": "Amidst gloomy headlines, extreme weather, and climate anxiety, the good stories often get lost. Yet they exist - inspiring people, clever engineering, real breakthroughs. And that's exactly what we bring you – the positive power cycles of the energy transition in action. And real energy on stage.",
  "description": "A committed energy activist and an award-winning solar cell researcher take you on a lively, motivating and sometimes funny journey:\r\n\r\n- to electricity rebels from the Black Forest,\r\n- to heat pumps that supply entire neighborhoods,\r\n- to new solar technologies,\r\n- to wind turbines with history,\r\n- and to politicians who were too pessimistic.\r\n\r\nWhat is already going really well? What can you emulate? Where is it worth getting involved?\r\nWe'll show you – in an easy-to-understand, cheerful way.\r\nTo stay motivated for an adventure as big as the energy transition, we need more than just facts and figures. We need momentum, optimism, and the human energy that keep the power cycles turning.\r\nCome by! Let’s recharge together and celebrate the successes of the energy transition.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "E3LE7M",
      "name": "Salacidre",
      "avatar": "https://cfp.cccv.de/media/avatars/E3LE7M_2RprwVs.jpg",
      "biography": "DE: Simone (Salacidre) ist Klimawissenschaftlerin und Wissenschaftskommunikatorin. Im Vorstand des Balkon.Solar e.V. setzt sie sich für die Energiewende von unten ein. Ihr Ziel: Alle Menschen beteiligen sich aktiv an der Energiewende und können dabei spüren, dass sie selbst wirksam und ein wichtiger Teil des Ganzen sind. Simone setzt sich mit dem Akkudoktor und vielen anderen dafür ein, rechtliche Hürden abzubauen. Gemeinsam gehen sie dabei unkonventionelle Wege. Politisch, technisch und gesellschaftlich.\r\n\r\nEN: Simone (Salacidre) is a climate scientist and science communicator. As a member of the board of Balkon.Solar e.V., she is committed to promoting the energy transition from the bottom up. Her goal is for everyone to actively participate in the energy transition and feel that they themselves have agency and are an important part of the whole. Simone works with Akkudoktor and many others to remove legal barriers. Together, they are taking unconventional approaches - politically, technologically, and socially",
      "public_name": "Salacidre",
      "guid": "c1c0c946-3a66-57c2-9ba9-f518e96d02c3",
      "url": "https://cfp.cccv.de/39c3/speaker/E3LE7M/"
    },
    {
      "code": "XNRNVJ",
      "name": "JulianeB",
      "avatar": "https://cfp.cccv.de/media/avatars/XNRNVJ_tyNz8FQ.webp",
      "biography": "Juliane studied physics in Berlin, Halle (Saale), and Oxford. After research positions in Cambridge and Amsterdam, she has been in Freiburg (Breisgau) since 2022. There she heads a research group that develops and investigates new materials for solar cells. Her research focuses on novel perovskite-silicon tandem solar cells.",
      "public_name": "JulianeB",
      "guid": "9e427cc5-dc91-50ca-84ec-f0a3b963fb95",
      "url": "https://cfp.cccv.de/39c3/speaker/XNRNVJ/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/VN77T8/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/VN77T8/",
  "attachments": []
}