{
  "guid": "3ad7da57-ece4-5a75-9e52-f93d7df79734",
  "code": "LWYNKY",
  "id": 1445,
  "logo": "https://cfp.cccv.de/media/39c3/submissions/LWYNKY/-24_3_24432633921_cropped_gGa5GmY.jpg",
  "date": "2025-12-28T13:30:00+01:00",
  "start": "13:30",
  "duration": "01:00",
  "room": "Ground",
  "slug": "39c3-1445-a-space-odyssey-2-how-to-study-moon-rocks-from-the-soviet-sample-return-mission-luna-24",
  "url": "https://cfp.cccv.de/39c3/talk/LWYNKY/",
  "title": "A space odyssey #2: How to study moon rocks from the Soviet sample return mission Luna 24",
  "subtitle": "",
  "track": "Science",
  "type": "Talk",
  "language": "en",
  "abstract": "It is 1976 and the USA long stopped going to the Moon when a Soviet automatic landing station called Luna 24 descends to the Lunar surface. It touches down on 3.3 Billion year old rock formations at a place no mission has ever gone before. What exactly happened remains a mystery to this day, but the space probe managed to take a 2.3 m long drill core from the Lunar regolith, packaged the sample in a genius way and launched it for its voyage to Earth. Some days later the sample entered earths atmosphere and landed in remote Siberia and ended up in our hands more than 50 Years later. We tell the story of the sample, the people that brought it to Earth and how we analyzed it with the newest methods including µm sized high intensity X-ray beams, 30kV electron beams and LN2 cooled infrared spectrometers.",
  "description": "In this talk, members of the Museum for Natural History in Berlin will present the story of a Luna 24 sample retrieved by the GDR from the USSR. The sample has been almost \"lost\" to time. When it fell into our hands, we started understanding its historical and scientific significance, produced specialized sample containers and initiated curation efforts of the sample while slowly understanding its history and geochemical composition.\r\n\r\n### Luna 24 Moon Mission\r\nWhat happened on the 18th & 19th of August 1976 on the moon? Why was this landing site chosen and how was the sample retrieved and brought back to Earth? Which way did the scientists handle these extremely precious samples? Picture: Музей Космонавтики (CC0 1.0)\r\n\r\n### Methods and Results\r\nWhich methods can be utilized to gather new information from such a sample without destroying it? Which storage and curation methods must be used to preserve its value for the scientists that come after us? How did advanced analytical methods like µCT, electron microscopes, µ X-ray fluorescence spectrometers and nitrogen-cooled infrared spectrometers contribute to our understanding of the sample?\r\n\r\nFly with us to the moon!",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "KBR8ZP",
      "name": "Paul Koetter",
      "avatar": "https://cfp.cccv.de/media/avatars/dithered-4_T4REw2M.png",
      "biography": null,
      "public_name": "Paul Koetter",
      "guid": "1fa324ca-13d0-5623-a0f1-14f9df770c33",
      "url": "https://cfp.cccv.de/39c3/speaker/KBR8ZP/"
    },
    {
      "code": "DMTMDV",
      "name": "Christopher Hamann",
      "avatar": "https://cfp.cccv.de/media/avatars/DMTMDV_ghHP0Pt.jpg",
      "biography": "Planetenwissenschaftler am Museum für Naturkunde Berlin, der das Glück hatte, seine Leidenschaft für den Weltraum, ferne Welten und extreme Bedingungen zu seinem Beruf zu machen. Wenn ich nicht im Labor außerirdische Steine untersuche fotografiere ich Menschen die mir lieb sind, koche oder höre Musik.",
      "public_name": "Christopher Hamann",
      "guid": "c7a1fbc3-c606-51c1-ad63-844516245820",
      "url": "https://cfp.cccv.de/39c3/speaker/DMTMDV/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/LWYNKY/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/LWYNKY/",
  "attachments": []
}