{
  "guid": "3b893e0c-c1a1-533b-a7e1-9ca2eb50ca27",
  "code": "CMBEQQ",
  "id": 2414,
  "date": "2025-12-28T22:00:00+01:00",
  "start": "22:00",
  "duration": "00:30",
  "room": "Am Spätverkauf",
  "slug": "39c3-antifaschistischer-akkordeon-punk-grolen-gegen-rec",
  "title": "Antifaschistischer Akkordeon-Punk - Grölen gegen Rechts",
  "subtitle": null,
  "language": "de",
  "track": "Live Performance",
  "type": "live performance",
  "abstract": "Klassiker des antifaschistischen Deutschpunk-Liedguts – von Die Ärzte über Die Toten Hosen bis WIZO und Terrorgruppe – neu interpretiert auf dem Akkordeon.\r\nLaut, links und garantiert mitgröltauglich.",
  "description": "Begleitet von harmonischen Akkordeonklängen stimmen wir gemeinsam antifaschistische Klassiker des deutschen Punks an, um sie stilgerecht zusammen zu grölen. Auf dem Programm stehen Songs von WIZO, Die Ärzte, Terrorgruppe und Die Toten Hosen. Es ist die perfekte Gelegenheit, sich im Kreise Gleichgesinnter den Frust über den Rechtsruck der Gesellschaft von der Seele zu schreien. Textsicherheit ist nicht nötig, für Spickzettel ist gesorgt.\n\nDer Akkordeonspieler Pianostein machte nicht nur durch zahlreiche Gastauftritte bei Bands wie Die Toten Hosen, Sondaschule, Dritte Wahl oder Rogers von sich reden – sondern vor allem durch seine legendären Klo-Konzerte bei deren Shows. Ganz nach dem Motto: Wo Menschen zusammenkommen und eine Haltung teilen, reicht ein Akkordeon, um alle zum Grölen zu bringen und den Moment unvergesslich zu machen.\n",
  "logo": "https://cfp.cccv.de/media/39c3-call-for-punk/submissions/CMBEQQ/8469_477643595645502_1328_VjbJkhF.webp",
  "persons": [
    {
      "guid": "8d1ac69e-640b-5098-b11a-d3f76796679b",
      "name": "Pianostein",
      "public_name": "Pianostein",
      "avatar": "https://cfp.cccv.de/media/avatars/XAWGMS_5RfpFye.jpg",
      "biography": "Nicht nur durch seine zahlreichen Gastauftritte bei Bands wie Die Toten Hosen, Sondaschule, Dritte Wahl, Rogers und vielen anderen machte der Künstler Pianostein von sich reden – sondern vor allem durch seine legendären Klo-Konzerte im Rahmen ihrer Shows.\nGanz nach dem Motto: Wo Menschen sich versammeln und eine Haltung teilen, reicht ein Akkordeon, um sie zum Grölen zu bringen und den Moment unvergesslich zu machen.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_8d1ac69e-640b-5098-b11a-d3f76796679b"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/antifaschistischer-akkordeon-punk-grolen-gegen-rec",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3-call-for-punk/talk/CMBEQQ/",
  "feedback_url": "https://cfp.cccv.de/39c3-call-for-punk/talk/CMBEQQ/feedback/",
  "do_not_record": true
}