{
  "guid": "418f57a7-435b-5835-98ad-85158338b6c4",
  "code": "S3FPQX",
  "id": 1873,
  "logo": null,
  "date": "2025-12-29T11:55:00+01:00",
  "start": "11:55",
  "duration": "00:40",
  "room": "Fuse",
  "slug": "39c3-1873-hacking-karlsruhe-10-years-later",
  "url": "https://cfp.cccv.de/39c3/talk/S3FPQX/",
  "title": "Hacking Karlsruhe - 10 years later",
  "subtitle": "",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "language": "de",
  "abstract": "\"Wir gehen nach Karlsruhe!“ – das klang vor zehn Jahren nach Aufbruch und juristischem Hack. Heute ist klar: Strategische Prozessführung ist kein Sprint, sondern ein zähes, manchmal frustrierendes Dauerprojekt.\r\n\r\nIn diesem Talk ziehen wir Bilanz: Was haben wir mit zivilgesellschaftlichen Verfassungsbeschwerden im Bereich Technologie erreicht – und wo sind wir gescheitert? Welche Fehler würden wir heute vermeiden, welche Wege waren richtig? Und was bedeutet es, wenn das höchste deutsche Gericht zunehmend weniger Lust auf digitalpolitische Grundrechtsfragen zeigt?\r\n\r\nEin realistischer Blick hinter die Kulissen strategischer Klagen – und die Frage: Wie hackt man das Rechtssystem im Jahr 2025?",
  "description": "Wenn Gesetze Grundrechte verletzen, warum nicht das Bundesverfassungsgericht hacken – mit Strategie, Teamwork und guter Begründung? Aus dieser Idee ist inzwischen ein zentrales Werkzeug zivilgesellschaftlicher Gegenmacht geworden: Strategische Prozessführung. Das Prinzip ist einfach: Gesetze nicht nur kritisieren, sondern systematisch angreifen, mit gezielten Verfassungsbeschwerden gegen Überwachung, Zensur und staatliche Eingriffe in die digitale Freiheit.\r\nSeitdem hat sich viel getan. Organisationen wie die Gesellschaft für Freiheitsrechte (GFF) haben den Weg nach Karlsruhe professionalisiert und Verfahren angestoßen, die viele aus den Nachrichten kennen:\r\ngegen die Vorratsdatenspeicherung,\r\ngegen das BND-Gesetz zur Auslandsüberwachung,\r\ngegen den Einsatz von Palantir,\r\nund gegen den Einsatz von Staatstrojanern.\r\nEinige dieser Verfahren waren erfolgreich und haben Gesetze gekippt. Andere sind krachend gescheitert – oder hängen seit Jahren in Karlsruhe fest. Dabei zeigt sich: Der Weg zum Urteil wird härter, die Erfolgsaussichten kleiner, und das Verfassungsgericht ist nicht mehr der progressive Motor, der es mal war.\r\nDieser Talk zieht eine ehrliche Bilanz: Was bringt strategische Prozessführung wirklich? Was lässt sich aus Erfolgen und Misserfolgen lernen? Welche Fälle lohnen sich – und wo wird der Rechtsweg zur Sackgasse? Und wie verschiebt sich das Ganze inzwischen auf die europäische Ebene – wo neue Schauplätze wie der Digital Services Act oder der AI Act warten?\r\nKeine juristische Vorlesung, sondern ein Erfahrungsbericht aus zehn Jahren digitaler Grundrechtsarbeit. Es geht um Taktik, Fehlentscheidungen, unerwartete Allianzen – und um die Frage, wie man auch heute noch im Rechtssystem rütteln kann, wenn die Türen in Karlsruhe enger werden.\r\nDer Vortrag wird gehalten von Simone Ruf und Jürgen Bering von der Gesellschaft für Freiheitsrechte.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "RMY3D3",
      "name": "Jürgen Bering",
      "avatar": null,
      "biography": null,
      "public_name": "Jürgen Bering",
      "guid": "c628754f-db69-5973-a535-52e518c4e542",
      "url": "https://cfp.cccv.de/39c3/speaker/RMY3D3/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/S3FPQX/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/S3FPQX/",
  "attachments": []
}