{
  "guid": "44d1ae6d-febc-5035-8379-d2030e7f59a2",
  "code": "WULKYL",
  "id": 2372,
  "date": "2025-12-27T23:00:00+01:00",
  "start": "23:00",
  "duration": "00:40",
  "room": "Zero",
  "slug": "39c3-the-eyes-of-photon-science-imaging-simulation-and-the-quest-to-make-the-invisible-visible",
  "title": "The Eyes of Photon Science: Imaging, Simulation and the Quest to Make the Invisible Visible",
  "subtitle": null,
  "language": "en",
  "track": "Science",
  "type": "Talk",
  "abstract": "Science advances by extending our senses beyond the limits of human perception, pushing the boundaries of what we can observe. In photon science, imaging detectors serve as the eyes of science, translating invisible processes into measurable and analysable data. Behind every image lies a deep understanding of how detectors see, respond and perform.\r\n\r\nAt facilities like the European XFEL, the world's most powerful X-ray free-electron laser located in the Hamburg metropolitan area, imaging detectors capture ultrashort X-ray flashes at MHz frame rates and with high dynamic range.  Without these advanced detectors, even the brightest X-ray laser beam would remain invisible. They help to reveal what would otherwise stay hidden, such as the structure of biomolecules, the behaviour of novel materials, and matter under extreme conditions. But how do we know they will perform as expected? And how do we design systems capable of “seeing” the invisible?\r\n\r\nI will take a closer look how imaging technology in large-scale facilities is simulated and designed to make the invisible visible. From predicting detector performance to evaluating image quality, we look at how performance simulation helps scientists and engineers understand the “eyes” of modern science.",
  "description": "X-ray imaging detectors have come a long way in the last 15 years, turning ideas that once seemed impossible into realities. Imaging detectors in photon science are more than just high-speed cameras. They are complex systems operating at the limits of what’s physically measurable. Understanding how they behave before, during, and after experiments is essential to advancing both the technology and the science it enables.\n\nIn this talk, I’ll take you inside the world of detector simulation and performance modelling. I’ll explore how tools like Monte Carlo simulations, sensor response models, and system-level performance evaluations are used to:\n\n- Predict detector behaviour in extreme conditions (such as MHz X-ray bursts), and\n- identify critical performance bottlenecks before production.\n\nBy linking imaging technology with simulation and modelling, we can better interpret experimental data and design the next generation of scientific cameras. Beyond the technical aspects, this talk reflects on the broader theme of how we “see” though technology, what it means to make the invisible visible, and how simulation changes not only how we build instruments, but also how we understand them.\n",
  "logo": "https://cfp.cccv.de/media/39c3/submissions/WULKYL/Markus_Kuster_89CVsdQ_SgYagMH.webp",
  "persons": [
    {
      "guid": "648ad45f-3a14-5034-a890-9a548eb89abf",
      "name": "MarKuster",
      "public_name": "MarKuster",
      "avatar": "https://cfp.cccv.de/media/avatars/WNX3BZ_SXCtkf2.jpg",
      "biography": "I graduated from the University of Tübingen at the Institute for Astronomy and Astrophysics in theoretical and experimental Astrophysics. My scientific research focuses on the development of detectors and instrumentation for space and terrestrial applications. During the last 25 years I worked in the fields of X-ray astronomy, the race for dark matter and currently I am working on detectors for photon science.\n\nFurther stations of my career were the Max-Planck Institute for extraterrestrial Physics, the University of Technology in Darmstadt and the European Organisation for Nuclear Research - CERN. At the European XFEL I was responsible for the detector program of the first-generation detector systems up to routine operation.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_648ad45f-3a14-5034-a890-9a548eb89abf"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/the-eyes-of-photon-science-imaging-simulation-and-the-quest-to-make-the-invisible-visible",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/WULKYL/"
}