{
  "guid": "471f65aa-7729-5e51-b849-4603cfac762f",
  "code": "PM8ZHP",
  "id": 1665,
  "date": "2025-12-30T11:55:00+01:00",
  "start": "11:55",
  "duration": "00:40",
  "room": "One",
  "slug": "39c3-ccc-t-cosmic-ray-the-climate-catastrophe-and-trains",
  "title": "CCC&T - Cosmic ray, the Climate Catastrophe and Trains.",
  "subtitle": null,
  "language": "en",
  "track": "Science",
  "type": "Talk",
  "abstract": "How can we predict soil moisture by measuring cosmic ray products and what have trains to do with it? Ever wondered how this Dürremonitor works, that you heared about in ther german news? These question and some more I will try to answer while I give an overview of some of the research that is done by the Helmholtz Centre for Environmental Research (UFZ).",
  "description": "The Dürremonitor is a programme that is often mentioned in the German news when some regions experience drought. Alongside the Dürremonitor and the underlying Mesoscale Hydrological Model (MHM), there is ongoing research at the UFZ concerning soil moisture. Some of these studies involve measuring soil moisture using a technique called cosmic ray neutron sensing (CRNS). Rather than taking measurements, the MHM uses a physics-based model incorporating precipitation forecasts to predict drought or flood. These two strategies for quantifying soil moisture are therefore in opposition: the measurement-based approach (CRNS) and the modelling-based approach (MHM/Dürremonitor). CRNS is a relatively new method of measuring soil moisture based on the proportion of neutrons reflected by the soil (the principles were discovered in the 1980s, but it has only recently become commercially applicable). This method has several advantages over previous soil moisture measurement methods: it is non-invasive, easy to set up, portable and can therefore be used on trains.\n\nIn the talk I will give an overview of the Dürremonitor and MHM and then focus on CRNS. I will explain the physical principles behind the method, how it is implemented in practice by making serveys using trains.\n",
  "logo": null,
  "persons": [
    {
      "guid": "1936d2e5-595c-50d5-b35c-e83d958ae19d",
      "name": "FantasticMisterFux",
      "public_name": "FantasticMisterFux",
      "avatar": null,
      "biography": "I studied biology and ecology, then realised that I would need computer skills for my research, so I switched to computational biology. I became hooked on programming, tinkering and hacking. I finished my PhD in bioinformatics, specialising in small proteins in bacteria. However, I found this type of fundamental research a little too esoteric. I currently work at the UFZ (Umweltforschungszentrum Leipzig-Halle) on drought monitoring and related topics as a geoinformatician.\nThe first CCC I attended was the 35C3, where I immediately felt at home. This time, I finally found the courage to participate myself.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_1936d2e5-595c-50d5-b35c-e83d958ae19d"
    },
    {
      "guid": "939d796a-961f-5838-baa2-c4bc6e425fc7",
      "name": "louiT",
      "public_name": "louiT",
      "avatar": null,
      "biography": "Currently writing my Masterthesis with the Topic: Quantitative Assessment of Remote Sensing-Based Biomass Corrections for CRNS Soil Moisture Monitoring in German Forests.\nWorking since 2 Years on the Cosmonaut Web App Project at UFZ.\nNext year going to develope the CRNS python package NEPTOON.\n\nBachelor in Geoinformatics at Berliner Hochschule für Technik\nMaster in Earth System Data Science & Remote Sensing at Uni Leipzig\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_939d796a-961f-5838-baa2-c4bc6e425fc7"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/ccc-t-cosmic-ray-the-climate-catastrophe-and-trains",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/PM8ZHP/",
  "attachments": [
    {
      "url": "/media/39c3/submissions/PM8ZHP/resources/slides_Grm44dX.pdf",
      "type": "related",
      "title": "slides"
    }
  ]
}