{
  "guid": "4914b889-5003-561f-90a8-5371fc09a946",
  "code": "L98WRF",
  "id": 1809,
  "logo": "https://cfp.cccv.de/media/39c3/submissions/L98WRF/Screenshot_from_2025-10-22_21-18-05_Ripg1x2.png",
  "date": "2025-12-29T12:50:00+01:00",
  "start": "12:50",
  "duration": "00:40",
  "room": "One",
  "slug": "39c3-1809-what-makes-bike-sharing-work-insights-from-43-million-kilometers-of-european-cycling-data",
  "url": "https://cfp.cccv.de/39c3/talk/L98WRF/",
  "title": "What Makes Bike-Sharing Work? Insights from 43 Million Kilometers of European Cycling Data",
  "subtitle": "",
  "track": "Science",
  "type": "Talk",
  "language": "en",
  "abstract": "Bike- and e-bike-sharing promise sustainable, equitable mobility - but what makes these systems successful? Despite hundreds of cities operating thousands of shared bikes, trip data is rarely public. To address this, we built a geospatial analysis pipeline that reconstructs trip data from publicly accessible system status feeds. Using this method, we gathered **43 million km** of bike-sharing trips across **268 European cities**. Combined with over **100 urban indicators** per city, our analyses reveal how infrastructure, climate, demographics, operations, and politics shape system performance. We uncover surprising insights - such as why some e-bike systems underperform despite strong demand - and highlight how cities can design smarter, fairer mobility. All data and code are open-source, with an interactive demo at [dataviz.nefton.de](https://dataviz.nefton.de/).",
  "description": "We are Felix, Georg, and Martin - each of us working professionally in different research and data areas, ranging from the future of mobility to computational fluid dynamics and machine learning. What unites us is our shared interest in **quantitative traffic analyses**. Building on earlier small-scale studies focused on individual cities, we set out to launch a project that captures shared bike system data across Europe - from regular bikes to e-bikes.\r\n\r\nIn our study, which led to an **[open-access scientific publication](https://doi.org/10.1007/s11116-025-10661-2)**, we scraped shared bike data across Europe at a **minute-by-minute level** over many months, accumulating **more than 43 million records**. We analyze **behavioural and systemic patterns** to understand what makes a bike-sharing system useful and successful within a city. As such, this evidence-based research fits very well with the **39C3 Science track** and the theme of \"**Power Cycles**\" as we dissect the complex energy and usage cycles that define urban mobility and sustainable futures for everyone. We bridge the gap between urban planning, socioeconomics, and technology by applying statistical modeling and engineering knowledge to a large-scale mined dataset. Join us to learn whether right-wing politics stall sustainable mobility, or which climate e-bikes feel most comfortable in!\r\n\r\nWe love going the extra mile and therefore provide a live, interactive demo that everyone can use to explore and understand traffic flows: [dataviz.nefton.de](https://dataviz.nefton.de). Therefore, attendees will be able to play with the data in a self-service way. We also provide all code on GitHub and the complete dataset on HuggingFace. And, of course, we will also discuss how both bike-sharing operators and our boss reacted when we told them about the dataset we already had collected (spoiler: lawyers were involved, yet it’s still available for downloads…).",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "BG9DLG",
      "name": "Martin Lellep",
      "avatar": null,
      "biography": "Here for a cool talk!",
      "public_name": "Martin Lellep",
      "guid": "f1c434a0-24d7-58b1-9a31-31ce0293db12",
      "url": "https://cfp.cccv.de/39c3/speaker/BG9DLG/"
    },
    {
      "code": "RB3CZW",
      "name": "Georg Balke",
      "avatar": "https://cfp.cccv.de/media/avatars/RB3CZW_MaiiW1B.png",
      "biography": "Ich leite an der TU München das Team Smart Mobility, in dem wir uns mit datengetriebenen Methoden in der Verkehrsforschung beschäftigen. Autos, LKW, Fahrräder, Scooter - Wenn es eine offene API gibt, haben wir sie schon angezapft.",
      "public_name": "Georg Balke",
      "guid": "245727d0-4ed4-593c-a77d-c28225f4478e",
      "url": "https://cfp.cccv.de/39c3/speaker/RB3CZW/"
    },
    {
      "code": "7CQFFP",
      "name": "FelixW",
      "avatar": null,
      "biography": "Hi – I’m Felix. I’m an engineer who got lost in coding. I did my PhD on bike sharing and now work at the MCube research cluster, which focuses on all things mobility. I love seeing innovation applied to real-world problems and making people’s lives better.",
      "public_name": "FelixW",
      "guid": "6a26b862-10be-50fd-9229-28d8ba082412",
      "url": "https://cfp.cccv.de/39c3/speaker/7CQFFP/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/L98WRF/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/L98WRF/",
  "attachments": []
}