{
  "guid": "4972548a-618e-56a1-8328-3abe474a31ab",
  "code": "MFKMWA",
  "id": 1882,
  "date": "2025-12-30T00:15:00+01:00",
  "start": "00:15",
  "duration": "00:40",
  "room": "Ground",
  "slug": "39c3-verschlusselung-brechen-durch-physischen-zugriff-smartphone-beschlagnahme-durch-polizei",
  "title": "Verschlüsselung brechen durch physischen Zugriff - Smartphone Beschlagnahme durch Polizei",
  "subtitle": null,
  "language": "de",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "abstract": "Eine zwar profane Methode der Überwachung, die Polizeibehörden in Deutschland jedoch hunderttausendfach anwenden, ist das Auslesen von Daten beschlagnahmter Smartphones und Computer. Dazu nutzt die Polizei Sicherheitslücken der Geräte mithilfe forensischer Software von Herstellern wie Cellebrite oder Magnet aus. Die Verfassungsmäßigkeit der Rechtsgrundlagen ist zweifelhaft. Im Vortrag werden anhand aktueller Fälle technische und juristische Hintergründe erörtert.",
  "description": "Staatstrojaner, Chat-Kontrolle, Wanzen. Die Mittel staatlicher Überwachung sind vielfältig und teilweise technisch sehr komplex. Dabei ist es leicht, den Überblick zu verlieren. Ein relativ profanes Mittel, das Polizeibehörden in Deutschland hunderttausendfach anwenden, ist die Beschlagnahme von Smartphones und Laptops sowie das Auslesen ihrer Daten. Genaue Statistiken gibt es nicht. Es dürften jedoch mehr Fälle sein als bei der einfachen Telekommunikationsüberwachung. Allein in Sachsen-Anhalt waren es innerhalb von fünf Jahren 13.000 Smartphones.\n\nAuch bei leichten Straftaten und Ordnungswidrigkeiten beschlagnahmt die Polizei regelmäßig Datenträger - insbesondere Smartphones und Laptops - etwa beim Verdacht einer Beleidigung oder bei der Handynutzung im Straßenverkehr. Oft werden auch Hausdurchsuchungen durchgeführt und dabei alle technischen Geräte beschlagnahmt und durchsucht. Die Verfassungsmäßigkeit dieser polizeilichen Praxis ist sehr zweifelhaft. Das Bundesinnenministerium plante in der letzten Legislatur sogar, die Kompetenzen der Polizei auszuweiten wodurch auch heimliche Hausdurchsuchungen möglich werden sollten. Damit könnte die Polizei heimlich Staatrojaner installieren oder sog. Evil-Maid-Angriffe vorbereiten. Die Strafverfolgungsbehörden stützen sich auf die Beschlagnahmevorschriften der §§ 94 ff. Strafprozessordnung, die seit 1877 im Wesentlichen unverändert geblieben sind und in ihrem Wortlaut weder die Möglichkeit eines Datenzugriffs noch die Modalitäten und Grenzen einer Datenauswertung regeln. Auch wird die Maßnahme nicht auf Straftaten einer gewissen Schwere begrenzt und es fehlen Vorgaben zum Schutz besonders sensibler Daten, die etwa in den Kernbereich der persönlichen Lebensführung fallen. Im Rahmen einer Durchsuchung ermöglicht es der §§ 110 Strafprozessordnung eine vorläufige Sicherung und Durchsicht der Speichermedien. Auch diese Vorschrift reicht nicht aus, um Grundrechte angemessen zu schützen, da mit der kompletten Ausforschung des gesamten Datenbestandes ein gravierender Grundrechtseingriff in die Privatsphäre der Betroffenen verbunden ist und gesetzlich keine angemessenen Grenzen gesetzt werden.\n\nGerade auf Smartphones befinden sich oft höchstpersönliche Daten wie Chats mit der Familie oder dem*der Partner*in, Fotos, Kontakte, Standortdaten und Dating-Apps. Darüber hinaus sind die Geräte regelmäßig mit Cloud-Diensten und anderen Datenträgern verbunden. Auf all diese Daten können Polizeibehörden dann zugreifen.\nMöglich wird das durch Software von Firmen wie Cellebrite, MSAB oder Magnet. Diese nutzen Sicherheitslücken aus, um die Verschlüsselung von Smartphones zu knacken. Wie auch bei Sicherheitslücken für Staatstrojaner sind die Sicherheitslücken, die diese Firmen ausnutzen, den Herstellern nicht bekannt. Damit unterstützen deutsche Behörden ein System, dass die Geräte aller unsicher macht. Auch die Bitlocker-Verschlüsselung von Windows-Computern lässt sich oft umgehen. Dies ermöglicht den Strafverfolgungsbehörden den freien und unbeschränkten Zugang zu allen persönlichen Daten, ohne angemessene gesetzliche oder gerichtliche Kontrolle und Überprüfung. Auch für die betroffenen Personen wird nicht erkennbar, in welchem Ausmaß Daten durchsucht und ausgewertet wurden. Im Vortrag wird der aktuelle Stand und die Probleme von Verschlüsselung von Windows und Linux Computern sowie Android und iOS Smartphones erläutert.\n\nAm Beispiel des Journalisten Hendrik Torners, dessen Smartphone beschlagnahmt wurde, nachdem er eine polizeiliche Maßnahme nach einer Klimademonstration beobachtet hatte und nun im Rahmen einer Verfassungsbeschwerde dagegen vorgeht, sowie weiterer öffentlich diskutierter Fälle wie [#Pimmelgate](https://events.ccc.de/congress/2025/hub/tag/Pimmelgate) besprechen die Vortragenden die technischen und juristischen Hintergründe.\n",
  "logo": null,
  "persons": [
    {
      "guid": "a2b08034-91a1-55d9-ad4d-d19c1b7fccff",
      "name": "Davy Wang",
      "public_name": "Davy Wang",
      "avatar": "https://cfp.cccv.de/media/avatars/AJYJMH_choWj6R.jpg",
      "biography": "Davy Wang ist Volljurist und Verfahrenskoordinator bei der Gesellschaft für Freiheitsrechte. Er arbeitet zu digitalen Freiheitsrechten und Plattformregulierung. Ein Schwerpunkt seiner Arbeit ist die Unterstützung von rechtlichen Verfahren in den Bereichen staatliche Überwachung und Datensammlung, digitale Teilhabe, Nutzer*innenrechten auf Online-Plattformen und die wirksame Durchsetzung von KI-Regulierung.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_a2b08034-91a1-55d9-ad4d-d19c1b7fccff"
    },
    {
      "guid": "878c9dd0-6965-5723-a325-ad8bb7d08be0",
      "name": "Viktor Schlüter",
      "public_name": "Viktor Schlüter",
      "avatar": "https://cfp.cccv.de/media/avatars/E9WZVS_UMfPxoR.webp",
      "biography": "hat mal ein Auto auf einem Rapkonzert gewonnen\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_878c9dd0-6965-5723-a325-ad8bb7d08be0"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/verschlusselung-brechen-durch-physischen-zugriff-smartphone-beschlagnahme-durch-polizei",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/MFKMWA/"
}