{
  "guid": "49ceb68c-bcbe-592f-9c62-b1085f657190",
  "code": "3TA9HW",
  "id": 1668,
  "date": "2025-12-30T12:50:00+01:00",
  "start": "12:50",
  "duration": "00:40",
  "room": "Zero",
  "slug": "39c3-fossile-industrie-liebt-ki",
  "title": "Fossile Industrie liebt KI!",
  "subtitle": null,
  "language": "de",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "abstract": "Der Hype um generative KI und die Gasindustrie bilden in Zeiten der Klimakrise eine bedrohliche Allianz für die Zukunft des Planeten.",
  "description": "Obwohl die negativen Klimaauswirkungen generativer KI immer deutlicher werden, sollen in ganz Europa Großrechenzentren gebaut werden und Deutschland „KI-Nation“ werden, was ungeahnte „Wirtschaftskräfte freisetzen soll“ – zumindest, wenn es nach der Bundesregierung geht.\n\nDer Ausbau der Recheninfrastruktur für generative KI benötigt viel Energie, Wasser und Ressourcen, was global zu Umweltschäden führt. Prognosen für die EU zeigen, dass der Energieverbrauch in Zukunft so groß werden könnte, dass der Ausbau der erneuerbaren Energien nicht mithalten kann – doch die fossile Industrie steht bereits in den Startlöchern.\n\nDer Hype um generative KI liefert ihnen die perfekte Begründung für den Ausbau fossiler Infrastruktur- mitten in der eskalierenden Klimakrise. Tech- und Fossilkonzerne investieren massiv in neue Gaskraftwerke für energiehungrige Rechenzentren.  Dabei ist der wirtschaftliche Nutzen und die Wertschöpfung durch die Technologie weiterhin unklar.\nKlar ist: wir erleben derzeit eine fossile Gegenoffensive im Gewand digitaler Versprechen. Auf Kosten des Klimas und der Zukunft.\n\nDieser Vortrag schließt an den Talk \"Klimaschädlich by Design\" vom 38C3 an und gibt Updates zu Entwicklungen in Deutschland und Europa.\n",
  "logo": "https://cfp.cccv.de/media/39c3/submissions/3TA9HW/a-rising-tide-lifts-all-bots_rose-willis_vEAOt06.png",
  "persons": [
    {
      "guid": "14cf0385-199f-5cd2-a179-d02c553e9cb5",
      "name": "Stefan, Yannik & Rike",
      "public_name": "Stefan, Yannik & Rike",
      "avatar": "https://cfp.cccv.de/media/avatars/photo_5366549009604394935_y_U3hE4p4.jpg",
      "biography": "Hi! Ich bin Rike und koordiniere das Bits & Bäume Bündnis: https://bits-und-baeume.org/\nIch bin Ökonomin und Aktivistin im Bereich Klima- und Stadtpolitik.\nIhr könnt mich auch im Bits & Bäume Habitat auf dem 39C3 treffen. <3\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_14cf0385-199f-5cd2-a179-d02c553e9cb5"
    },
    {
      "guid": "e78efd2e-09d7-50da-9104-5f92044c346c",
      "name": "Moritz Leiner",
      "public_name": "Moritz Leiner",
      "avatar": "https://cfp.cccv.de/media/avatars/ZFBTGA_MozvVAr.jpg",
      "biography": "Hi, ich bin Moritz, Sozialwissenschaftler und organisiere bei dem Umwelt- und Menschrechtsverein urgewald e.V. Kampagnen zu deutschen Energie- und Finanzkonzernen. Auf urgewalds öffentlich zugänglicher Industriedatenbank „Global Oil and Gas Exit List“ spielen neue Gaskraftwerksprojekte für Datenzentren eine zunehmende Rolle.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_e78efd2e-09d7-50da-9104-5f92044c346c"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/fossile-industrie-liebt-ki",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/3TA9HW/"
}