{
  "guid": "4b106a63-ac7e-5c39-945a-26ce0d071897",
  "code": "WTKXJZ",
  "id": 1675,
  "logo": null,
  "date": "2025-12-27T16:00:00+01:00",
  "start": "16:00",
  "duration": "01:00",
  "room": "Zero",
  "slug": "39c3-1675-ki-digitalisierung-und-longevity-als-fix-fur-ein-kaputtes-gesundheitssystem",
  "url": "https://cfp.cccv.de/39c3/talk/WTKXJZ/",
  "title": "„KI“, Digitalisierung und Longevity als Fix für ein kaputtes Gesundheitssystem?",
  "subtitle": "",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "language": "de",
  "abstract": "Großen Herausforderungen im Gesundheitswesen soll mittels Technik und Eigenverantwortung begegnet werden. Die Hoffnung: „KI“ und Digitalisierung machen das System effizienter; Selbstoptimierung und mehr Eigenverantwortung halten die Menschen länger gesund. Der Vortrag analysiert aktuelle Diskurse rund um Digitalisierung und Gesundheit, und fragt kritisch, wie diese Entwicklung ohnehin bestehende soziale Ungleichheiten verschärfen könnte. Am Ende bleibt die Frage: Wie könnten tragfähige Lösungen fürs Gesundheitssystem aussehen?",
  "description": "In der Analyse sind sich alle einig: Das Gesundheitssystem steht vor großen Herausforderungen, die von explodierenden Kosten, wachsenden Zugangsbarrieren bis hin zum anstehenden demographischen Wandel reichen: viele Menschen werden alt und kränker, während gleichzeitig sehr viele Mitarbeiter:innen des Gesundheitswesens in Rente gehen. Wir brauchen also Lösungen fürs Gesundheitssystem, die nachhaltig tragen und Menschenwürde ermöglichen. \r\n\u2028Während ganz unterschiedliche Lösungsansätze diskutiert werden, taucht ein Narrativ immer wieder auf: Dass Digitalisierung durch massive Effizienzgewinne die bestehenden Probleme im Gesundheitswesen fixen werden: Dank „KI“ sollen Menschen weniger häufig Ärzt:innen brauchen, zum Beispiel, indem durch Symptomchecker und Co vorgefiltert wird, wer wirklich behandelt werden muss, und wer nicht. Manche behaupten, dass Hausärzt:innen künftig ein vielfaches an Patient:innen behandeln könnten, wenn nur die richtigen technischen Hilfsmittel gefunden wurden. Und längst befinden wir uns tatsächlich in einer Realität, in der Chats mit LLMs an vielen Stellen zumindest Dr. Google ersetzt haben.\r\n\r\nWeitere Lösungsansätze zielen auf mehr Eigenverantwortung ab: \"Longevity\" ist das Trendwort in aller Munde. Ein Ansatz der „Langlebigkeit“, der maßgeblich durch technische \r\nMaßnahmen gestützt sein soll: Selbstoptimierung per App, „KI“ als individueller Gesundheitsassistent und allerlei experimentelle Untersuchungen. Die Grundidee: Wenn Menschen länger gesund bleiben und leben, wird das Gesundheitssystem weniger belastet, während Menschen länger zu Gesellschaft und Wirtschaft beitragen können. Die ideologischen Grundzüge und Geschäftsmodelle der „Longevity“ kommen aus den USA, von Tech-Milliardären und ihren Unsterblichkeitsfantasien bis hin zu wenig seriösen Gesundheitsinfluencer:innen, die am Ende oft mehr schaden als dass sie zu einem größeren Wohlbefinden ihrer Kund:innen beitragen würden - und trotzdem hunderttausende auf Social Media in ihren Bann ziehen.\r\n\r\nDer Vortrag zieht Verbindungslinien zwischen naiver Technikgläubigkeit, aktuellen Diskursen im Gesundheitswesen, ihren fragwürdigen ideologischen Wurzeln und der Frage, wie wir Herausforderungen und insbesondere sozialen Ungleichheiten im Feld der Gesundheit wirklich effektiv begegnen.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "KCK3JB",
      "name": "Manuel Hofmann",
      "avatar": "https://cfp.cccv.de/media/avatars/KCK3JB_Ux7tg3j.webp",
      "biography": "Politikwissenschaftler und Soziologe. Referent bei der Deutschen Aidshilfe",
      "public_name": "Manuel Hofmann",
      "guid": "700e9470-7a7c-5cba-ab66-69c7e7a4cf44",
      "url": "https://cfp.cccv.de/39c3/speaker/KCK3JB/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/WTKXJZ/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/WTKXJZ/",
  "attachments": []
}