{
  "guid": "4bfb9f9c-a8cd-5bcb-8b0f-ce20509f2a36",
  "code": "77GPKJ",
  "id": 2271,
  "date": "2025-12-27T12:50:00+01:00",
  "start": "12:50",
  "duration": "00:40",
  "room": "One",
  "slug": "39c3-building-hardware-easier-than-ever-harder-than-it-should-be",
  "title": "Building hardware - easier than ever - harder than it should be",
  "subtitle": null,
  "language": "en",
  "track": "Hardware",
  "type": "Talk",
  "abstract": "Building electronics has never been easier, cheaper, or more accessible than the last few years. It's also becoming a precious skill in a world where commercially made electronics are the latest victim of enshittification and vibe coding. And yet, while removing technical and financial barriers to building things, we've not come as far as we should have in removing social barriers. The electronics and engineering industry and the cultures around them are hostile to newcomers and self-taught practitioners, for no good reason at all. I've been teaching advanced electronics manufacturing skills to absolute beginners for a decade now, and they've consistently succeeded at acquiring them. I'm here to tell you why it's not as hard as it seems, how to get into it, and why more people who think they can't should try.",
  "description": "Electronics is easier and more fun to get into than it's ever been before. All the tools and resources are easily accessible and super cheap or free. There's an enormous amount of things to build from and build on.\n\nIt's also never been more important to be able to build and understand electronics, as assholes running corporations are wasting their workers' unpaid overtime on making all the electronics in our lives shittier, more full of ads, slop, and spyware, and more frustrating to use. Encountering a device that works for you instead of against you is a breath of fresh air. Building one is an act of resistance and power. Not depending on the whims of corporate assholes is freedom.\n\nHowever, the culture around electronics and the electronics industry is one of exclusion and gatekeeping. It doesn't need to be. It would be stupidly easy to make things better, and we should. I've been teaching absolute beginners advanced electronics manufacturing skills for many years now. It's absolutely shocking how much more diverse the people who I teach are compared to the industry. The \"hardware is hard\" meme is true in some cases but toxic when worn as a badge of pride or a warning to people attempting it.\n\nI will tell you why designing and building electronics is not nearly as hard as it seems, how it's almost never been easier to get into it, and why it's very important that people who think or have been told they can't do it should be doing more of it. I'll tell you my experiences of what building devices is like, show and tell a few useful skills, and tell the story of how trying to prove someone wrong on the internet turned into a decade of teaching people with zero experience how to handle the most complex electronic components at all sorts of community events.\n",
  "logo": null,
  "persons": [
    {
      "guid": "a4580ac7-445e-536c-a2a5-02138b409065",
      "name": "Kliment",
      "public_name": "Kliment",
      "avatar": null,
      "biography": "Hi, I'm Kliment (he/him). I build electronics for fun and profit, and have been teaching electronics skills at various community events for the past decade. Between events, I run an electronics design consultancy helping people and companies build things. I am one of the maintainers of the libraries of the popular electronics design software KiCad. I also help run the Hardware Hacking Area at chaos and other events.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_a4580ac7-445e-536c-a2a5-02138b409065"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/building-hardware-easier-than-ever-harder-than-it-should-be",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/77GPKJ/"
}