{
  "guid": "4c285dd4-58fc-5378-9434-628f7871ee9f",
  "code": "MNXRET",
  "id": 1642,
  "logo": "https://cfp.cccv.de/media/39c3/submissions/MNXRET/freiheit.exe_Utopien_als_Malware_Qmt6KDl.jpg",
  "date": "2025-12-28T20:10:00+01:00",
  "start": "20:10",
  "duration": "00:40",
  "room": "One",
  "slug": "39c3-1642-freiheit-exe-utopien-als-malware",
  "url": "https://cfp.cccv.de/39c3/talk/MNXRET/",
  "title": "freiheit.exe - Utopien als Malware",
  "subtitle": "",
  "track": "Art & Beauty",
  "type": "Theater / Performance",
  "language": "de",
  "abstract": "\"freiheit.exe“ ist eine Lecture über die ideologischen Rootkits des Silicon Valley. Sie schlägt den Bogen von den italienischen Futuristen zu den heutigen Tech-Feudalisten, vom Akzelerationismus zur Demokratieskepsis der Libertären, von Tolkien zur PayPal-Mafia. \r\nBasierend auf den Recherchen zu meinem Theaterstück \"freiheit.exe. Utopien als Malware\", in dem  journalistische Analyse auf performative Darstellung trifft.",
  "description": "Ich lade das CCC-Publikum ein, die Betriebssysteme hinter unseren Betriebssystemen zu untersuchen.\r\nWährend wir uns mit Verschlüsselung, Datenschutz und digitaler Selbstbestimmung beschäftigen, installieren Tech-Milliardäre ihre Weltanschauungen als Default-Einstellungen unserer digitalen Infrastruktur. Die Recherchen beleuchten die mitgelieferte Malware.\r\n\r\nIch navigiere durch die Ideengeschichte zwischen Marinettis Futuristischem Manifest (1909) und Musks Mars-Kolonien, von den ersten Programmiererinnen zur Eroberung des Alls, von neoliberalen Think Tanks zur Schuldenbremse, von nationalen Christen zu Pronatalisten.\r\nInvestigative Recherche trifft auf performative Vermittlung. \r\nMit O-Tönen von Peter Thiel, Nick Land und anderen zeigt die Lecture ideologische Verbindungslinien zwischen Theoretikern autoritär-technoider Träume und den Visionen der Tech-Oligarchen auf:\r\n\r\nEs geht um „Freedom Cities“, Steuerflucht und White Supremacy.\r\nUm Transhumanismus als Upgrade-Zwang bis hin zu neo-eugenischen Gedanken.\r\nUm Akzeleration als politische Strategie: Geschwindigkeit statt Reflexion, Disruption statt Demokratie, Kolonisierung – jetzt auch digital.\r\n\r\nAus Theaterperspektive betrachte ich das Revival der Cäsaren und die Selbstinszenierung von Tech-CEOs als Künstler, Priester oder Genies. \r\nUnd mit der Investigativ Reporterin Sylke Grunwald habe ich recherchiert, was all das mit den Debatten rund um Palantir zu tun hat.\r\n\r\nDie scheinbar alternativlose Logik von \"Move Fast and Break Things\" ist nicht unvermeidlich – sie ist gewollt, gestaltet, ideologisch aufgeladen.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "MFGD8G",
      "name": "Christiane Mudra",
      "avatar": "https://cfp.cccv.de/media/avatars/MFGD8G_d5xjUL3.png",
      "biography": "Christiane ist Autorin, Regisseurin und Gründerin von investigative theater. \r\n\r\nIhre Produktionen beruhen auf journalistischer Langzeitrecherche. Zu den Schwerpunktthemen gehören Rechtsextremismus, Misogynie und Netzpolitik. Seit 2013 arbeitet sie dabei spartenübergreifend, mit digitalen Mitteln und interaktiven Formaten, oft außerhalb traditioneller Theaterräume.\r\nZu ihren jüngsten Produktionen in München und Berlin gehören The Holy Bitch Project über häusliche, sexualisierte und digitale Gewalt gegen Frauen, Hotel Utopia, ein interaktives Gesellschaftsspiel über den Wert von Pässen im Flughafen Tempelhof und Selfie & Ich, ein Abend über psychische Erkrankungen in Privatwohnungen.\r\n2024 feierte BETA, ihre investigative Musiktheaterproduktion über die demokratiegefährdende Macht von  Big Tech Premiere an der Deutschen Oper Berlin. Das Stück Xploit:s über Ausbeutung im Niedriglohnsektor wurde im ehemaligen Kaufhof am Stachus in München uraufgeführt.\r\n\r\nVon 2013 bis 2018 war Christiane als Beobachterin und Journalistin im NSU-Prozess und diversen Untersuchungsausschüssen. Sie recherchierte in den USA zu MAGA, Alt Right und den Incels, war Artist in Residence bei der Biennale in Venedig und inszenierte mit brasilianischen Aktivist*innen eine 1:1 Performance im Stadtraum von Fortaleza/BR über weltweite Überwachung und die Militärdiktatur. Ihr  Theaterfilm The Holy Bitch Project wurde auf dem NYC Independent Film Festival gezeigt.\r\nChristianes Recherchen im Bereich Rechtsextremismus wurden auch in Sachbüchern und Podcasts veröffentlicht.",
      "public_name": "Christiane Mudra",
      "guid": "81602304-b23a-5fc5-9dc1-9e644fb95eba",
      "url": "https://cfp.cccv.de/39c3/speaker/MFGD8G/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/MNXRET/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/MNXRET/",
  "attachments": []
}