{
  "guid": "505d70fc-2e86-59ea-9de0-c71ac0efb8db",
  "code": "EHNYR3",
  "id": 2408,
  "logo": "https://cfp.cccv.de/media/39c3/submissions/EHNYR3/Transitory-Cosmology_Sacrifice-Zones-cop_UOqoMEc.jpg",
  "date": "2025-12-29T20:30:00+01:00",
  "start": "20:30",
  "duration": "01:00",
  "room": "Ground",
  "slug": "39c3-2408-undersea-cables-in-africa-new-frontiers-of-digital-colonialism",
  "url": "https://cfp.cccv.de/39c3/talk/EHNYR3/",
  "title": "Undersea Cables in Africa: New Frontiers of Digital Colonialism",
  "subtitle": "",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "language": "en",
  "abstract": "The  Atlantic Telegraph was ordained by the United States and Britain to be a  tool of empire expansion. Evolving from the telegraph cables  surrounding the African continent after the abolition of the Atlantic Slave trade in the 1700s, big tech companies like Meta and Google are  continuing this colonial legacy by owning the longest and fastest  undersea cables in the world.",
  "description": "The talk will present a historical timeline to uncover the colonial roots of undersea cables and how big tech continue from this legacy through a narrative of expanding Internet infrastructure to bridge the digital divide, whilst also extracting resources to fuel the AI boom. Drawing from historical maps,  art, and pre-colonial laws of the sea, we will look at the infrastructure that carries up to 95 percent of  the internet across oceans. The goal will be to explore ingrained value systems in infrastructure that reinforce colonial logic in the expansion of big tech into African internet infrastructure. \r\n\r\nThose who attend the talk will  gain a new perspective of how internet infrastructure is a hidden system of power that extracts from people and land, as well as the colonial logic behind it. The talk will end with recommendations for reclaiming internet infrastructure using decolonial methods that do not replicate systems of oppression, especially when attempting to build green infrastructures.\r\n\r\nEsther presents the outcomes of her art research on ‘Undersea Cables in Africa: New Frontiers of Digital Colonialism’, co-written with Dr. Abeba Birhane, focusing on the parallels of pre-colonial telegraph infrastructures and present day undersea cables owned by Meta and Google. This art research, which has received awards from the Green Screen Coalition Catalyst Fund and the Mozilla Creative Media award, interrogates the hidden systems of power transferred through colonial communication infrastructures.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "TJMB9Y",
      "name": "Esther Mwema",
      "avatar": "https://cfp.cccv.de/media/avatars/TJMB9Y_QZ5uNOW.jpg",
      "biography": "Esther Mwema is a digital inequalities expert focused on Internet governance, Internet infrastructure and Internet freedom. Esther’s practice intersects art and tech-innovation, interrogating hidden systems of power in digital society ranging from fiberoptic cables, digital colonialism, to gender inequality. Esther is an award-winning artist and digital inequalities expert, who has over 10 years commitment to social impact at the grassroots via her non-profits Digital Grassroots and Safety First for Girls (SAFIGI) Foundation. She has done extensive work within the UN system and is an Open Internet for Democracy leader who centers African feminist and decolonial methodologies in practice, and an award-winning artist.\r\n\r\nWeb: https://esthermwema.persona.co/",
      "public_name": "Esther Mwema",
      "guid": "82ecdbdc-35c0-5be7-9b1d-79b958f80757",
      "url": "https://cfp.cccv.de/39c3/speaker/TJMB9Y/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/EHNYR3/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/EHNYR3/",
  "attachments": []
}