{
  "guid": "5a765194-a365-5b0c-988a-eb7a118cd663",
  "code": null,
  "id": 200518,
  "date": "2025-12-27T16:00:00+01:00",
  "start": "16:00",
  "duration": "00:30",
  "room": "Free Knowledge Habitat",
  "slug": "39c3-wiki-loves-demokratie",
  "title": "Wiki Loves Demokratie",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "Talk",
  "abstract": "Rückblick auf bisher durchgeführte Veranstaltungen und gemeinsamer Ausblick auf kommende Veranstaltungen.",
  "description": "Im Jahr 2024 konnten wir den 75. Geburtstag des Grundgesetzes feiern. Anlass genug, um mit “Wiki Loves Demokratie” eine Reihe von Veranstaltungen ins Leben zu rufen, die dazu beitragen will, zum Begriff der Demokratie selbst und zur freiheitlich demokratischen Grundordnung Artikel in der Wikipedia weiter anzureichern und so diese wichtigen Themen noch sichtbarer zu machen. In der Session wollen wir auf die durchgeführten Veranstaltungen zurückblicken und gemeinsam weitere Ideen und Wünsche für zukünftige Veranstaltungen zu “Wiki Loves Demokratie” zusammentragen und sammeln. Wir freuen uns auf den Austausch mit euch!\n",
  "logo": "https://pretalx.wikimedia.de/media/39c3-2025/submissions/V3SK8V/Bildschirmfoto_2025-12-22_um_11.47.16_vskk8jA.png",
  "persons": [
    {
      "guid": "72b67aa4-ec68-53e3-8fd8-d6d74cad6e75",
      "name": "Holger Plickert (WMDE)",
      "public_name": "Holger Plickert (WMDE)",
      "avatar": "https://pretalx.wikimedia.de/media/avatars/76589c02c6ad2d3fe812f8d4612aab0b_bipI1cL.jpg",
      "biography": "Holger Plickert ist Referent für Kultur- und Gedächtnisinstitutionen bei Wikimedia Deutschland e. V. Zuvor arbeitete er u. a. für die Stiftung Preußische Schlösser und Gärten Berlin-Brandenburg und die Kulturquartier Mecklenburg-Strelitz gGmbH. In seiner jetzigen Funktion versteht er sich als Bindeglied zwischen den Ehrenamtlichen der Wikimedia-Projekte und den Kultur- und Gedächtnisinstitutionen sowie den Fachverbänden.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_72b67aa4-ec68-53e3-8fd8-d6d74cad6e75"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/wiki-loves-demokratie",
  "links": [],
  "origin_url": "https://pretalx.wikimedia.de/39c3-2025/talk/V3SK8V/"
}