{
  "guid": "6189eca4-8ac2-5606-af23-628b82eb4a54",
  "code": "U9UGN3",
  "id": 1562,
  "date": "2025-12-28T19:15:00+01:00",
  "start": "19:15",
  "duration": "00:40",
  "room": "Ground",
  "slug": "39c3-cpu-entwicklung-in-factorio-vom-d-flip-flop-bis-zum-eigenen-betriebssystem",
  "title": "CPU Entwicklung in Factorio: Vom D-Flip-Flop bis zum eigenen Betriebssystem",
  "subtitle": null,
  "language": "de",
  "track": "Hardware",
  "type": "Talk",
  "abstract": "Factorio ist ein Fabriksimulationsspiel mit integriertem Logiksystem. Dies ermöglichte mir den Bau einer CPU, die unter anderem aus einer 5-stufiger Pipeline, einer Forwarding Logikeinheit, Interrupt Handling sowie einem I/O Interface besteht. Über einen selbst geschriebenen Assembler konnte ich ein eigenes Betriebssystem und Programme wie Minesweeper oder Snake integrieren. \r\nDer Talk soll euch zeigen, wie sich klassische Computerarchitektur in einem völlig anderen technischen Kontext umsetzen lässt und wo dabei überraschend echte Probleme der CPU-Entwicklung auftreten.\r\nKommt mit auf die Reise: Vom Blick auf den gesamten Computer bis hinunter zu den einzelnen Logikgattern ist es nur eine Mausradbewegung entfernt!",
  "description": "Factorio ist ein Spiel über Fabrikautomation - Förderbänder, Dampfmaschinen und Produktionsketten stehen im Vordergrund. Eigentlich ist das interne Logiksystem („Combinators“) gedacht für die Steuerung der Fabrik, jedoch erlaubt es auch die Entwicklung komplexer Hardware.\n\nIn diesem Vortrag erzähle ich meine Geschichte, wie ich eine vollständige RISC-V-Architektur in Factorio  rein aus Vanilla-Combinators erschaffen habe:\nDie CPU arbeitet mit 32 Bit-Wörtern, verfügt über 32 General Purpose Register, 128 KB RAM/Persistent Storage, eine 5-stufige Pipeline mit Forwarding und Hazard-Handling sowie eine Logikeinheit für Branches und Interrupts. Ein Display-Controller steuert eine Konsolen-Ausgabe sowie ein Farbdisplay, während ein Keyboard-Controller Eingaben über physische In-Game-Tasten ermöglicht.\n\nErgänzt wird die Hardware auf der Softwareseite durch das Betriebssystem *FactOS*, das ein einfaches Filesystem sowie Systemcalls (zum Beispiel zum Drucken eines Strings im Terminal) zur Verfügung stellt.  Außerdem schränkt das Betriebssystem das ausführende User-Programm auf einen festen Bereich des RAMs ein und verhindert so direkten Zugriff auf die Hardware.\n\nIm Talk möchte ich euch durch alle Schichten dieser Konstruktion führen:\nVon den Grundlagen der Factorio-Signalphysik über CPU-Design und Pipeline-Hazards bis zur Toolchain und dem Betriebssystem. Außerdem gebe ich einen Einblick, wie die Limitierungen aber auch die Vorteile von Factorio im Vergleich zu herkömmlichen Logik Simulatoren das Design einer CPU beeinflussen können. Ich runde meinen Talk mit einer Live-Demonstration des Systems ab.\n\nDie vollständige CPU, inklusive Quellcode des Assemblers, Blueprints und Beispielprogramme, stelle ich öffentlich zur Verfügung. Dadurch kann jede interessierte Person die Architektur in Factorio laden, erweitern und eigene Software dafür entwickeln.\n\nEs wird im Anschluss eine [Self-organized Session](https://events.ccc.de/congress/2025/hub/en/event/detail/cpu-entwicklung-in-factorio-wie-benutze-ich-phds-f) geben, in der ich eine hands-on Einleitung geben werde, wie man die CPU in Factorio lädt, wie man Programme schreibt, diese assembliert und in Factorio einfügt. Auch kann man dort gerne mit mir über das Projekt quatschen, ich freue mich auf alle Beiträge und Kommentare :)\n",
  "logo": "https://cfp.cccv.de/media/39c3/submissions/U9UGN3/intro_39c3_qwnzvh5_TkZaK4T_s5UzAmG.webp",
  "persons": [
    {
      "guid": "36884e4a-5b3a-5419-8031-c5db7e18a4f3",
      "name": "PhD (Philipp)",
      "public_name": "PhD (Philipp)",
      "avatar": "https://cfp.cccv.de/media/avatars/BXGCNF_Br1b5ev.JPG",
      "biography": "Ich promoviere in Machine Learning in Karlsruhe. Wenn ich das mal nicht tue, beschäftige ich mich mit esoterischen Logik-Simulatoren, 3d Druckern, Jonglage, oder mache Musik.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_36884e4a-5b3a-5419-8031-c5db7e18a4f3"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/cpu-entwicklung-in-factorio-vom-d-flip-flop-bis-zum-eigenen-betriebssystem",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/U9UGN3/",
  "attachments": [
    {
      "url": "/media/39c3/submissions/U9UGN3/resources/39c3_014_PWAzC00.pdf",
      "type": "related",
      "title": "Folien (PDF export)"
    }
  ]
}