{
  "guid": "62f556ab-b1b4-51fb-9c86-b49ea1f3c45f",
  "code": "VRFMFJ",
  "id": 1832,
  "logo": "https://cfp.cccv.de/media/39c3/submissions/VRFMFJ/Bildschirmfoto_2025-10-23_um_11.30.28_eZsDjnO.png",
  "date": "2025-12-27T20:30:00+01:00",
  "start": "20:30",
  "duration": "01:00",
  "room": "Ground",
  "slug": "39c3-1832-excuse-me-what-precise-time-is-it",
  "url": "https://cfp.cccv.de/39c3/talk/VRFMFJ/",
  "title": "Excuse me, what precise time is It?",
  "subtitle": "",
  "track": "Hardware",
  "type": "Talk",
  "language": "en",
  "abstract": "With PTP 1588, AES67, and SMPTE 2110, we can transmit synchronous audio and video with sub-millisecond latency over the asynchronous medium Ethernet. But how do you make hundreds of devices agree on the exact same nanosecond on a medium that was never meant to care about time?\r\nPrecision Time Protocol (IEEE 1588) tries to do just that. It's the invisible backbone of realtime media standards like AES67 and SMPTE 2110, proprietary technologies such as Dante, and even critical systems powering high-frequency trading, cellular networks, and electric grids.",
  "description": "Where even a few microseconds of drift can turn perfect sync into complete chaos.\r\nThis talk takes a deep dive into the mysterious world of precise time distribution in large networks. We’ll start by exploring how PTP 1588 actually works, from announce, sync, and follow-up messages to delay measurements and the magic of hardware timestamping. We’ll look at why PTP is critical for modern audio/video-over-IP standards like AES67 and SMPTE 2110, and how they push Ethernet to its absolute temporal limits.\r\nAlong the way, we’ll discover how transparent and boundary clocks fight jitter, and why your switch’s buffer might secretly hate you. We will do live Wireshark dissections of real PTP traffic, demos showing what happens when timing breaks, and some hands-on hardware experiments with grandmasters and followers trying to stay in sync.\r\nExpect packets, graphs, oscilloscopes, crashing live demos and at least one bad joke about time travel.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "LJADML",
      "name": "Oliver Ettlin",
      "avatar": "https://cfp.cccv.de/media/avatars/LJADML_ravD9KO.jpg",
      "biography": "Oliver Ettlin is a network engineer, time-nerd, and multicast enthusiast who spends an unreasonable amount of time making packets arrive exactly when (and where) they should. By day, he wrangles networks to achieve sub-microsecond precision with PTP (IEEE 1588), by night, he experiments with multicast setups that make switches sweat and routers question their existence.\r\nWith a background in network design and troubleshooting, Oliver has a soft spot for time synchronization, hardware timestamping, and the elegant (and sometimes painful) beauty of distributed systems that almost, but not quite, agree on what \"now\" means.\r\nHe loves turning complex timing and networking concepts into practical, knowledge, preferably with live demos, broken configs, a fair bit of humor and the black art of making multicast behave.",
      "public_name": "Oliver Ettlin",
      "guid": "e316ba64-bec5-56a6-a06f-6c9d83148461",
      "url": "https://cfp.cccv.de/39c3/speaker/LJADML/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/VRFMFJ/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/VRFMFJ/",
  "attachments": []
}