{
  "guid": "6396165e-0c44-58d3-a345-a63966473508",
  "code": "FJWMWQ",
  "id": 2386,
  "date": "2025-12-30T01:00:00+01:00",
  "start": "01:00",
  "duration": "01:30",
  "room": "One",
  "slug": "39c3-die-groe-datenschutz-datenpannen-und-ds-gvo-show",
  "title": "Die große Datenschutz-, Datenpannen- und DS-GVO-Show",
  "subtitle": null,
  "language": "de",
  "track": "Entertainment",
  "type": "Game show",
  "abstract": "Datenschutz darf auch Spaß machen, und alle können dabei etwas lernen, egal ob Einsteiger oder Profi-Hacker: Bei dem Datenschutz- und Datenpannen-Quiz kämpfen vier Kandidat:innen aus dem Publikum zusammen mit dem Publikum um den Sieg. Nicht nur Wissen rund um IT-Sicherheit und Datenschutz sondern auch eine schnelle Reaktion und das nötige Quäntchen Glück entscheiden über Sieg und Niederlage. Die Unterhaltsame Datenschutz-Quiz-Show mit Bildungsauftrag!",
  "description": "Datenschutz wird oftmals als lästige Pflicht wahrgenommen – aber was will und macht Datenschutz, für was ist er sinnvoll und was ist zu beachten? In welche Stolperfallen können auch Nerds hineinfallen? **Die Datenschutz- und DSGVO-Show vermittelt spielerisch Datenschutzgrundlagen,** bietet einen Einblick in die Praxis der Datenschutz-Aufsichtsbehörden und zeigt typische technische wie rechtliche Fehler im Umgang mit personenbezogenen Daten. Aber auch für Datenschutz-Profis und Superhirne sind einige harte Nüsse dabei.\n\nDer Moderator arbeitet beim Landesbeauftragten für den Datenschutz und die Informationsfreiheit Baden-Württemberg und berichtet aus der praktischen Arbeit einer Aufsichtsbehörde, nennt rechtliche Grundlagen, gibt Hinweise zu notwendigen technischen Maßnahmen nach Artikel 32 DS-GVO und die oftmals schwierige Risikoabschätzung nach „wir wurden gecybert“-Sicherheitsvorfällen.\n\nIm Quiz selbst müssen die Kandidat:innen in ihren Antworten praktische Lösungsvorschläge für häufige technische und rechtliche Probleme vorschlagen, zum Beispiel welche technischen Maßnahmen bei bestimmten Datenpannen nach dem „Stand der Technik“ angebracht sind, ob man als Website-Betreiber denn nun Google Analytics nutzen darf oder wie man sich gegen (rechtswidrige) Datensammler wehrt. Dadurch können Teilnehmer wie Zuschauer die praktische Anwendung der DS-GVO spielerisch lernen.\n",
  "logo": null,
  "persons": [
    {
      "guid": "b75ccf8d-26e5-5954-a3e9-c2f0104c3b92",
      "name": "Alvar C.H. Freude",
      "public_name": "Alvar C.H. Freude",
      "avatar": "https://cfp.cccv.de/media/avatars/BHSBAY_4wpRxa0.jpg",
      "biography": "Alvar Freude ist Leiter der Abteilung für technisch-organisarischen Datenschutz, Datensicherheit und Internet-Recht beim Landesbeauftragten für den Datenschutz und die Informationsfreiheit Baden-Württemberg.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_b75ccf8d-26e5-5954-a3e9-c2f0104c3b92"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/die-groe-datenschutz-datenpannen-und-ds-gvo-show",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/FJWMWQ/"
}