{
  "guid": "64413d56-6f05-50a9-abe7-a40e5458f2fb",
  "code": "VNYBYP",
  "id": 644135,
  "date": "2025-12-27T15:45:00+01:00",
  "start": "15:45",
  "duration": "01:00",
  "room": "Stonewall IO (Saal Y 06)",
  "slug": "39c3-werde-teil-der-endof10-kampagne-hilf-menschen-beim",
  "title": "Werde Teil der Endof10 -Kampagne! Hilf Menschen beim Umstieg auf Linux [FLINTA* only]",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "Workshop",
  "abstract": "Aufgrund des Supportendes von Windows 10, zielt die endof10-Kampagne darauf ab, Unterstützungsnetzwerke aufzubauen, um Menschen beim Umstieg auf Linux zu unterstützen. \r\n\r\nAber wie können die betroffenen Menschen erreicht werden, die vielleicht noch nie von Linux gehört haben?",
  "description": "Mit Linux können Computer, die nicht die Hardware - Voraussetzungen für Windows 11 erfüllen, noch lange sicher weiter betrieben werden. In einer kurzen Einführung von ca. 20 Minuten, möchte ich meinen Weg beschreiben, wie ich mich immer mehr in der Endof10-Kampagne engagiert habe, obwohl ich keine Linux-Expertin bin.\n\nIch möchte meine Erfahrungen mit dem Organisieren von Linux-Veranstaltungen in Berlin mit euch teilen und darüber sprechen, wie mein Netzwerk immer mehr gewachsen ist.\n\nFür den Umstieg auf Linux richte ich mich mit meinen Unterstützungsangeboten hauptsächlich an ältere, aufgeschlossene Menschen. Diese leben entweder in meiner Nachbarschaft oder sind in politischen Gruppen aktiv.\nEs gibt auch eine Kooperation mit dem Technikmuseum in Berlin, wo wir einmal im Monat ein Linux-Café anbieten.\n\nAnschließend möchte ich euch einladen, Ideen und Erfahrungen darüber auszutauschen, wie auch ihr Teil dieses globalen Graswurzel Unterstützungsnetzwerks werden könnt (falls ihr nicht schon dabei seid).\nWichtig ist dabei lediglich, dass euch das Thema wichtig ist (z.B wegen Vermeidung von Elektroschrott oder Unabhängigkeit von Microsoft). Jede Person hat etwas, das sie beitragen kann.\n\n\nFLINTA-Only.  Die Unterstützungsstrukturen sind bisher stark männlich geprägt. Über mehr Sichtbarkeit von FLINTA-Personen in diesem Bereich würde ich mich freuen.\n",
  "logo": null,
  "persons": [
    {
      "guid": "8b1554a7-c8da-547b-b4e6-b03138e36416",
      "name": "Bettina Louis",
      "public_name": "Bettina Louis",
      "avatar": "https://cfp.cccv.de/media/avatars/RNUJTV_xdswJtP.jpeg",
      "biography": "Bettina Louis has been an engineer for energy and process technology for 20 years and a teacher at a technical school for almost as long. Now retired, Bettina is dedicated to support the End Of 10 campaign by organizing install events in Berlin.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_8b1554a7-c8da-547b-b4e6-b03138e36416"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/werde-teil-der-endof10-kampagne-hilf-menschen-beim",
  "links": [],
  "origin_url": "https://pretalx.c3voc.de/39c3-haecksen-workshops-2025/talk/VNYBYP/",
  "feedback_url": "https://pretalx.c3voc.de/39c3-haecksen-workshops-2025/talk/VNYBYP/feedback/"
}