{
  "guid": "678b899b-7d32-56e3-9d1d-7f2208cfe2d7",
  "code": "GMWAPR",
  "id": 1641,
  "date": "2025-12-29T12:50:00+01:00",
  "start": "12:50",
  "duration": "00:40",
  "room": "Fuse",
  "slug": "39c3-be-modded-exploring-and-hacking-the-vital-bracelet-ecosystem",
  "title": "BE Modded: Exploring and hacking the Vital Bracelet ecosystem",
  "subtitle": null,
  "language": "en",
  "track": "Hardware",
  "type": "Talk",
  "abstract": "The Vital Bracelet series is an ecosystem of interactive fitness toys, content on memory chips, and apps that talk via NFC. In this talk, we'll explore the hardware and software of the series, from its obscure CPU architecture, to how it interacts with the outside world, from dumping OTP ROMs and breaking security, to making custom firmware.",
  "description": "The Vital Bracelet series, active from 2021 to 2024, was a line of toys that revolved around a number of fitness bracelets that encouraged exercise by raising characters from the Digimon series, and expanding into tokusatsu and popular anime characters later. Think of it as Tamagotchi, but nurturing through exercise instead of button presses.\n\nIn this presentation, we'll look at the different parts of this series' ecosystem, how they work, and the different ways to circumvent various security measures and customize the devices' behavior.\n\nWe start by looking at the first Vital Bracelet, with a quick introduction to hardware reverse engineering and how to dump firmware out of flash. Following that, we will take a look at the microcontroller used in the devices, and its obscure instruction set architecture. This will lead into an exploration of how to reverse engineer code when you are missing a significant portion of it, and how the embedded ROM was dumped. After this, we will look at the DRM applied to content, and how it was circumvented. Next, the device's NFC capabilities will be explored.\n\nWith the release of the Vital Bracelet BE, which introduced upgradable firmware, came new challenges and opportunities. We will take a look at the new content format and additional DRM measures it incorporated, plus how the device's bootloader was dumped despite its signature verification scheme.\n\nFinally, we will take a look at the process for modding the various Vital Bracelet releases, and some techniques to use while writing patches.\n\nThe material in this talk can be applied beyond just the Vital Bracelet series, and can be useful if you want to explore other electronic toys, or just hardware reverse engineering in general.\n",
  "logo": null,
  "persons": [
    {
      "guid": "79d61baa-e554-58b5-87a4-bb8e158788ae",
      "name": "cyanic",
      "public_name": "cyanic",
      "avatar": null,
      "biography": "Web developer by day, toy hacking by night. I've reverse engineered everything from Tamagotchis to mini game consoles, and love breaking custom DRM schemes on those devices.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_79d61baa-e554-58b5-87a4-bb8e158788ae"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/be-modded-exploring-and-hacking-the-vital-bracelet-ecosystem",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/GMWAPR/"
}