{
  "guid": "6998ed32-bb30-44df-af58-4b31dd9e7788",
  "code": null,
  "id": 699832,
  "date": "2025-12-29T18:30:00+01:00",
  "start": "18:30",
  "duration": "01:20",
  "room": "SoS Lecture E",
  "slug": "39c3-alles-smart-und-save-oder-nur-schall-und-rauc_gz4c",
  "title": "Alles smart und sicher? Oder nur Schall und Rauch? Zu den Datenspuren smarter Rauchmelder.",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "other",
  "abstract": "",
  "description": "‘New smoke detectors spy on tenants – and they have to pay for it’ was the headline in Stern magazine on 5 November 2024. The ‘smart’ smoke detectors referred to in the article have sensors that can detect fires and also measure ‘personal climate data’, transmitting it wirelessly [2, 3]. Consumer advocates have warned of infringements on personal rights [4, 5], and the topic has also sparked heated discussions within the community [6]. However, Techem claims that neither landlords nor they can determine which rooms someone is currently in. It is also not possible to track whether people are leaving the apartment or coming home” [3]. [3].\n\nWorkshop schedule:\nIn about 10 to 15 minutes, we will introduce the topic of simple sensor data in the smart home. We will present examples of simple sensors from our research and explain how they were created using our sensor kit [7–9].\n\n\nThe second part is a joint 'data guessing game'. We will examine selected data traces that could have been generated by smart smoke detectors, such as the 'Multisensor Plus', and similar devices*, and attempt to collectively analyse the data and classify it.\n\nThe final 20–25 minutes of the workshop will be reserved for reflection.\nHow meaningful is simple sensor data from the home?\nWhat impact can this sensor data have on privacy?\nHow should we deal with it?\n\n[1] https://www.stern.de/wirtschaft/immobilien/vonovia-skandal--neue-rauchmelder-spionieren-mieter-aus—35199846.html, accessed 9 July 2025.\n[2] https://www.vonovia.de/weitere-angebote/multisensor-plus – accessed 16 July 2025.\n[3] https://www.techem.com/de/de/geraete/multisensorplus-datenschutz — accessed 24 October 2025.\n[4] https://www.zeit.de/digital/datenschutz/2024-10/rauchmelder-vonovia-mieter-datenschutz-smart – accessed 16 July 2025.\n[5] https://www.swr.de/swraktuell/baden-wuerttemberg/ulm/mieter-wehren-sich-gegen-teure-rauchmelder-von-vonovia-100.html – accessed 16 July 2025.\n[6] https://chaos.social/@evawolfangel/113357161708038023 – accessed 24 October 2025.\n[7] https://doi.org/10.1109/CIVEMSA53371.2022.9853698\n\n[8] https://doi.org/10.18420/muc2024-mci-ws17-153\n[9] https://doi.org/10.18420/inf2024_65\n\n* Average hourly temperature and humidity values per room (according to [3]).\n\nAbout us:\n\nKarola: I combine social, educational and technical perspectives, with a particular interest in hacking, the Internet of Things and digital education issues in the context of privacy and AI. Karola is active in the Chaos Computer Club Chemnitz.\n\nAlbrecht: I develop, research and teach at the intersection of human-computer interaction and the Internet of Things. I focus on smart connected objects in everyday life and how people interact with them. I also consider the impact this has on their privacy.\n\nSimplications: Simplications researches the implications of supposedly simple sensor data in the home. It is a joint project of Chemnitz University of Technology, Anhalt University of Applied Sciences and the Saxony Consumer Advice Centre, as part of the programme 'Privacy Platform: Supporting citizens in exercising their fundamental right to informational self-determination”. Simplications is funded by the Federal Ministry of Research, Technology, and Space (FKZ 16KIS1868K).\nhttps://simplications.tucmi.de\n\nThe workshop will be held mostly in German.\n",
  "logo": null,
  "persons": [
    {
      "guid": "ebeed6e7-50bc-4f16-98f3-202cac078e88",
      "name": "Albrecht",
      "public_name": "Albrecht",
      "avatar": null,
      "biography": null,
      "url": "https://events.ccc.de/congress/2025/hub/user/albrecht"
    },
    {
      "guid": "67bfe6d8-8d03-479b-835a-ae08388f435c",
      "name": "zazakalina (sie/she)",
      "public_name": "zazakalina (sie/she)",
      "avatar": null,
      "biography": "Nerdy by nature. I hack technology and everyday disabilities. [#WheelScientist](https://events.ccc.de/congress/2025/hub/tag/WheelScientist) in the [#Simplications](https://events.ccc.de/congress/2025/hub/tag/Simplications) team at tucmi.\nVolunteer work at [#Computertruhe](https://events.ccc.de/congress/2025/hub/tag/Computertruhe) in Chemnitz and at the Chaos Treff Chemnitz. I am fascinated by bees, beavers, unicorns, squirrels, worms, the Internet of Things, AI, GDR technology, typewriters, and everything that buzzes in between. Wheelchair user since autumn 2024.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/zazakalina"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/alles-smart-und-save-oder-nur-schall-und-rauc_gz4c",
  "links": []
}