{
  "guid": "6a645194-deb6-5e96-b8ce-bb18774f1f14",
  "code": "TK8TUQ",
  "id": 1558,
  "logo": null,
  "date": "2025-12-27T12:50:00+01:00",
  "start": "12:50",
  "duration": "00:40",
  "room": "Ground",
  "slug": "39c3-1558-neuroexploitation-by-design-wie-algorithmen-in-glucksspielprodukten-sich-wirkweisen-des-reinforcement-learning-und-dopaminergen-belohnungssystems-zunutze-machen",
  "url": "https://cfp.cccv.de/39c3/talk/TK8TUQ/",
  "title": "Neuroexploitation by Design: Wie Algorithmen in Glücksspielprodukten sich Wirkweisen des Reinforcement Learning und dopaminergen Belohnungssystems zunutze machen",
  "subtitle": "",
  "track": "Science",
  "type": "Talk",
  "language": "de",
  "abstract": "Die Legalisierung des Online-Glücksspiels in Deutschland im Jahr 2021 und die zunehmende Normalisierung von Glücksspiel und Sportwetten in den Medien haben ein Umfeld geschaffen, in welchem Glücksspielprodukte leichter zugänglich und gesellschaftlich stärker akzeptiert sind als je zuvor. Diese weit verbreitete Exposition birgt erhebliche Risiken für vulnerable Personen, insbesondere da die Grenzen zwischen Spielen und Glücksspiel zunehmend verwischen. Seit einiger Zeit ist beispielsweise ein deutlicher Anstieg von Spielen zu beobachten, die Glücksspiel-ähnliche Items wie Loot-Boxen beinhalten. Komplexe Designmerkmale in elektronischen Glücksspielprodukten, z.B. Glücksspielautomaten und Online-Slots, sind gezielt darauf ausgerichtet, Individuen zu verlängerten Spielsitzungen zu motivieren, um den Umsatz zu maximieren. Während Glücksspiel für viele Menschen eine Form der Unterhaltung darstellt, kann das Spielverhalten bei manchen eskalieren und schwerwiegende Folgen für das Leben der Betroffenen haben. Dieser Vortrag wird sowohl offene als auch verdeckte Mechanismen in Glücksspielprodukten und Loot Boxen beleuchten und aufzeigen, weshalb diese Merkmale das Suchtpotenzial fördern können. Hierbei spielen Mechanismen des sogenannten Verstärkungslernens (engl. Reinforcement Learning) eine Rolle, die das menschliche Belohnungssystem aktivieren, also dopaminerge Bahnen, welche an der Vorhersage von Belohnungen beteiligt sind. Besonderes Augenmerk liegt auf dem Reinforcement-Learning, einem Framework zur Modellierung von Lernen durch belohnungsbasiertes Feedback, welches sowohl in der Psychologie zur Beschreibung menschlichen Lernens und Entscheidungsverhaltens als auch zur Optimierung von Machine-Learning-Algorithmen eingesetzt wird. Im Vortrag werden auch Ergebnisse aus eigener Forschung am Labor der Universität zu Köln zu Mechanismen des Glücksspiels sowie Lern- und Entscheidungsprozessen und der Rolle von Dopamin vorgestellt. Abschließend werden die potenziellen Schäden für Individuen und die Gesellschaft erläutert, mit dem Ziel, das Bewusstsein hierfür zu schärfen und die Notwendigkeit von Regulation sowie verantwortungsbewussten Designpraktiken zu diskutieren.",
  "description": "In diesem Vortrag wird beleuchtet, wie moderne Glücksspielprodukte und glücksspielähnliche Spielmechaniken, etwa Lootboxen, gezielt psychologische und neurobiologische Lernprozesse ausnutzen, um Umsatz durch längeres Spielen und stärkere Interaktion zu generieren. Im Fokus stehen dabei Mechanismen des Verstärkungslernens (Reinforcement Learning) und deren Zusammenspiel mit dem dopaminergen Belohnungssystem. Anhand aktueller Forschungsergebnisse werden offene und verdeckte Designstrategien vorgestellt, die das Suchtpotenzial von Glücksspielen erhöhen können. Ziel des Vortrags ist es, ein wissenschaftlich fundiertes Verständnis dieser Dynamiken zu vermitteln, Risiken für Individuen und Gesellschaft aufzuzeigen und die Notwendigkeit von Regulierung und verantwortungsvollem Produktdesign zu diskutieren.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "PJHWT8",
      "name": "Elke Smith",
      "avatar": null,
      "biography": "Elke Smith ist Psychologin und Neurowissenschaftlerin mit einem interdisziplinären Hintergrund in Informationsverarbeitung und IT. Sie forscht an der Universität zu Köln zu menschlichen Entscheidungs- und Lernprozessen, wobei ihr besonderer Fokus auf der Rolle von Dopamin liegt. Dabei nutzt sie kognitive Modellierung, psychophysiologische Methoden sowie Ansätze aus maschineller Sprachverarbeitung und Machine Learning, um kognitive Mechanismen und deren Auswirkungen auf Verhalten besser zu verstehen.",
      "public_name": "Elke Smith",
      "guid": "68ff7ac7-61b7-5cbb-a675-641d511d9663",
      "url": "https://cfp.cccv.de/39c3/speaker/PJHWT8/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/TK8TUQ/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/TK8TUQ/",
  "attachments": []
}