{
  "guid": "6a747cc1-1320-5027-b7f9-050a6f3b2134",
  "code": "3GESDB",
  "id": 1458,
  "logo": null,
  "date": "2025-12-28T21:05:00+01:00",
  "start": "21:05",
  "duration": "00:40",
  "room": "One",
  "slug": "39c3-1458-verlorene-domains-offene-turen-was-alte-behordendomains-verraten",
  "url": "https://cfp.cccv.de/39c3/talk/3GESDB/",
  "title": "Verlorene Domains, offene Türen - Was alte Behördendomains verraten",
  "subtitle": "",
  "track": "Security",
  "type": "Talk",
  "language": "de",
  "abstract": "Was passiert, wenn staatliche Domains auslaufen - und plötzlich jemand anderes sie besitzt?\r\nIn diesem Vortrag wird berichtet, wie mehrere ehemals offizielle, aber unregistrierte Domains deutscher Bundesministerien und Behörden erworben werden konnten - und welche Datenströme dadurch sichtbar wurden. Über Monate hinweg konnten so DNS-Anfragen aus Netzen des Bundes empfangen werden - ein erhebliches Sicherheitsrisiko. Unter anderem da es so möglich war Accounts zu übernehmen, Validierungen von E-Mailsignaturen zu manipulieren, Anfrage umzuleiten und im Extremfall Code auf Systemen auszuführen.\r\n(Keine sensiblen Daten werden veröffentlicht; der Fokus liegt auf Forschung, Aufklärung und verantwortungsvollem Umgang mit den Ergebnissen.)",
  "description": "Im Rahmen der Untersuchung zeigten sich nicht nur Fehlkonfigurationen, sondern auch Phänomene wie Bitsquatting und Typoquatting innerhalb der Verwaltungsnetze. Mit dem Betrieb eines DNS-Servers und dem Erwerb von bund.ee (naher Typosquatting/Bitquatting zu bund.de) konnten u.a. zahlreiche DNS-Anfragen von Servern des Bundesministerium des Innern (BMI) und weiterer Einrichtungen des Bundes empfangen werden.\r\n\r\nDer Vortrag beleuchtet die technischen und organisatorischen Schwachstellen, die hinter solchen Vorgängen stehen - und zeigt, wie DNS-Details Einblicke in die IT-Infrastruktur des Staates ermöglichen können. Abgerundet wird das Ganze durch praktische Beispiele, Datenanalysen und Empfehlungen, wie sich ähnliche Vorfälle künftig vermeiden lassen.\r\n\r\nIn anderen Ländern sind gov-Domains als TLDs längst üblich (bspw. gov.uk) - in Deutschland ist bund.de oder gov.de allerdings nicht so verbreitet wie man glaubt, unter anderem da Bundesministerien eigene Domains nutzen oder nach Regierungsbildung umbenannt werden.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "S9FH37",
      "name": "Tim Philipp Schäfers (TPS)",
      "avatar": null,
      "biography": "Protecting what matters in a connected world\r\nMostly hacker. lecturer. speaker. writer.\r\nGründer & Geschäftsführer von Mint Secure ( https://mint-secure.de/ )",
      "public_name": "Tim Philipp Schäfers (TPS)",
      "guid": "b3feb196-89c8-534e-9bee-6af280431291",
      "url": "https://cfp.cccv.de/39c3/speaker/S9FH37/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/3GESDB/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/3GESDB/",
  "attachments": []
}