{
  "guid": "6be68f26-58b4-49ae-bf28-1558fe5cd90b",
  "code": null,
  "id": 668265,
  "date": "2025-12-29T21:00:00+01:00",
  "start": "21:00",
  "duration": "00:30",
  "room": "House of Tea",
  "slug": "39c3-the-spoon-game-39c3-special-edition-workshop-_xf7m",
  "title": "The Spoon Game - 39C3 Special Edition workshop (#3)",
  "subtitle": null,
  "language": "en",
  "track": null,
  "type": "other",
  "abstract": "\"The Spoon Game\" is an interactive workshop that challenges participants through a journey inspired by the CCC to enlighten you on a curious notion that will change your perspective on spoons for sure!",
  "description": "Can you join the choir that sings only in modem beeps? Will you win the speed-typing competition on a reverse Dvorak keyboard? Will you be able to take part in the most chaotic but functional wiring competition?\n\nSeemingly trivial questions, but with surprising implications!\n\nTo understand what connects these mysterious situations, come and discover \"The Spoon Game\", designed and hosted by Atypha. A workshop around a fascinating game that will change the way you see spoons forever!\n\n⚠️ 7 people/session maximum to ensure a good workshop. Book you slot now: [https://urlr.me/t3DYx6](https://urlr.me/t3DYx6)\n\n[#Inclusion](https://events.ccc.de/congress/2025/hub/tag/Inclusion) [#accessibility](https://events.ccc.de/congress/2025/hub/tag/accessibility)\n",
  "logo": "https://events.ccc.de/congress/2025/hub/https://usercontent.events.ccc.de/congress/2025/hub/usercontent/e/6dc7a360fa44/Banner-3-The-Spoon-Game.png",
  "persons": [
    {
      "guid": "fa6feda2-ddb1-4d0f-893f-05d384ae4869",
      "name": "Atypha (She)",
      "public_name": "Atypha (She)",
      "avatar": null,
      "biography": "Atypha is a creative multi-tasker. Designer, Creative Director, Maker, she loves finding creative solutions by placing inclusive design at the heart of her approach.\n\nSince 2017, she has been creating projects to raise awareness around various themes linked to inclusivity / diversity / accessibility, including a web documentary on visual art and blindness in 2017, a project on inclusion and accessibility at concerts and festivals in 2019, and a serious game on chronic diseases in early 2024.\n\nAlways seeking to learn, understand and, above all, share her knowledge, she created her podcast, **[Inclusive Design Quest](https://www.atypha.com/inclusive-design-quest)**, in November 2024 (in French, with one episode in English so far).\n\nFor 39c3, she organises \"The Spoon Game\", an interactive workshop that challenges participants through a journey inspired by the C3 to enlighten you on a curious notion that will change your perspective on spoons for sure!  \n**🎟️ Book your (free) slot here: [https://urlr.me/t3DYx6](https://urlr.me/t3DYx6)**\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/atypha"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/the-spoon-game-39c3-special-edition-workshop-_xf7m",
  "links": []
}