{
  "guid": "718be695-c840-5eed-9c67-b8d5089f8042",
  "code": "UXDELZ",
  "id": 2257,
  "date": "2025-12-27T14:45:00+01:00",
  "start": "14:45",
  "duration": "00:40",
  "room": "Fuse",
  "slug": "39c3-redscout42-zur-digitalen-wohnungsfrage",
  "title": "RedScout42 – Zur digitalen Wohnungsfrage",
  "subtitle": null,
  "language": "de",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "abstract": "Wer heutzutage eine Wohnung sucht, kommt kaum noch darum herum, sich einen Account bei Immoscout24 & Co. zu erstellen. Diese „Platform Real Estate“ sind eine besondere Art der „Walled Gardens“, die ihr Geschäftsmodell auf die sich immer weiter verschärfende Wohnungskrise ausgerichtet haben. Und das ist äußerst profitabel für die Besitzer dieser Strukturen der Daseinsvorsorge: Im September 2025 stieg Scout24 in den DAX auf und reiht sich damit in Unternehmen wie BMW, Rheinmetall und SAP ein.",
  "description": "In unserem Vortrag zeigen wir, wie Immoscout & Co. mit einem ausgeklügelten technischen System Monopolprofite generiert, die Mieten in die Höhe treibt und ein Vermieterparadies aufgebaut hat, das die Mieter:innen in den Wahnsinn treibt.\n\nWir bleiben aber nicht bei der Kritik stehen, sondern zeigen, wie durch die Vergesellschaftung von Plattformen der Daseinsvorsorge ein Werkzeug entstehen kann, das den Mittellosen auf dem Wohnungsmarkt hilft. Vermieter in ihre Schranken zu weisen und Markttransparenz für alle statt nur für die Besitzenden zu schaffen.\n",
  "logo": null,
  "persons": [
    {
      "guid": "6c739ba3-fa1c-5ba6-b6f7-770f9b13e7ab",
      "name": "Sandra",
      "public_name": "Sandra",
      "avatar": null,
      "biography": "Sandra forscht zur Politischen Ökonomie der KI und technologischem Wandel, ist Mitglied beim Zentrum Emanzipatorische Technikforschung und Redakteurin der PROKLA. Zeitschrift für kritische Sozialwissenschaft.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_6c739ba3-fa1c-5ba6-b6f7-770f9b13e7ab"
    },
    {
      "guid": "49c8949a-916a-5c12-8630-785e2f625512",
      "name": "Leonard",
      "public_name": "Leonard",
      "avatar": null,
      "biography": "Ist aktiv bei **Deutsche Wohnen & Co enteignen** und veranstaltet den Developer Meetup **techfrombelow**. Beruflich arbeitet er als Produktmanager bei einer Non-Profit.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_49c8949a-916a-5c12-8630-785e2f625512"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/redscout42-zur-digitalen-wohnungsfrage",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/UXDELZ/"
}