{
  "guid": "7557e54c-89e9-530d-aafb-8736570661d4",
  "code": "XN3U8L",
  "id": 2067,
  "logo": null,
  "date": "2025-12-28T19:15:00+01:00",
  "start": "19:15",
  "duration": "00:40",
  "room": "Zero",
  "slug": "39c3-2067-amtsgeheimnis-raus-datenhalde-rein-was-die-informationsfreiheit-in-osterreich-bringt",
  "url": "https://cfp.cccv.de/39c3/talk/XN3U8L/",
  "title": "Amtsgeheimnis raus, Datenhalde rein: was die Informationsfreiheit in Österreich bringt",
  "subtitle": "",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "language": "de",
  "abstract": "Jahrelang war die staatliche Intransparenz in Österreich nur eine Punchline in den Congress-Talks von Frag Den Staat. Damit könnte jetzt Schluss sein: seit heuer haben Bürger:innen endlich ein Recht, Dokumente einzusehen und ein Informationsfreiheitsgesetz. Wir zeigen, was Deutschland aus der über ein Jahrzehnt andauernden Kampagne für die Abschaffung des Amtsgeheimnisses lernen kann, wofür uns die Nachbarländer beneiden werden und wofür sich Bayern besonders schämen sollte.",
  "description": "Die Kampagne – wie aus \"binnen zwei Wochen\" mehr als elf Jahre wurden\r\nDie Strategien – die man übernehmen kann\r\nDer Vergleich – wie ist Österreichische IFG im Vergleich zum Deutschen, und ist das der richtige\r\nDie (besten) Preisträger – aus mehr als zehn Jahren des Schmähpreises \"Mauer des Schweigens\"\r\nDie Datenhalde – mit Aufruf, was aus dem Datenberg zu machen",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "VD8B7V",
      "name": "Markus (fin) Hametner",
      "avatar": "https://cfp.cccv.de/media/avatars/VD8B7V_7ZT6rwm.jpeg",
      "biography": "Markus (fin) Hametner ist freier Datenjournalist und ehrenamtlich als Vorstandsmitglied des Forum Informationsfreiheit tätig. Seine Rechtsstreite führten erstmals zur Anerkennung eines Rechtes auf Information von „public watchdogs“ durch österreichische Höchstgerichte. Das Forum Informationsfreiheit ist Österreichs führende NGO für Informationsrechte von Bürgerinnen und Bürgern. Es betreibt unter Anderem das Anfrage-Portal FragDenStaat.at.",
      "public_name": "Markus (fin) Hametner",
      "guid": "9957178a-6e8a-51b0-bf8a-700fba0de5f9",
      "url": "https://cfp.cccv.de/39c3/speaker/VD8B7V/"
    },
    {
      "code": "DJVBVP",
      "name": "Erwin Ernst \"eest9\" Steinhammer",
      "avatar": null,
      "biography": "Netzpolitischer Aktivist aus Österreich. Aktiv beim Chaos Computer Club Wien und Forum Informtionsfreiheit. Setzt sich seit Jahren vor allem für die Informationsfreiheit, föderierte soziale Netze und Community-Building ein.",
      "public_name": "Erwin Ernst \"eest9\" Steinhammer",
      "guid": "54df8a2c-ddf5-5eaf-a0ba-3b27fd1d6695",
      "url": "https://cfp.cccv.de/39c3/speaker/DJVBVP/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/XN3U8L/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/XN3U8L/",
  "attachments": []
}