{
  "guid": "7c12c5be-5414-5673-a856-697a3889f824",
  "code": "X8ZZBV",
  "id": 1979,
  "logo": "https://cfp.cccv.de/media/39c3/submissions/X8ZZBV/Screenshot_2025-10-24_at_06.46.40_Q2EZeZ7.png",
  "date": "2025-12-27T11:00:00+01:00",
  "start": "11:00",
  "duration": "00:40",
  "room": "Ground",
  "slug": "39c3-1979-the-art-of-text-rendering",
  "url": "https://cfp.cccv.de/39c3/talk/X8ZZBV/",
  "title": "The art of text (rendering)",
  "subtitle": "",
  "track": "Art & Beauty",
  "type": "Talk",
  "language": "en",
  "abstract": "Typography is the art of arranging type to make written language legible, readable, and appealing when displayed. However, for the neophyte, typography is mostly apprehended as the juxtaposition of characters displayed on the screen while for the expert, typography means typeface, scripts, unicode, glyphs, ascender, descender, tracking, hinting, kerning, shaping, weigth, slant, etc. Typography is actually much more than the mere rendering of glyphs and involves many different concepts. If glyph rendering is an important part of the rendering pipeline, it is nonetheless important to have a basic understanding of typography or there’s a known risk at rendering garbage on screen, as it has been seen many times in games, software and operating systems.",
  "description": "Text is everywhere in our modern digital life and yet, no one really pay attention to how it is rendered on a screen. Maybe this is a sign that problem has been solved. But it isn't. A few people are still looking at the best way to display text on any devices & any languages. This talk is based on a lesson I gave at SIGGRAPH  a few years ago (https://www.slideshare.net/slideshow/siggraph-2018-digital-typography/110385070) to explain rendering techniques and concepts.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "WYBKA3",
      "name": "Nicolas Rougier",
      "avatar": "https://cfp.cccv.de/media/avatars/WYBKA3_oDongQG.png",
      "biography": "I’m a senior researcher in computational cognitive neuroscience at Inria and the Institute of Neurodegenerative Diseases (Bordeaux, France). I’m investigating decision making, learning and cognition using computational models of the brain and distributed, numerical and adaptive computing, a.k.a. artificial neural networks and machine learning. My research aims to irrigate the fields of philosophy with regard to the mind-body problem, medicine to account for the normal and pathological functioning of the brain and the digital sciences to offer alternative computing paradigms. Beside neuroscience and philosophy, I’m also interested in open and reproducible science, scientific visualization, computer graphics",
      "public_name": "Nicolas Rougier",
      "guid": "1003d587-47d0-515c-ba6f-1b0a5b310060",
      "url": "https://cfp.cccv.de/39c3/speaker/WYBKA3/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/X8ZZBV/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/X8ZZBV/",
  "attachments": []
}