{
  "guid": "7cca9076-3454-5229-b1f4-9069def42bfd",
  "code": "7SWYYC",
  "id": 2225,
  "date": "2025-12-27T21:45:00+01:00",
  "start": "21:45",
  "duration": "01:00",
  "room": "Ground",
  "slug": "39c3-radikalisierungspipeline-esoterik-von-eso-nazis-de",
  "title": "Doomsday-Porn, Schäferhunde und die „niedliche Abschiebung“ von nebenan: Wie autoritäre Akteure KI-generierte Inhalte für Social Media nutzen",
  "subtitle": null,
  "language": "de",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "abstract": "Der amtierende US-Präsident postet ein Video, in dem er Demonstrierende aus einem Kampfjet heraus mit Fäkalien bewirft und das Weiße Haus zelebriert den „Star Wars Day“ mit einem pompösen Trump-Bild mit Lichtschwert. Accounts von AfD-Sympathisanten posten KI-Kitsch einer vermeintlich heilen Welt voller blonder Kinder und Frauen im Dirndl. Ist das lediglich eine geschmackliche Entgleisung oder steckt da mehr dahinter?",
  "description": "KI-generierter Content ist aus der Kommunikationsstrategie autoritärer Akteure nicht mehr wegzudenken. Social Media wird derzeit mit rechtem KI-Slop geflutet, in dem wahlweise die Welt dank Migration kurz vor dem Abgrund steht oder blonde, weiße Familien fröhlich Fahnen schwenken. Im politischen Vorfeld der extremen Rechten werden zudem immer häufiger mal mehr oder weniger offensichtliche Deepfakes geteilt, die auf die jeweilige politische Botschaft einzahlen. Das reicht von KI-generierten Straßenumfragen über Ausschnitte aus Talksendungen, die nie stattgefunden haben, bis hin zu gänzlich KI-generierten Influencerinnen (natürlich blond).  Was macht das mit politischen Debatten? Und wie sollten wir als Gesellschaft damit umgehen?\n",
  "logo": null,
  "persons": [
    {
      "guid": "a8991e85-b553-5ed0-bc66-c219d3d8ba2f",
      "name": "Katharina Nocun",
      "public_name": "Katharina Nocun",
      "avatar": "https://cfp.cccv.de/media/avatars/HR8WJ8_r7IGrTs.jpg",
      "biography": "Katharina Nocun ist Publizistin und Politik- und Wirtschaftswissenschaftlerin. In ihrer Arbeit setzt sie sich vor allem mit dem Spannungsfeld Digitalisierung und Demokratie auseinander. Ihr Podcast Denkangebot war 2020 für den Grimme Online Award nominiert. Ihr erstes Buch \"Die Daten, die ich rief\" (2018) behandelt das Thema Digitalisierung und Demokratie. 2020 erschien der Bestseller \"Fake Facts – Wie Verschwörungstheorien unser Denken bestimmen\" (gemeinsam wie alle nachfolgenden mit Pia Lamberty). 2021 folgte \"True Facts – was gegen Verschwörungserzählungen wirklich hilft\" und 2022 \"Gefährlicher Glaube – Die radikale Gedankenwelt der Esoterik\". Für ihre publizistische Tätigkeit wurde Nocun 2017 mit dem Marburger Leuchtfeuer und 2023 mit dem Madsack Award ausgezeichnet.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_a8991e85-b553-5ed0-bc66-c219d3d8ba2f"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/radikalisierungspipeline-esoterik-von-eso-nazis-de",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/7SWYYC/"
}