{
  "guid": "7cfa48af-7421-5a63-9e8c-24360f0c2132",
  "code": null,
  "id": 100436,
  "date": "2025-12-29T12:00:00+01:00",
  "start": "12:00",
  "duration": "00:50",
  "room": "Bits&Bäume Workshop Area",
  "slug": "39c3-zwischen-assistenz-und-ki-selbst-kontrolle-generat",
  "title": "Zwischen Assistenz und KI-(Selbst)-Kontrolle: Generative KI im Berufsfeld Softwareentwicklung",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "Workshop 50 Minutes",
  "abstract": "Wie verändert generative KI den Beruf des Programmierens, und was passiert, wenn Entwickler:innen KI-Systeme nicht nur als Werkzeug, sondern als Orientierungssystem, Feedbackgeber oder Management-Ersatz nutzen? Unser Vortrag beleuchtet diese Frage anhand einer sozialwissenschaftlichen Analyse von Reddit-Diskussionen, in denen Softwareentwickler:innen offen über ihre Erfahrungen mit generativer KI im Arbeitsalltag sprechen. Wir zeigen aus unseren Erhebungen: Generative KI wird nicht nur als Code-Assistent, sondern zunehmend als strukturierende Instanz genutzt; eine selbstgewählte Feedbackinstanz, die auf der einen Seite Autonomie verspricht und andererseits zugleich neue Abhängigkeiten schafft. In unserem Workshop  wollen wir gemeinsam darüber sprechen, was diese Gegensätze für uns in der Praxis bedeuten.",
  "description": "Die Softwareentwicklung gilt als Berufsfeld mit hohem Maß an Autonomie, kollaborativem Wissensaustausch und einer stark community-getriebenen Lernkultur. Mit dem Einzug generativer KI verändern sich diese Strukturen grundlegend. Der spontane Austausch unter Kolleg:innen oder auf Foren wie Stack Overflow wird zunehmend durch den Dialog mit dem ChatBot ersetzt. In unserem Vortrag möchten wir die Konsequenzen daraus beleuchten. Zuerst stellen wir drei zentrale Ergebnisse unserer empirischen Forschung vor und werden diese anschließend analysieren und vor dem Hintergrund arbeitssoziologischer Annahmen diskutieren.\n\nUnsere Studie basiert auf einer digital-ethnografischen Analyse von Diskussionsbeiträgen auf Reddit, in denen sich Softwareentwickler:innen offen über ihre Erfahrungen mit generativer KI austauschen. Daraus können wir zeigen, dass Entwickler:innen KI-Systeme in drei Rollen verorten:\n\nKI als Werkzeug:\nDie KI wird gezielt eingesetzt, um klar abgegrenzte Aufgaben zu erledigen. Ziel und Vorgehen stehen fest, die Kontrolle über Prozess und Ergebnis liegt vollständig bei dem Nutzenden.\n\n\nKI als Assistenz:\nDie KI unterstützt als dialogisches Gegenüber. Sie kann Ideen liefern und Alternativen vorschlagen, aber Auswahl, Bewertung und Einordnung der Inhalte bleiben beim Menschen.\n\n\nKI als Proxy-Management:\nDie Entwickler:in weist der KI bewusst eine leitende Rolle zu und überträgt ihr die Steuerung und Bewertung des eigenen Arbeitsprozesses.\n\nGerade in dieser letzten Form zeigt sich ein spannendes Phänomen: KI als Feedbackinstanz ohne soziale Interaktion. Kein Gatekeeping auf Stack Overflow, kein „Wie, das weißt du nicht?“, keine Unsicherheiten vor Kolleg:innen zugeben und keine endlosen Google-Suchen, die ins Leere führen. Stattdessen ein vermeintlich privater und immer verfügbarer SafeSpace, in dem Unwissenheit nicht offenbart oder verurteilt wird – und man immer eine Antwort bekommt. Viele beschreiben das als Gewinn an Autonomie. Andere berichten jedoch vom Gegenteil: Von wachsender Isolation, schleichendem Kompetenzverlust und einer neuen Form von Abhängigkeit.\nDiese Ambivalenz verstehen wir als Spannungsfeld zwischen technikvermittelter Selbstermächtigung und Kontrolle. Aus der Perspektive der Professionssoziologie – in Anlehnung an Andrew Abbotts The System of Professions (1988) – werden berufliche Zuständigkeiten („jurisdictions“) stets neu ausgehandelt. Dabei spielen technologische Entwicklungen eine zentrale Rolle, weil sie bestimmen, welches Wissen als Expertise gilt und wer es beanspruchen kann. Für die Zukunft der Softwareentwicklung bedeutet dies vielleicht: Weg vom kollektiven Wissensaustausch hin zu einer individualisierten Praxis.\n\nIn unserem Workshop möchten wir mit euch diese Dynamiken zwischen Autonomie und Abhängigkeit hinterfragen und diskutieren. Begegnet uns hier eine neue Form von KI-(Selbst)-Kontrolle, jenseits klassischer Hierarchien? Und welche Folgen bedeutet das für unser Selbstverständnis, Lernprozesse und die soziale Verankerung professioneller Programmierarbeit?\n",
  "logo": "https://pretalx.freifunktag.de/media/39c3-bub-workshops-2025/submissions/SJ3UFJ/dev_exp_QhO9FTQ.jpg",
  "persons": [
    {
      "guid": "cb3fbacd-ac2c-5ab8-97b8-d7b3f5a79933",
      "name": "Marlene Kulla",
      "public_name": "Marlene Kulla",
      "avatar": null,
      "biography": "Technik- und Arbeitssoziologin am Weizenbauminstitut\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_cb3fbacd-ac2c-5ab8-97b8-d7b3f5a79933"
    },
    {
      "guid": "de903f63-6cf1-5b25-8063-679758c4e8ef",
      "name": "Ann Katzinski",
      "public_name": "Ann Katzinski",
      "avatar": null,
      "biography": "Ich bin wissenschaftliche Mitarbeiterin am WZB und erforsche im Projekt „Generative KI in der Arbeitswelt“, wie Tools wie Cursor die Arbeit von Programmierer:innen transformieren – von neuen Chancen bis zu tiefgreifenden Umbrüchen. Als Sozialwissenschaftlerin möchte ich in Forschung und Praxis Themen auf den Punkt bringen, die unsere Zukunft gestalten. Wissenschaft raus aus dem Elfenbeinturm, hinein in den gesellschaftlichen Dialog.\n\nLasst uns also gemeinsam darüber sprechen, was generative KI für die Arbeitswelt, die Gesellschaft und nicht zuletzt für uns alle bedeutet – von Codezeilen bis zu großen Visionen.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_de903f63-6cf1-5b25-8063-679758c4e8ef"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/zwischen-assistenz-und-ki-selbst-kontrolle-generat",
  "links": [],
  "origin_url": "https://pretalx.freifunktag.de/39c3-bub-workshops-2025/talk/SJ3UFJ/",
  "do_not_record": true
}