{
  "guid": "7f6e6dff-5f85-5c03-8f07-373b3acce367",
  "code": "ZZZHYE",
  "id": 2123,
  "date": "2025-12-29T14:45:00+01:00",
  "start": "14:45",
  "duration": "01:00",
  "room": "Ground",
  "slug": "39c3-programmierte-kriegsverbrechen-uber-ki-systeme-im-kriegseinsatz-in-gaza-und-warum-it-fachleute-sich-dazu-auern-mussen",
  "title": "Programmierte Kriegsverbrechen? Über KI-Systeme im Kriegseinsatz in Gaza und warum IT-Fachleute sich dazu äußern müssen",
  "subtitle": null,
  "language": "de",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "abstract": "Die automatisierten Zielsysteme des israelischen Militärs zeigen gut, wie KI-baserte Kriegsautomatisierung aktuell aussieht, was daran falsch läuft und warum wir Techies uns einmischen müssen",
  "description": "Das Thema „KI in der Militärtechnik“ und die Beziehung zwischen Mensch und Maschine ist seit Jahrzehnten ein Thema in der Friedensbewegung, der Konfliktforschung, der Philosophie, den Sozialwissenschaften und den kritischen Data & Algorithm Studies. Doch in den letzten Jahren wurden Waffensysteme mit KI-Komponenten entwickelt und auch praktisch in bewaffneten Konflikten eingesetzt. Dabei reicht die Anwendung von Drohnensteuerung über optische Zielerfassung bis hin zur logistischen Zielauswahl. Am Beispiel KI-gestützter Zielwahlsysteme, die vom israelischen Militär seit Mai 2021 und insbesondere jetzt im Genozid in Gaza eingesetzt werden, können die aktuellen technischen Entwicklungen aufgezeigt und analysiert werden. Im Fokus dieses Talks stehen vier KI-unterstützte Systeme: Das System Gospel zur militärischen Bewertung von Gebäuden, das System Lavender zur militärischen Bewertung von Personen, das System Where's Daddy? zur Zeitplanung von Angriffen und ein experimentelles System auf Basis großer Sprachmodelle zur Erkennung militärisch relevanter Nachrichten in palästinensischen Kommunikationsdaten.\n\nAuf Basis der Aussagen von Whistleblower:innen des israelischen Militärs und Angestellten beteiligter Unternehmen wie Amazon, Google oder Microsoft sowie internen Dokumenten, die durch investigative Recherchen von mehreren internationalen Teams von Journalist:innen veröffentlicht wurden, können die Systeme und Designentscheidungen technisch detailliert beschrieben, kritisch analysiert sowie die militärischen und gesellschaftlichen Implikationen herausgearbeitet und diskutiert werden. Dabei entstehen auch Fragen bezüglich Verantwortungsverlagerung durch KI, Umgehung des Völkerrechts sowie die grundsätzliche Rolle von automatisierter Kriegsführung.\n\nAm Schluss geht der Vortrag noch auf die Verantwortung von IT-Fachleuten ein, die ja das Wissen und Verständnis dieser Systeme mitbringen und daher überhaupt erst problematisieren können, wenn Systeme erweiterte oder gänzlich andere Funktionen erfüllen, als öffentlich und politisch oft kommuniziert und diskutiert wird. Überlegungen zu Handlungsoptionen und Auswegen leiten zuletzt die Diskussion ein.\n",
  "logo": "https://cfp.cccv.de/media/39c3/submissions/ZZZHYE/ki-im-krieg-lavender-CC_BY-SA_Palestinia_5jrIfPt.jpg",
  "persons": [
    {
      "guid": "c2c27483-6215-5cac-b7c9-1474a2dbb02b",
      "name": "Rainer Rehak",
      "public_name": "Rainer Rehak",
      "avatar": "https://cfp.cccv.de/media/avatars/WI_Dach_Rehak_only_GTf2OQ0.jpg",
      "biography": "Rainer Rehak ist wissenschaftlicher Mitarbeiter am Weizenbaum-Institut für die vernetzte Gesellschaft, wissenschaftlicher Mitarbeiter am Wissenschaftszentrum Berlin für Sozialforschung (WZB), Ko-Vorsitz des Forums InformatikerInnen für Frieden und gesellschaftliche Verantwortung (FIfF) und promoviert aktuell an der TU Berlin zu systemischer IT-Sicherheit und gesellschaftlichem Datenschutz.\n\nEr studierte Informatik und Philosophie in Berlin und Hong Kong und beschäftigt sich seit über 15 Jahren mit den Implikationen der Computerisierung der Gesellschaft. Seine Forschungsfelder sind Technikfolgenabschätzung, staatliches Hacking, Informatik und Ethik, Technikfiktionen sowie die Implikationen und Grenzen von KI-Systemen.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_c2c27483-6215-5cac-b7c9-1474a2dbb02b"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/programmierte-kriegsverbrechen-uber-ki-systeme-im-kriegseinsatz-in-gaza-und-warum-it-fachleute-sich-dazu-auern-mussen",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/ZZZHYE/"
}