{
  "guid": "7fe75d23-5966-5dca-a736-e7664a475be3",
  "code": "JQUCQ7",
  "id": 2399,
  "logo": null,
  "date": "2025-12-29T11:00:00+01:00",
  "start": "11:00",
  "duration": "02:00",
  "room": "Zero",
  "slug": "39c3-2399-lightning-talks-tag-3",
  "url": "https://cfp.cccv.de/39c3/talk/JQUCQ7/",
  "title": "Lightning Talks - Tag 3",
  "subtitle": "",
  "track": "CCC & Community",
  "type": "Talk",
  "language": "de",
  "abstract": "Lightning Talks - Tag 3",
  "description": "Lightning Talks - Tag 3",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "NAYM8A",
      "name": "Bonnie",
      "avatar": "https://cfp.cccv.de/media/avatars/NAYM8A_XqdDXgI.png",
      "biography": "Bonnie Mehring has been politically active since 20 years now and has always believed in the chance to better the future for everybody. Technology and especially Free Software  has brought her into the Chaos. Since the past 12 years she has brought her political and technological interest's together.\r\nThrough Free Software, she has not only acquired extensive knowledge about computers and technology but has also forged connections with others. She thoroughly enjoys participating in various Free Software conferences and events, where she relishes the opportunity to connect with individuals from the Free Software community. It is of utmost importance for Bonnie that inclusive and welcoming Free Software communities are established, allowing everyone to engage and learn.",
      "public_name": "Bonnie",
      "guid": "5f7ecbd8-6f6f-573b-8519-242ab484d22e",
      "url": "https://cfp.cccv.de/39c3/speaker/NAYM8A/"
    },
    {
      "code": "UCNTY3",
      "name": "keldo",
      "avatar": null,
      "biography": "Keldo beschäftigt sich mit Nachhaltigkeit, mit speziellem Fokus auf IT. Er ist deshalb seit einigen Jahren bei Bits und Bäume und im Forum InformatikerInnen für Frieden und Gesellschaftliche Verantwortung aktiv.",
      "public_name": "keldo",
      "guid": "aacad21d-44ff-5b15-9c3a-6678c39e3c0f",
      "url": "https://cfp.cccv.de/39c3/speaker/UCNTY3/"
    },
    {
      "code": "DG3QQJ",
      "name": "Andi Bräu",
      "avatar": null,
      "biography": "Andi ist Softwareentwickler und DevOps-Spezialist aus Berlin mit einem besonderen Interesse an Datenschutz, Datensouveränität und Self-Hosting. Er engagiert sich seit vielen Jahren im Freifunk-Umfeld und ist als Vorstand des Fördervereins Freie Netzwerke aktiv. Außerdem organisiert er regelmäßig Veranstaltungen wie das Wireless Community Weekend oder das Battlemesh.",
      "public_name": "Andi Bräu",
      "guid": "f98532ec-f471-56df-848c-3cfd8c158f3c",
      "url": "https://cfp.cccv.de/39c3/speaker/DG3QQJ/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/JQUCQ7/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/JQUCQ7/",
  "attachments": []
}