{
  "guid": "8857a376-2018-4c0e-ab09-efc4684c8a81",
  "code": null,
  "id": 885737,
  "date": "2025-12-29T13:00:00+01:00",
  "start": "13:00",
  "duration": "02:30",
  "room": "Art & Play: Bus Stage",
  "slug": "39c3-pony-pracht-nina-bendix-igleses-water-to-voice-mee",
  "title": "Pony Pracht, Nina Bendix Igleses: »Water to Voice« (meet the artist)",
  "subtitle": null,
  "language": null,
  "track": null,
  "type": "other",
  "abstract": "„Water to Voice“ ist ein sich ständig weiterentwickelndes Werk, das aus dem Prozess des Klonens von Lisas Stimme entstanden ist. Der Fluss und die Bewegung des Wassers steuern und lösen die Stimme aus und schaffen so ein einzigartiges Zusammenspiel zwischen den beiden Elementen. Es fängt die Stimme mitten in ihrem Trainingsprozess ein – wie sie sich verändert, stolpert und neu interpretiert. Während sich das Wasser bewegt, formt und unterbricht es den Klang und verwandelt die Bewegung der Flüssigkeit in eine stimmliche Geste. Das Ergebnis ist weder rein menschlich noch rein künstlich, sondern etwas dazwischen – lebendig, instabil und sich ständig verändernd. „Water to Voice“ wird zu einem Dialog zwischen Natur und Technologie, einer fragilen Choreografie, in der die Stimme in Echtzeit lernt, ins Stocken gerät und sich weiterentwickelt.",
  "description": "»Water to Voice« is an evolving piece born from the process of cloning Lisa’s voice. The flow and movement of water control and trigger the voice, creating a unique interplay between the two elements. It captures the voice in the midst of its training—shifting, stumbling, reinterpreting itself. As the water moves, it shapes and disrupts the sound, transforming liquid motion into vocal gesture. What emerges is neither purely human nor purely artificial, but something in between—alive, unstable, and constantly transforming. »Water to Voice« becomes a dialogue between nature and technology, a fragile choreography in which the voice learns, falters, and evolves in real time.\n\n#### Artist Bio:\n\nThe duo Lisa L. Zwinzscher & Nina Bendix Igleses (Leipzig/Weimar) explores the boundaries of listening and voice in the digital realm. Emerging from Lisa L. Zwinzscher’s solo project Pony Pracht, which blends music with interactive, game-inspired visuals, her work expands to questions of identity and authenticity in the age of AI. As a singer, she has cloned her own voice, transforming it into a human-artificial live instrument.  Fascinated by the tactile, sonic and metaphorical qualities of water, Nina Bendix Igleses approaches listening as a multisensory practice of relating to the world, investigating interconnection within and between self and environment. Together, they engage with questions of identity, resonance, and transformation, creating sonic environments that explore what it means to be human.\n\n[ponypracht.com](https://ponypracht.com)\n\n[ninabendixigleses.com](https://ninabendixigleses.com)\n",
  "logo": null,
  "persons": [
    {
      "guid": "44636aa8-eb33-4548-8e70-007750e83ab8",
      "name": "Marty",
      "public_name": "Marty",
      "avatar": null,
      "biography": null,
      "url": "https://events.ccc.de/congress/2025/hub/user/marty"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/pony-pracht-nina-bendix-igleses-water-to-voice-mee",
  "links": []
}