{
  "guid": "8a09918c-9b59-53b2-ab8e-4f2cfdb460d5",
  "code": "SSWHEP",
  "id": 1798,
  "date": "2025-12-29T11:55:00+01:00",
  "start": "11:55",
  "duration": "00:40",
  "room": "Ground",
  "slug": "39c3-a-media-almost-archaeology-on-data-that-is-too-dirty-for-ai",
  "title": "a media-almost-archaeology on data that is too dirty for \"AI\"",
  "subtitle": null,
  "language": "en",
  "track": "Art & Beauty",
  "type": "Talk",
  "abstract": "when datasets are scaled up to the volume of (partial) internet, together with the idea that scale will average out the noise,  large dataset builders came up with a human-not-in-the-loop, cheaper-than-cheap-labor method to clean the datasets: heuristic filtering. Heuristics in this context are basically a set of rules came up by the engineers with their imagination and estimation to work best for their perspective of “cleaning”. Most datasets use heuristics adopted from existing ones, then add some extra filtering rules for specific characteristics of the datasets. I would like to invite you to have a taste together of these silent, anonymous yet upheld estimations and not-guaranteed rationalities in current sociotechnical artifacts, and on for whom these estimations are good-enough, as it will soon be part our technological infrastructures.",
  "description": "In 1980s, non-white women’s body size data was categorized as dirty data when establishing the first women's sizing system in US. Now in the age of GPT, what is considered as dirty data and how are they removed from massive training materials?\n\nDatasets nowadays for training large models have been expanded to  the volume of (partial) internet, with the idea of “scale averages out noise”, these datasets were scaled up by scrabbling whatever available data on the internet for free then “cleaned” with a human-not-in-the-loop, cheaper-than-cheap-labor method: heuristic filtering. Heuristics in this context are basically a set of rules came up by the engineers with their imagination and estimation that are “good enough” to remove “dirty data” of their perspective, not guaranteed to be optimal, perfect, or rational.\n\nThe talk will show some intriguing patterns of “dirty data” from 23 extraction-based datasets, like how NSFW gradually equals to NSFTM (not safe for training model), and reflect on these silent, anonymous yet upheld estimations and not-guaranteed rationalities in current sociotechnical artifacts, and ask for whom these estimations are good-enough, as it will soon be part our technological infrastructures.\n",
  "logo": "https://cfp.cccv.de/media/39c3/submissions/SSWHEP/reference_6h837ss.png",
  "persons": [
    {
      "guid": "f1d763b6-26aa-55c9-bbaa-c9840cc80e14",
      "name": "jiawen uffline",
      "public_name": "jiawen uffline",
      "avatar": null,
      "biography": "jiawen(b.~362 PPM) exists as a user most of the time in their life, having little agency as a standard user, both technologically and politically. She seeks for possibilities in internet cracks for queering the given identity of a user, their wish is to be an analogkäse in the digital figurations and drip sizzling fat on the cables and ports.\n\napart from that, jiawen's work focuses on technology as memory and desire, with contaminated history but appearing pure, sterilized, decontextualized and dehistoricized, operating through reducing rather than relating. jiawen looks into the infrastructure, (counter)history, materiality, locality, materiality, poetics and politics of technology. She sees l̸͓̪̜͕̮̆̎̓e̷͍̲͕̫̦͌a̵̡̝͈̗̐k̴̢͖̮̞̣̄͛̓͛̐ as an instance of the space-time continuum and a definite part of the digital reality, and leaking as a method to survive together.\n\ncurrently based in Bremen, Germany.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_f1d763b6-26aa-55c9-bbaa-c9840cc80e14"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/a-media-almost-archaeology-on-data-that-is-too-dirty-for-ai",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/SSWHEP/"
}