{
  "guid": "8b660d93-07e5-5c13-812e-cc69fb2314b6",
  "code": null,
  "id": 200515,
  "date": "2025-12-28T12:15:00+01:00",
  "start": "12:15",
  "duration": "00:30",
  "room": "Free Knowledge Habitat",
  "slug": "39c3-glam-digital-kulturerbe-im-virtuellen-dialog-zugan",
  "title": "GLAM digital – Kulturerbe im virtuellen Dialog zugänglich machen",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "Talk",
  "abstract": "Vorstellung des Online-Partizipationsformates \"GLAM digital\"",
  "description": "Innerhalb der letzten Monate konnten wir zwei schöne Jubiläen begehen, das gemeinsam von Wikimedia Österreich und Wikimedia Deutschland durchgeführte Format „GLAM digital“ konnte jüngst über 100 Gastvortragende begrüßen, die an über 50 Ausgaben teilgenommen haben. Fast jeden Monat bringt die Reihe ausgewählte Kultur- und Gedächtnisinstitutionen in den Austausch mit der Wikipedia-Community. Die beteiligten Institutionen reichten von großen Häusern wie dem Kunsthistorischen Museum in Wien oder dem Museum Barberini in Potsdam bis zu Entdeckungen wie dem Archiv deutscher Frauenbewegungen oder dem Osttiroler Bauernhofmuseum Wurzerhof. Auch Museumsverbände oder nationale UNESCO-Kommissionen zählten bereits zu den Gästen. Wir möchten euch das Format kurz vorstellen und euch zur Mitwirkung an künftigen Ausgaben von „GLAM digital“ einladen. Mehr zum Format könnt ihr auch in Blogbeiträgen oder in der Wikipedia nachlesen.\n",
  "logo": "https://pretalx.wikimedia.de/media/39c3-2025/submissions/GPVCHH/Bildschirmfoto_2025-12-22_um_11.39.16_YjbnCnG.png",
  "persons": [
    {
      "guid": "72b67aa4-ec68-53e3-8fd8-d6d74cad6e75",
      "name": "Holger Plickert (WMDE)",
      "public_name": "Holger Plickert (WMDE)",
      "avatar": "https://pretalx.wikimedia.de/media/avatars/76589c02c6ad2d3fe812f8d4612aab0b_bipI1cL.jpg",
      "biography": "Holger Plickert ist Referent für Kultur- und Gedächtnisinstitutionen bei Wikimedia Deutschland e. V. Zuvor arbeitete er u. a. für die Stiftung Preußische Schlösser und Gärten Berlin-Brandenburg und die Kulturquartier Mecklenburg-Strelitz gGmbH. In seiner jetzigen Funktion versteht er sich als Bindeglied zwischen den Ehrenamtlichen der Wikimedia-Projekte und den Kultur- und Gedächtnisinstitutionen sowie den Fachverbänden.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_72b67aa4-ec68-53e3-8fd8-d6d74cad6e75"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/glam-digital-kulturerbe-im-virtuellen-dialog-zugan",
  "links": [],
  "origin_url": "https://pretalx.wikimedia.de/39c3-2025/talk/GPVCHH/"
}