{
  "guid": "8ba2a160-c00d-56c4-a84e-afb1536bc48b",
  "code": "F3LF7R",
  "id": 2419,
  "logo": null,
  "date": "2025-12-28T12:15:00+01:00",
  "start": "12:15",
  "duration": "01:00",
  "room": "Fuse",
  "slug": "39c3-2419-neue-chaos-events-inselchaos-und-hack-ma-s-castle-plaudern-aus-dem-nahkastchen",
  "url": "https://cfp.cccv.de/39c3/talk/F3LF7R/",
  "title": "Neue Chaos Events - InselChaos und Håck ma’s Castle plaudern aus dem Nähkästchen",
  "subtitle": "",
  "track": "CCC & Community",
  "type": "Talk",
  "language": "de",
  "abstract": "Auf der Insel Rügen und in Österreich tut sich was - und zwar neue Chaos Events. Wir möchten über Anforderungen, Herausforderungen, Hürden, Erfahrungen und Glücksmomente aus unserer Sicht der Orga erzählen. Das InselChaos fand im LaGrange e.V. im September 2025 statt und bildet den Auftakt für weitere kreative, informative und chaotische Events auf der Insel Rügen. Das Håck ma’s Castle wird mit etwas Humor auch über Herausforderungen sprechen, welche unter anderem durch dezentrale Teams aus diversen Hackspaces entstehen.",
  "description": "**InselChaos**\r\nDer Port39 e.V. hatte den Traum, das Chaos nach MV zu holen und ein größeres Event an der Ostsee zu veranstalten. Gerade erst 3 Jahre alt, haben wir mit der Planung in kleinem Kreis begonnen. Eine Location musste gesucht, Inspirationen und Ideen gesammelt, bürokratische Hürden und sehr viele individuelle Probleme gelöst werden, bis es Anfang September soweit war, dass wir unsere Gäste begrüßen durften. In diesem Talk sprechen wir darüber, wie es ist, als kleiner Verein mit einem vierköpfigen Orga-Team ein ChaosEvent mit über 150 Gästen zu koordinieren, welche Schwierigkeiten wir dabei überwunden und vor allem, welche Learnings wir daraus gezogen haben, um es nächstes Mal noch besser zu machen.\u2028\r\n\r\n**Håck ma’s Castle**\r\nWir werden in unserem Talk, darüber sprechen, welche Methoden und Meetingmodi wir ausgetestet haben, gute wie aber auch schlechte Entscheidungen welche getroffen wurden. Vorallem aber auch über die Herausforderung, die es mit sich bringt, wenn sich Wesen noch nicht kennen und wir zuerst auf menschlicher Ebene auch zusammenkommen mussten, damit es inhaltlich auch besser klappt. \u2028\u2028Hard facts Håck ma's Castle:\r\n- 3 (+1) Tage Event\r\n- August 2024\r\n- mit Schloss\r\n- mit Camping\r\n- ~330 Wesen\r\n- inklusive 1 Schlosskatze *meow*\r\n- Orga verteilt in ganz Österreich und darüber hinaus:\r\n- metalab, realraum, C3W, CCC Salzburg, /dev/lol, SegFaultDragons, SegVault, IT-Syndikat, /usr/space, Gebärdenverse, female coders, chaos.jetzt etc.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "DJVBVP",
      "name": "Erwin Ernst \"eest9\" Steinhammer",
      "avatar": null,
      "biography": "Netzpolitischer Aktivist aus Österreich. Aktiv beim Chaos Computer Club Wien und Forum Informtionsfreiheit. Setzt sich seit Jahren vor allem für die Informationsfreiheit, föderierte soziale Netze und Community-Building ein.",
      "public_name": "Erwin Ernst \"eest9\" Steinhammer",
      "guid": "54df8a2c-ddf5-5eaf-a0ba-3b27fd1d6695",
      "url": "https://cfp.cccv.de/39c3/speaker/DJVBVP/"
    },
    {
      "code": "LDLELP",
      "name": "lasii",
      "avatar": "https://cfp.cccv.de/media/avatars/LDLELP_OgstTBp.png",
      "biography": "hat jahrelange Erfahrung an Eventorganisation, sowieso Vereinsleitungen und Gründungen. lasii ist mit der Projektleitung vom Hack ma's Castle auch deutlich tiefer ins Chaos eingetaucht.",
      "public_name": "lasii",
      "guid": "0c99800d-4f94-5fe9-91f1-3cd868384eee",
      "url": "https://cfp.cccv.de/39c3/speaker/LDLELP/"
    },
    {
      "code": "YCERNR",
      "name": "InselChaos",
      "avatar": null,
      "biography": "Wir sind Niklas und Daniel vom Port39 e.V.. \r\nDer Verein Port39 e.V. aus Stralsund ist eine gemeinnützige Organisation, die sich der Förderung von Bildung, Weiterbildung sowie Kunst und Kultur im Bereich der Informationstechnologie widmet. Themen wie Computersicherheit, Datenschutz und der verantwortungsvolle Umgang mit Technologie stehen dabei im Mittelpunkt.\r\nAls Mitglieder des Orga-Teams bilden wir gemeinsam mit zwei weiteren Menschen das Kern-Orga-Team des InselChaos.",
      "public_name": "InselChaos",
      "guid": "cd9ba78f-d099-54dd-b7fe-76a43476f1f9",
      "url": "https://cfp.cccv.de/39c3/speaker/YCERNR/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/F3LF7R/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/F3LF7R/",
  "attachments": []
}