{
  "guid": "8d964e8f-4853-5ca9-8a0e-6afc215dae7d",
  "code": "38XZPY",
  "id": 1527,
  "date": "2025-12-30T13:50:00+01:00",
  "start": "13:50",
  "duration": "00:40",
  "room": "Ground",
  "slug": "39c3-von-groschen-und-spurlos-gnu-taler-auch-auf-eurem-event",
  "title": "Von Groschen und SpurLos - GNU Taler auch auf eurem Event!",
  "subtitle": null,
  "language": "de",
  "track": "CCC & Community",
  "type": "Talk",
  "abstract": "Willkommen in der Zukunft: Beim LUG Camp in Wipperfürth und bei den Datenspuren in Dresden wurde digital bezahlt - mit GNU Taler als Event-Bezahlsystem. Noch einfacher als Bargeld, billiger als Kartenzahlung und ohne Eingriff in die Privatsphäre der Besucher*innen. Wir zeigen euch, wie auch ihr das bei eurer nächsten (Chaos-)Veranstaltung anbieten könnt!",
  "description": "Anonymes Bezahlen ganz ohne Bargeld? Digitales Bezahlen ohne Gebühren auf jede einzelne Transaktion? Keine zentrale Datensammelei bei US-amerikanischen Zahlungsanbietern, und trotzdem keine Blockchain?\n\nGeht nicht? Geht doch! Schon auf mehreren Veranstaltungen wurde [GNU Taler](https://www.taler.net/) erfolgreich als lokales Event-Bezahlsystem eingesetzt: Sämtliche Zahlungen beim [LUG Camp 2024](https://lugcamp.wuplug.org/) wurden dank GNU Taler ausschließlich digital durchgeführt. Ebenso wurde mehr als ein Viertel des Umsatzes bei den [Datenspuren 2025](https://datenspuren.de/2025/) mit GNU Taler digital abgewickelt.\n\nWährend die GLS Bank im Rahmen des EU-geförderten Projekts NGI Taler ein [deutschlandweites Angebot](https://www.gls.de/taler) vorbereitet, hatten unsere Besucher*innen bereits jetzt die Gelegenheit, anonymes digitales Bezahlen in der echten Welt zu testen. Das positive Feedback und der reibungslose Ablauf haben uns gezeigt: GNU Taler ist einsatzbereit und kommt in der Community super an!\n\nDeshalb wollen wir unsere Erfahrungen mit GNU Taler als Eventbezahlsystem gerne an Orgateams von anderen (Chaos-)Veranstaltungen weitergeben. Nach einer Einführung zur Funktionsweise von GNU Taler berichten wir von der praktischen Umsetzung beim LUGCamp und bei den Datenspuren und geben Tipps für alle, die GNU Taler auch bei ihrem nächsten Event anbieten wollen.\n",
  "logo": null,
  "persons": [
    {
      "guid": "f3ce80c8-347b-543d-b6b5-02e5894c9229",
      "name": "Mikolai Gütschow",
      "public_name": "Mikolai Gütschow",
      "avatar": "https://cfp.cccv.de/media/avatars/apb-small_QG7LJXG.jpg",
      "biography": "Free Software advocate working at TU Dresden on [Taler](https://www.taler.net/de/) and [RIOT](https://www.riot-os.org/).\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_f3ce80c8-347b-543d-b6b5-02e5894c9229"
    },
    {
      "guid": "ebbc4bec-bb98-5b23-9040-67e862abb711",
      "name": "signum",
      "public_name": "signum",
      "avatar": null,
      "biography": "Als Enthusiast freier Software war ich maßgeblich an der Nutzung von GNU Taler auf dem LugCamp 2024 (lugcamp.org), einem 4-tägigen Camp aller deutschsprachigen Linux User Groups, beteiligt. Wir wollten möglichst viele Komponenten nutzen, auf Praxistauglichkeit testen und durch die anwesenden Freaks stressen lassen.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_ebbc4bec-bb98-5b23-9040-67e862abb711"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/von-groschen-und-spurlos-gnu-taler-auch-auf-eurem-event",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/38XZPY/"
}