{
  "guid": "8f6e4391-96fc-5d29-b66c-328026fc35f0",
  "code": "UJA9AF",
  "id": 2235,
  "date": "2025-12-27T13:50:00+01:00",
  "start": "13:50",
  "duration": "00:40",
  "room": "Fuse",
  "slug": "39c3-endlich-maschinenlesbare-urteile-open-access-fur-juristen",
  "title": "Endlich maschinenlesbare Urteile! Open access für Juristen",
  "subtitle": null,
  "language": "de",
  "track": "Science",
  "type": "Talk",
  "abstract": "Zur Überraschung Vieler sind Juristen Wissenschaftler, die nach wissenschaftlichen Maßstäben arbeiten sollten und ihre Schriftsätze und Urteile auch nach stringenten wissenschaftlichen Kriterien gestalten und untereinander diskutieren sollten. Doch nur in einigen Rechtsgebieten funktioniert dies.\r\n\r\nWie jede Wissenschaft ist auch die Rechtswissenschaft nur so gut wie das ihr zugrundeliegende Quellenmaterial – in diesem Fall sind das meist Urteile. Empirische Untersuchungen über diese Daten sind nur möglich, wenn sie der Forschung auch zur Verfügung stehen. Doch wissenschaftliche Arbeit im juristischen Feld ist aktuell nicht wirklich möglich, da die wenigsten Urteile veröffentlicht werden, da sich die Gerichte meist vor der dadurch anfallenden Arbeit scheuen. Wir betrachten, warum dies Grundsätze der Rechtsstaatlichkeit infrage stellt und warum Player aus der Wirtschaft mehr über deutsche Rechtsprechung wissen, als unsere Gerichte – und wie sie das zu Geld machen.",
  "description": "Es ist tatsächlich ein ernsthaftes und reales wissenschaftliches und gesellschaftliches Problem, wenn Urteile hinter den wurmstichigen Aktenschränken der Amtstuben weggeschlossen werden. Wir belegen das anhand einiger besonders hahnebüchener Zitate aus aktuellen und nicht mehr änderbaren Urteilen aus der Praxis.\n\nWir erarbeiten aktuell Strategien, wie man das Rechtssystem power-cyclen kann, um Urteile in ihrer Gesamtheit, und damit die faktisch gesprochene Rechtslage in Deutschland wieder zugänglich werden. Als positiver Nebeneffekt der Verfügbarkeit von Urteilen kann Zivilgesellschaft und die Politik auch selber souverän überprüfen, ob unsere Richter das Recht typischerweise auch wirklich im Sinne der Legislative anwenden – keiner kann es aktuell wissen, wie können nur hoffen ...\n",
  "logo": null,
  "persons": [
    {
      "guid": "517ae0f4-28f4-5169-9e72-30da3f91fe76",
      "name": "Beata Hubrig",
      "public_name": "Beata Hubrig",
      "avatar": null,
      "biography": "Bea ist Rechtsanwältin und engagiert sich seit eineinhalb Jahrzehnten für die Rechte von Anschlussinhabern. Sie bringt dadurch einen sehr tiefen Einblick in die Praxis mit.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_517ae0f4-28f4-5169-9e72-30da3f91fe76"
    },
    {
      "guid": "1621a5f6-4709-5441-80c1-13662d0062b0",
      "name": "Nuri Khadem-Al-Charieh",
      "public_name": "Nuri Khadem-Al-Charieh",
      "avatar": "https://cfp.cccv.de/media/avatars/ZN9GT7_4igpVS8.jpg",
      "biography": "Nuri ist Rechtsanwalt, arbeitet hauptberuflich in der Digitalisierungsabteilung einer deutschen Großkanzlei und hat über ein Jahrzehnt im IT-Support und als Sys-Admin gearbeitet. Er bildet darüberhinaus Jurastudenten in technischem Allgemein- und Spezialwissen aus.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_1621a5f6-4709-5441-80c1-13662d0062b0"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/endlich-maschinenlesbare-urteile-open-access-fur-juristen",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/UJA9AF/"
}