{
  "guid": "90258ec4-44a0-53d5-b7cd-8b952bfcefb1",
  "code": null,
  "id": 100442,
  "date": "2025-12-28T12:00:00+01:00",
  "start": "12:00",
  "duration": "00:50",
  "room": "Bits&Bäume Living Room",
  "slug": "39c3-digital-humanities-meetup_86vd",
  "title": "Digital Humanities Meetup",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "Meetup 50 Minutes",
  "abstract": "Digital Humanities: Forschung in den Geisteswissenschaften in digitaler Form, kurz: DH. Wir treffen uns zu einem lockeren Kennenlernen und Gedankenaustausch. Was ist Euer Interesse an den DH, wo verortet Ihr Euch in der Chaosfamilie? Welche Themen des 39C3 könnten für die DH relevant sein - und umgekehrt?",
  "description": "Digital Humanities: Forschung zu Literatur, Geschichte, Sprache, Kunst, Musik in digitaler Form - von Rechercheprozessen über Analysemethoden bis hin zu Publikationsformen. Als Brückendisziplin zwischen IT und geisteswissenschaftlichen Fächern operieren die \"DH\" aber nicht nur anwendungsbezogen, sondern auch transformativ: Sie evaluieren kritisch im Diskurs, welche Aspekte der fortlaufenden Digitalisierung für die wissenschaftliche Praxis förderlich genutzt werden können.\n\nDamit sorgen sie aber auch stets für Aufregung, wenn es darum geht, etablierte wissenschaftliche Prozesse zu stören: Etwa, wenn es um Open Source, Open Science, Open Data geht sowie um FAIR- und CARE-Prinzipien oder um nichtproprietäre Standards. Wir begleiten als Digital Humanists somit nicht nur die Digitalisierung von Kulturdokumenten und Wissenschaft(sbürokratie), sondern auch von Arbeitsprozessen mit dem Ziel, in diesem Zuge auch eine freiere, fairere, nachhaltigere, zugänglichere, offenere und digitalsouveränere Wissenschaftspraxis zu etablieren.\n\nWir schließen an die Meetups der letzten beiden Jahre an und treffen uns wieder zu einem lockeren Kennenlernen und Gedankenaustausch (siehe unser Pad dazu: https://etherpad.wikimedia.org/p/DHMeetup). Willkommen sind alle, die an den DH interessiert sind - und vermutlich sind viele bereits in der Chaos-Familie, ohne dass wir voneinander wissen. Wo in der Chaos-Familie verortet Ihr Euch? Welche Themen des 39C3 könnten für die DH relevant sein und umgekehrt? Kommt zahlreich! Nach Bedarf können wir weitere Meetups oder SoS zu spezifischen Themen organisieren.\n",
  "logo": null,
  "persons": [
    {
      "guid": "b17ad620-8949-58a2-a9dd-74bc9433a4a8",
      "name": "Ulrike Wuttke",
      "public_name": "Ulrike Wuttke",
      "avatar": null,
      "biography": "Ulrike Wuttke Digital Humanities - WissKomm - InfoWiss - jenseits des Funklochs zwischen Potsdam und Berlin!\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_b17ad620-8949-58a2-a9dd-74bc9433a4a8"
    },
    {
      "guid": "c37650f7-c396-552b-83b3-cd16f450c160",
      "name": "Torsten Roeder",
      "public_name": "Torsten Roeder",
      "avatar": "https://cfp.cccv.de/media/avatars/dino_RaA5dRd.png",
      "biography": "Torsten Roeder works at the University of Wurzburg and is specialized on digital heritage research. His work in digital editing and textual history made him a member of the TEI Technical Council. Recently, he started a Retro Computing Lab at his department which is used for studying the digital culture of the 1980s and 1990s. He also holds a PhD in musicology and plays some guitar, and enjoys gardening. Jack of all trades, master of none.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_c37650f7-c396-552b-83b3-cd16f450c160"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/digital-humanities-meetup_86vd",
  "links": [],
  "origin_url": "https://pretalx.freifunktag.de/39c3-bub-workshops-2025/talk/CAN9JP/",
  "do_not_record": true
}