{
  "guid": "90699389-58fb-4193-89dd-f9ebee1544b6",
  "code": null,
  "id": 906993,
  "date": "2025-12-29T18:30:00+01:00",
  "start": "18:30",
  "duration": "01:00",
  "room": "Komonin",
  "slug": "39c3-brainstorming-politischer-kampf-und-direkte-aktion",
  "title": "Brainstorming - Politischer Kampf und direkte Aktion gegen \"KI\"",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "other",
  "abstract": "",
  "description": "\"Generative KI\" und \"Large Language Models\" sind eine Technologie, bei der sich zunehmend abzeichnet, dass es nicht nur ein schräger Hype ist, sondern eine disruptive Technologie, die das Potential hat unsere Gesellschaft entscheidend zu verändern. Aus linksradikaler Perspektive müsste die Folgefrage sein: \"verändert diese Technologie die Gesellschaft zum besseren, zum schlechteren oder ist das offen?\" und darauf folgend \"Falls zweiteres, was können wir dagegen tun und falls letzteres, wie können wir dagegen Einfluss nehmen?\" Aber aktuell stellen sich linkspolitische Kontexte diese Fragen gar nicht. Mit der völligen Akzeptanz von Instagram und co (https://events.ccc.de/congress/2025/hub/de/event/detail/gesprachsrunde-zum-umgang-linksradikaler-und-anarc) scheinen linke Bewegungen jedoch völlig verlernt zu haben, kritisch über Technologien nachzudenken und zu diskutieren. In großen Teilen linker und anarchistischer Szene, findet zu dem Thema gerade keine Debatte statt, von Aktionen ganz zu schweigen. Vielleicht liegt es an einem Gefühl der Machtlosigkeit, dass man doch sowieso keinen Einfluss auf Entwicklung und Nutzung von Technologien hat? Aber das ist erwiesenermaßen falsch, man muss nur einen Blick auf die Kämpfe gegen Gentechnik, Atomkraft und Kohlekraft werfen. In allen Fällen konnte durch direkte Aktion nennenswert Einfluss genommen werden und zumindest die Dominanz dieser Technologien deutlich eingedämmt werden.\n\nMeine These, die ich als Grundannahme für diesen Workshop voraussetze: Es handelt sich hier um eine Technologie, die die Welt (und insbesondere das Internet) schlechter und nicht besser macht und es ist sinnvoll sie mit allen Mitteln die möglich sind zu bekämpfen. Vielleicht ist sie neben dem Klimawandel die größte Gefahr unserer Zeit. Deshalb wollen wir hier darüber diskutieren, was für Möglichkeiten für den Kampf gegen \"KI\" wir haben, welche Aktionsformen aus Anti-Gentechnik/Atomkraft/Kohle-Bewegung sich adaptieren lassen und welche nicht und wie wir endlich Bewusstsein in unsere politischen Kontexten dafür schaffen können, dass das fucking wichtig ist.\n\nUnd bitte: die Grundannahme will ich in genau diesem Workshop nicht diskutieren. Gerne sonst immer, auch gerne in einer eigenen Session. Aber hier soll es um einen Austausch für Menschen gehen, die diese Grundannahme teilen. Und bitte: Keine Militanzdebatten. Sonst reden wir über nichts anderes. Auch Diversity of Tactics würde ich für die Debatte gerne als gegeben voraussetzen.\n",
  "logo": null,
  "persons": [
    {
      "guid": "c9ecb2d6-a76b-433d-b973-5f2c34b27c55",
      "name": "Luna",
      "public_name": "Luna",
      "avatar": null,
      "biography": null,
      "url": "https://events.ccc.de/congress/2025/hub/user/luna"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/brainstorming-politischer-kampf-und-direkte-aktion",
  "links": []
}