{
  "guid": "910e5f22-945b-5196-8e21-246acbcaadd3",
  "code": "N7CZSV",
  "id": 1980,
  "date": "2025-12-30T11:55:00+01:00",
  "start": "11:55",
  "duration": "00:40",
  "room": "Zero",
  "slug": "39c3-end-of-10-how-the-foss-community-is-combatting-software-drive-resource-and-energy-consumption",
  "title": "“End Of 10”: How the FOSS Community is Combatting Software-Driven Resource and Energy Consumption",
  "subtitle": null,
  "language": "en",
  "track": "CCC & Community",
  "type": "Talk",
  "abstract": "The end of free support for Windows 10 was 14 October 2025. Well, sort of. Microsoft moved the date to 2026, one more year the FOSS community can introduce users to sustainable software. 14 October is also KDE's birthday, International E-Waste Day, with International Repair Day following on 18 October. The irony is deep, but what is not ironic is that millions of functioning computers will end up becoming security risks or discarded as e-waste. This means manufacturing and transporting new ones, the biggest waste of all: hardware production accounts for over 75% of a device's CO2 emissions over its lifespan.\r\n\r\nThe FOSS community had an opportunity and we took it! In 2024, KDE Eco's Opt Green project began a global, unified campaign across FOSS and repair communities to upgrade unsupported Windows 10 computers to Linux. We held BoFs at SFSCon, CCC, and FOSDEM. We thought big and acted boldly. In this talk End Of 10 contributors will discuss the campaign, what has worked and what the challenges have been, and how FOSS provides a solution to software-driven resource and energy consumption.",
  "description": "This is a talk about digital sustainability and the role software plays in hardware longevity. At the 38C3, the End Of 10 campaign held a workshop to co-ordinate contributions across FOSS communities. Many people currently involved started contributing after this workshop, including 2 of the 3 presenters.\n",
  "logo": "https://cfp.cccv.de/media/39c3/submissions/N7CZSV/endof10-logo-avatar_US7be6Y_WFB2s4c.webp",
  "persons": [
    {
      "guid": "8d2cb4eb-0e52-5348-bf25-044805c3e967",
      "name": "Joseph P. De Veaugh-Geiss",
      "public_name": "Joseph P. De Veaugh-Geiss",
      "avatar": "https://cfp.cccv.de/media/avatars/joseph_600x600px_EE9I0RJ.jpg",
      "biography": "Joseph P. De Veaugh-Geiss (he/him) is the community manager of the KDE Eco project. The goal of KDE Eco is to strengthen sustainability goals as part of the development and adoption of Free Software.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_8d2cb4eb-0e52-5348-bf25-044805c3e967"
    },
    {
      "guid": "afbd4d9c-457b-5dde-b00f-6dbe68e48917",
      "name": "Carolina Silva Rode",
      "public_name": "Carolina Silva Rode",
      "avatar": null,
      "biography": null,
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_afbd4d9c-457b-5dde-b00f-6dbe68e48917"
    },
    {
      "guid": "8b1554a7-c8da-547b-b4e6-b03138e36416",
      "name": "Bettina Louis",
      "public_name": "Bettina Louis",
      "avatar": "https://cfp.cccv.de/media/avatars/RNUJTV_xdswJtP.jpeg",
      "biography": "Bettina Louis has been an engineer for energy and process technology for 20 years and a teacher at a technical school for almost as long. Now retired, Bettina is dedicated to support the End Of 10 campaign by organizing install events in Berlin.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_8b1554a7-c8da-547b-b4e6-b03138e36416"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/end-of-10-how-the-foss-community-is-combatting-software-drive-resource-and-energy-consumption",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/N7CZSV/"
}