{
  "guid": "9296cd85-f869-5687-94cb-e87d805249a2",
  "code": "Y9EJFV",
  "id": 1377,
  "date": "2025-12-27T20:30:00+01:00",
  "start": "20:30",
  "duration": "01:00",
  "room": "One",
  "slug": "39c3-episode-ii-der-rat-schlagt-zuruck",
  "title": "Chatkontrolle - Ctrl+Alt+Delete",
  "subtitle": null,
  "language": "de",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "abstract": "Seit jetzt schon vier Jahren droht aus der EU die Chatkontrolle. In Deutschland ist das Thema nach den Protesten im Oktober aktueller denn je - und sogar Jens Spahn und Rainer Wendt sind plötzlich gegen diese Form der Überwachung. In diesem Vortrag schauen wir zurück und erklären was, vor allem im Hintergrund, passiert ist. Wir nehmen die Position der Bundesregierung genau unter die Lupe und werfen einen Blick auf die Schritte, die auf EU-Ebene vor uns liegen.",
  "description": "Die Chatkontrolle liest sich mehr wie eine tragische Komödie, als ein Gesetzgebungsverfahren. Nach dem dramaturgischen Rückblick auf dem 37C3 wird es nun Zeit einen Blick auf die Seite der Rebellen zu werfen. \nMarkus Reuter und khaleesi haben den Gesetzgebungsprozess rund um die Chatkontrolle von Anfang an eng begleitet, er aus der der journalistischen, sie aus der Policy-Perspektive. \nNach den ersten Jahren mit großen Rummel und Hollywoodstars ist es nach den EU-Wahlen doch etwas ruhig geworden. Doch die Gefahr ist nicht vom Tisch:\n\nZwar steht die Position des EU-Parlaments gegen die Chatkontrolle - aber wie sicher sie wirklich ist, ist unklar.\nDerzeit hängt alles am Rat: Es gab sehr positive Vorschläge (polnische Ratspräsidentschaft) und negative Vorschläge (dänische Ratspräsidentschaft) - doch einigen können sich die Länder nicht und eine Mehrheit will die Chatkontrolle, kann sich aber nicht durchsetzen.\n\nUnd auch in Deutschland hat die Chatkontrolle den ganz großen Sprung in die Öffentlichkeit geschafft und die Gegner:innen einen Etappensieg errungen. Was dieser Erfolg mit der Arbeit der letzten vier Jahre zu tun hat und warum auch in Deutschland noch nichts in trockenen Tüchern ist, erzählen wir in diesem Talk.\n",
  "logo": null,
  "persons": [
    {
      "guid": "6ffd6316-c9a4-59ee-8ccb-e0bbf7be8af9",
      "name": "khaleesi",
      "public_name": "khaleesi",
      "avatar": "https://cfp.cccv.de/media/avatars/H9GEPE_SrtQiP3.jpg",
      "biography": "khaleesi ist eine der Sprecherinnen des Chaos Computer Clubs. Sie ist Informatikerin und arbeitet im Bereich IT-Sicherheit. Seit 2022 ist sie federführend im Kampf gegen die geplante Chatkontrolle.\nIn ihrem gemeinsamen Podcast, „Dicke Bretter“ mit Constanze Kurz und Elisa Lindinger, erklärt sie wie Gesetzgebungsprozesse in der Praxis funktionieren und schaut zurück auf bereits verhandelte digitalpolitische Themen.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_6ffd6316-c9a4-59ee-8ccb-e0bbf7be8af9"
    },
    {
      "guid": "52d341b7-8417-5093-959e-496c9f529196",
      "name": "Markus Reuter",
      "public_name": "Markus Reuter",
      "avatar": "https://cfp.cccv.de/media/avatars/BRHKC9_4b5hIB1.webp",
      "biography": "Markus Reuter researches and writes about digital policy and surveillance at netzpolitik.org. He also covers topics such as the police, fundamental rights and civil liberties, protests, and social movements. Over the past four years, he has written more than 200 articles on chat monitoring and has followed the surveillance project from its inception to the present day.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_52d341b7-8417-5093-959e-496c9f529196"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/episode-ii-der-rat-schlagt-zuruck",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/Y9EJFV/"
}