{
  "guid": "94c5aafc-0742-500b-92bd-ca6f2ceb37a1",
  "code": "JBPZLJ",
  "id": 2199,
  "logo": null,
  "date": "2025-12-29T13:50:00+01:00",
  "start": "13:50",
  "duration": "00:40",
  "room": "One",
  "slug": "39c3-2199-wer-hat-angst-vor-dem-neutralitatsgebot",
  "url": "https://cfp.cccv.de/39c3/talk/JBPZLJ/",
  "title": "Wer hat Angst vor dem Neutralitätsgebot?",
  "subtitle": "",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "language": "en",
  "abstract": "Wer überhaupt „neutral“ sein muss, was das bedeutet, und wer sich jetzt wehren muss.",
  "description": "„Neutralität“ wird zum neuen Kampfbegriff: Weil sie gegen die menschenfeindliche Politik von Friedrich Merz protestieren, wirft die CDU Gruppen wie Omas gegen Rechts, Greenpeace und Correctiv vor, nicht neutral zu sein. Unter Berufung auf ein angeblich verletztes Neutralitätsgebot werden staatliche Förderungen gestrichen und NGOs geraten unter Beobachtung des Verfassungsschutzes.\r\nJulia Klöckner verbietet im Namen der „Neutralität“ Palestine-Shirts, Anstecknadeln und Regenbogenflaggen im Parlament. Die AfD fordert dazu auf, Lehrkräfte zu melden, die sich gegen Rechtsextremismus einsetzen oder entsprechende Positionen innerhalb der AfD kritisieren.\r\nDoch was steckt dahinter?\r\nWas bedeutet das sogenannte Neutralitätsgebot – und für wen gilt es überhaupt?\r\nUnd für wen gilt es nicht?\r\nZivilcourage kann nicht neutral sein – und soll es auch nicht sein. Genauso wie AfD-Hetze gegen Migrant*innen nicht „neutral“ ist, ist die Kritik menschenfeindlicher Äußerungen nicht nur legitim, sondern Pflicht demokratischer Bürger*innen. Das Beschwören eines „Neutralitätsgebots“ für NGOs ist ein durchschaubarer, aber gefährlicher Versuch, sie der eigenen Position zu unterwerfen.\r\nDie Rechtsanwältinnen Vivian Kube und Hannah Vos erklären den verfassungsrechtlichen Hintergrund, zeigen die autoritären Strategien hinter dem Ruf nach „Neutralität“ auf und geben Tipps, wie man sich dagegen wehren kann.\r\nSie engagieren sich im Projekt Gegenrechtschutz, um demokratische Prinzipien und Betroffene vor rechtlichen Angriffen zu verteidigen.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "9H7KTB",
      "name": "Hannah Vos",
      "avatar": null,
      "biography": "Hannah Vos arbeitet unter anderem in dem Projekt Gegenrechtsschutz, das Beratung und juristische Unterstützung bei Angriffen von rechts bietet. Die wachsende Verunsicherung im Zusammenhang mit dem Neutralitätsgebot ist dabei einer der Themenschwerpunkte. \r\nSie leitet das Legal-Team von FragDenStaat und ist Anwältin in der Berliner Kanzlei KM8.",
      "public_name": "Hannah Vos",
      "guid": "99ab6ea1-e212-55af-81be-d10486e536bd",
      "url": "https://cfp.cccv.de/39c3/speaker/9H7KTB/"
    },
    {
      "code": "JZLQSQ",
      "name": "Vivian Kube",
      "avatar": null,
      "biography": "Vivian arbeitet bei FragDenStaat im Legal Team und als Rechtsanwältin in der Kanzlei KM8.",
      "public_name": "Vivian Kube",
      "guid": "4780233f-9b1e-51f7-b652-7ed1f543175a",
      "url": "https://cfp.cccv.de/39c3/speaker/JZLQSQ/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/JBPZLJ/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/JBPZLJ/",
  "attachments": []
}