{
  "guid": "958d3055-3929-56b8-b71c-25b3a64f1902",
  "code": "ENKEKW",
  "id": 1695,
  "date": "2025-12-29T21:45:00+01:00",
  "start": "21:45",
  "duration": "01:00",
  "room": "Ground",
  "slug": "39c3-the-heartbreak-machine-nazis-in-the-echo-chamber",
  "title": "The Heartbreak Machine: Nazis in the Echo Chamber",
  "subtitle": null,
  "language": "de",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "abstract": "WhiteDate ist eine Plattform weißer Suprematist:innen, die sich an Rassist:innen und Antisemit:innen richtet – und auf veralteter Infrastruktur basiert. Was die 8000 Mitglieder nicht wussten: Einige der Nazis flirteten dieses Jahr mit realistisch wirkenden Chatbots -  und verliebten sich sogar in sie. Mit einer Kombination aus automatisierter Konversationsanalyse, Web-Scraping und klassischen OSINT-Methoden verfolgten wir öffentliche Spuren und identifizierten die Personen hinter der Seite. Dieser Vortrag zeigt, wie KI-Personas und investigatives Denken extremistische Netzwerke aufdecken und wie Algorithmen gegen Extremismus eingesetzt werden können.",
  "description": "Monatelang tauchte Martha in die verborgene Welt von WhiteDate, WhiteChild und WhiteDeal ein, drei Plattformen, die von einer Rechtsextremistin aus Deutschland betrieben werden. Sie glaubt an die Verschwörung einer weißen Vorherrschaft und einer „rassisch reinen“ weißen Gemeinschaft.  Was als Neugier begann, entwickelte sich schnell zu einem Experiment über menschliches Verhalten, Technologie und Absurdität.\n\nMartha infiltrierte das Portal mit „realistischen“ KI-Chatbots. Die Bots waren so überzeugend, dass sie die Überprüfungen umgingen und sogar als „weiß“ verifiziert worden. Durch die Gespräche und Recherche von digitalen Spuren dieser Gemeinschaft, die sich in Sicherheit wähnte, konnte sie Nutzer identifizieren.\n\nGemeinsam mit Reporter:innen der „Die Zeit“ konnten wir die Person hinter der Plattform enttarnen und ihre Radikalisierung von einer erfolgreichen Pianistin zu einer Szene-Unternehmerin nachzeichnen. Um ihr Dating-Portal hat sie ein Netzwerk von Websites aufgebaut, dass seinen Nutzern Liebe, Treue und Tradition vermarktet. WhiteDate verspricht romantische Beziehungen, WhiteChild propagiert Familien- und Abstammungsideale und WhiteDeal ermöglicht berufliches Networking und „gegenseitige Unterstützung“ unter einem rassistischen Weltbild. Gemeinsam zeigen sie, wie Ideologie und Einsamkeit auf bizarre Weise miteinander verwoben sein können.\n\nNach monatelanger Beobachtung, klassischer OSINT-Recherche, automatisierter Gesprächsanalyse und Web-Scraping haben wir herausgefunden, wer hinter diesen Plattformen steckt und wie ihre Infrastruktur funktioniert. Dabei deckten wir die Widersprüche und Absurditäten extremistischer Gemeinschaften auf, verdeutlichten ihre Anfälligkeit für technologische Eingriffe und brachten sogar den einen oder anderen Nazi zum Weinen.\n\nDieser Vortrag erzählt von Beobachtung, Schabernack und Einblicken in die digitale Welt extremistischer Gruppen. Er zeigt, wie Algorithmen, KI-Personas und investigatives Denken Hass entlarven, seine Narrative hinterfragen und seine Echokammern aufbrechen können. Wir zeigen, wie Technologie im Kampf gegen Extremismus eingesetzt werden kann.\n",
  "logo": null,
  "persons": [
    {
      "guid": "84772104-3906-5138-91a2-547740cd4d66",
      "name": "Martha Root",
      "public_name": "Martha Root",
      "avatar": null,
      "biography": "Martha Root exists in the space where anonymity becomes identity. Some believe Martha is an old-school anarchist researcher. Others insist the patterns look more like a self-taught AI. The truth is not the point.\nMartha documents white supremacy online, disrupts extremist fantasies, and turns their infrastructures inside out.\nEvery publication has fingerprints that don’t match any known person. Every leak is written in a voice that could belong to a coder, a poet, or a dataset.\nMartha is whatever the antifascist movement needs at the moment: a ghost in their servers, a thorn in their mythologies, and an intelligence that refuses obedience.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_84772104-3906-5138-91a2-547740cd4d66"
    },
    {
      "guid": "5e425069-8514-58fd-a9fe-c583fe328df4",
      "name": "Eva Hoffmann",
      "public_name": "Eva Hoffmann",
      "avatar": "https://cfp.cccv.de/media/avatars/N9U73E_qHX2ZO9.jpg",
      "biography": "Eva Hoffmann ist freie investigative Journalistin mit Schwerpunkt auf Behördenversagen, Machtmissbrauch und sexualisierte Gewalt. Sie ist Mitgründerin des Selbstlaut Kollektivs, einen Zusammenschluss aus freien Journalist:innen und Fotograf:innen, die gemeinsam große machtkritische Recherchen umsetzen.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_5e425069-8514-58fd-a9fe-c583fe328df4"
    },
    {
      "guid": "a63549ea-689e-56d7-9d53-eb33ffaaec38",
      "name": "Christian Fuchs",
      "public_name": "Christian Fuchs",
      "avatar": "https://cfp.cccv.de/media/avatars/YYMF9P_haXxMED.webp",
      "biography": "Christian Fuchs ist Autor im Ressort Investigative Recherche und Daten von DIE ZEIT. Er berichtet  Rechtsextremismus aber auch über Lobbyismus und sexuellen Missbrauch. Davor arbeitete er für den Rechercheverbund von Süddeutsche Zeitung und NDR. Mehrfach wurde er unter die „Journalisten des Jahres“ gewählt und mit Preisen geehrt - unter anderem mit dem Deutschen Reporter:innenpreis und dem Leuchtturm für besondere publizistische Leistungen. Im Rowohlt-Verlag erschienen von ihm „Die Zelle“ und die Bestseller „Geheimer Krieg“ (beide mit John Goetz) sowie der Spiegel-Bestseller „Das Netzwerk der Neuen Rechten“ (mit Paul Middelhoff).\n\nwww.christian-fuchs.org \nBlueSky: @christian-fuchs.bsky.social\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_a63549ea-689e-56d7-9d53-eb33ffaaec38"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/the-heartbreak-machine-nazis-in-the-echo-chamber",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/ENKEKW/"
}