{
  "guid": "973af772-1dae-58a1-b979-ea890cbdfe09",
  "code": "AD7RSU",
  "id": 1730,
  "date": "2025-12-29T17:15:00+01:00",
  "start": "17:15",
  "duration": "01:00",
  "room": "Fuse",
  "slug": "39c3-the-last-of-us-fighting-the-eu-surveillance-law-apocalypse",
  "title": "The Last of Us -  Fighting the EU Surveillance Law Apocalypse",
  "subtitle": null,
  "language": "en",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "abstract": "The virus of surveillance is spreading across the European Union. In the form of its \"ProtectEU\" Internal Security Strategy, the European Commission is planning to attack encryption, re-introduce mandatory data retention and strengthen Europol and Frontex, the main agents of its oppressive law enforcement infrastructure. In this talk, we will journey the wastelands of the EU surveillance apocalypse together: We will take a close look at what politicians are planning to undermine our fundamental rights, the technology involved, and the real harms we must fight. From there, we will chart pathways to resistance and collective immunity against a surveillance agenda that requires us to form new alliances and re-think mobilization.",
  "description": "Admidst its current push to remove the rules that have protected the EU's environment, consumer and fundamental rights, there is one area the European Commission happily calls for more regulation: Internal security. The recent \"ProtectEU\" Internal Security Strategy does little to protect Europeans, and instead foresees attacks on encryption, the re-introduction of mandatory data retention and the strengthening of Europol and Frontex, the main agents of the EU's oppressive law enforcement infrastructure. In this talk, we will introduce the strategy and its main pillars, explain its political and legal contexts, and take a look at what it would mean for our fundamental rights, access to encryption, and IT security if enacted. But not all hope is lost (yet), and together we want to chart pathways to meaningful resistance. To do so, we will help understand the maze of the EU's lawmaking process and identify pressure points. We will then look back at past fights, lessons learned and new opportunities to act in solidarity against a surveillance agenda that is truly apocalyptic.\n",
  "logo": null,
  "persons": [
    {
      "guid": "5280fd21-88f5-5ea5-adba-a31d4c90bacd",
      "name": "Svea Windwehr",
      "public_name": "Svea Windwehr",
      "avatar": "https://cfp.cccv.de/media/avatars/AHMRMT_abSkXmq.webp",
      "biography": "Svea Windwehr is the Co-Chair of D64 and a member of the advisory board of the German Digital Services Coordinator, which oversees the implementation of the Digital Services Act. In her day job, she is a policy advisor at Mozilla. Her work focuses on European digital policy, focusing on platform regulation, user rights, and countering surveillance from a variety of angles, including data retention, safeguarding encryption and child protection.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_5280fd21-88f5-5ea5-adba-a31d4c90bacd"
    },
    {
      "guid": "dc5eeab0-8aed-5f6b-af58-6526414c6b55",
      "name": "Chloé Bérthélémy",
      "public_name": "Chloé Bérthélémy",
      "avatar": "https://cfp.cccv.de/media/avatars/DMF9KE_q3VczFD.jpg",
      "biography": "Chloé Berthélémy works as a Senior Policy Advisor at European Digital Rights (EDRi), the biggest network of non-governmental organisations in Europe that defend and promote human rights in the digital age. She works specifically on law enforcement, state surveillance and migration issues at European Union level.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_dc5eeab0-8aed-5f6b-af58-6526414c6b55"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/the-last-of-us-fighting-the-eu-surveillance-law-apocalypse",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/AD7RSU/"
}