{
  "guid": "978487f2-156c-428d-80d3-dc6e7b970302",
  "code": null,
  "id": 978487,
  "date": "2025-12-29T17:30:00+01:00",
  "start": "17:30",
  "duration": "02:00",
  "room": "Call for Art: Workshopspace 1",
  "slug": "39c3-poetic-technologies-and-an-open-source-university",
  "title": "Poetic Technologies and an open-source university",
  "subtitle": null,
  "language": null,
  "track": null,
  "type": "other",
  "abstract": "Visual assembly/Workshop with Nika Dubrovsky",
  "description": "Universities have become debt traps. Education is no longer about learning—it's financial control dressed up as opportunity. Students graduate with crushing loans. Professors work precarious jobs. Administration consumes budgets that should fund actual learning. Knowledge is sold, credentialed, gatekept.\n\nBut what if we could reimagine this completely? Not reform universities—redesign them from scratch.\n\nIn this workshop, we're asking CCC participants to collectively design the university of our dreams. Not the university we think is \"realistic\" or \"achievable within current constraints.\" The university we actually want.\n\nHere are the questions:\n\nShould it be distributed or centralized? Fully virtual or partially offline? How do we use open-source technologies to eliminate bullshit jobs, administration, and bureaucracy? How do we make education free, accessible, and democratic?\n\nCan a university exist without exams, without filtering students, accepting everyone who wants to learn? How do we build around open libraries—like David Graeber's music and book collections at davidgraeber.org—that anyone can modify and contribute to? How does this become not an institution, not a nation-state project, but a community of experimenters distributed globally?\n\nUltimately, this is about technologies—survival technologies. Social technologies. Poetic technologies.\n",
  "logo": "https://events.ccc.de/congress/2025/hub/https://usercontent.events.ccc.de/congress/2025/hub/usercontent/e/d32242c10f60/Poetic_Technologies_and_an_open-source_university.jpeg",
  "persons": [],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/poetic-technologies-and-an-open-source-university",
  "links": []
}