{
  "guid": "985ef663-e1f8-54d2-8e3e-f0c5beb512e2",
  "code": "JEHZPU",
  "id": 1636,
  "logo": "https://cfp.cccv.de/media/39c3/submissions/JEHZPU/philo_stitches_vw3s5fm_E1ZCbt7.webp",
  "date": "2025-12-28T16:35:00+01:00",
  "start": "16:35",
  "duration": "00:40",
  "room": "Ground",
  "slug": "39c3-1636-persist-resist-stitch",
  "url": "https://cfp.cccv.de/39c3/talk/JEHZPU/",
  "title": "Persist, resist, stitch",
  "subtitle": "",
  "track": "Art & Beauty",
  "type": "Talk",
  "language": "en",
  "abstract": "What does knitting have to do with espionage? Can embroidery help your mental health? This talk shows how the skills to create textile art have enabled people to resist and to persist under oppressive regimes for centuries. And it offers ways to keep doing so.",
  "description": "Working with textile mediums like yarn, thread, and floss is generally seen as a feminine hobby and as thus is usually classified as craft, not art. And crafting is something people, maybe even people usually seen as a bit boring, do in their free time to unwind. Most of us have grown up with the image of the loving grandmother knitting socks for the family, an act of care that was never considered anything special.\r\nThe patriarchal society’s tendency to underestimate anything considered feminine and, inextricably connected to this, domestic is an ongoing struggle. But being underestimated also provides a cover and with it the opportunity for subversion and resistance.\r\nAs global powers are cycling back to despotism and opression, let me take you back in time to show you how people used textile crafts to organise resistance and shape movements. Like the quilts that were designed and sewn to help enslaved people in the US escape slavery and navigate the Underground Railroad from the 1780s on, or the knitted garments that carried information about the Nazis to help resistance in occupied Europe during World War II, or the cross stitches by a prisoner of war that had Nazis unknowingly display art saying “Fuck Hitler”.\r\nTextile crafts have been used by marginalised and disenfranchised people to protest, to organise, and to persist for centuries. This tradition found a new rise in what is now called “craftivism” and is using the internet to build bigger communities spanning the world. These communities also come together to help, often quite tangibly by creating specific items like the home-sewn masks during early Covid19. In addition, crafting has scientifically-proven benefits for one’s mental health.\r\nTaking up the increasingly popular quote \"When the world is too scary, too loud, too much: Stop consuming, start creating\", this talk shows how the skills to create have enabled and will enable people to resist and to persist.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "FDPKPX",
      "name": "Philo",
      "avatar": null,
      "biography": "Philo spends most of her time with historical documents and screams at politics way too often because people apparently don't learn from the past. She tries to keep her sanity by crafting all the crafts.",
      "public_name": "Philo",
      "guid": "137422da-217a-5e11-b660-4c6d02318838",
      "url": "https://cfp.cccv.de/39c3/speaker/FDPKPX/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/JEHZPU/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/JEHZPU/",
  "attachments": []
}