{
  "guid": "9960c6d6-93ad-4d22-b346-1a0883d902d1",
  "code": null,
  "id": 996066,
  "date": "2025-12-29T21:30:00+01:00",
  "start": "21:30",
  "duration": "00:50",
  "room": "SoS Lecture E",
  "slug": "39c3-2-jahre-bezahlkarte-2-jahre-widerstand-gegen-_kzuw",
  "title": "2 Jahre Bezahlkarte - 2 Jahre Widerstand gegen rassistische und ökonomische Repression",
  "subtitle": null,
  "language": "de, en",
  "track": null,
  "type": "other",
  "abstract": "",
  "description": "In February 2024, a pilot project was launched in Hamburg to issue payment cards to refugees. Individual municipalities in Bavaria, Thuringia and Brandenburg followed suit, and now the cards are in use throughout Germany. Not much has changed: with the prepaid debit card, most places still do not allow more than €50 per person per month to be withdrawn in cash. This often incurs fees or there are minimum purchase values of €5-10. Transfers and direct debits are only possible to approved payees. Contrary to promises, online shopping is often not possible or only possible with special permission from the authorities.\nThis is discriminatory, degrading, stigmatising and prevents self-determined living!\n\nWe have therefore organised ourselves and founded initiatives. In March 2024, the initiative ‘No to payment cards in Hamburg’ launched a voucher exchange programme in solidarity with other people opposed to payment cards. Other cities and initiatives soon followed, such as ‘Offen! München’, ‘Konten statt Karten’ Leipzig and ‘No to payment cards Berlin-Brandenburg’. We are now networked with many other initiatives across the country that oppose payment cards. We inform, protest, exchange ideas and not at least vouchers in solidarity to support people with payment cards and help them obtain more cash. \nWe want to continue to reach as many people as possible and encourage them to get involved, exchange ideas, build their own structures and join us in protesting against the payment card. In Hamburg, the issuance of the payment card has already been extended to other groups of people and ‘tested’ for further escalation levels. They mean all of us!\nDiscrimination and disenfranchisement through payment cards and similar dirty tricks are nothing new. Whether it was chip card systems in the 1990s and 2000s or the issuance of benefits in the form of vouchers – we've seen it all before. But what we also saw was resistance, bartering and solidarity shopping campaigns!  As a result, local and state governments had to scale back their system of control. And even if they are now ramping them up again at full speed, we can do the same with our resistance!\nSo let's stop the payment card and stand together against racist policies and the dismantling of social rights!\n",
  "logo": null,
  "persons": [
    {
      "guid": "e6bd7fb9-1bc6-4c72-8041-f9da0bc9049d",
      "name": "neinzurbezahlkarte",
      "public_name": "neinzurbezahlkarte",
      "avatar": null,
      "biography": "As local initiatives against the payment card, we organize solidarity voucher exchanges and resistance against racist policies. As the nationwide network “Equal Social Rights for All,” we take a united political stand against socio-political injustices and racism.\n\nEnd the exclusion of marginalized groups! Cash for all!\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/neinzurbezahlkarte"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/2-jahre-bezahlkarte-2-jahre-widerstand-gegen-_kzuw",
  "links": []
}