{
  "guid": "a3770cc3-fca5-504a-934e-fb0dd78e1656",
  "code": "YWRSRY",
  "id": 2318,
  "logo": null,
  "date": "2025-12-30T12:50:00+01:00",
  "start": "12:50",
  "duration": "00:40",
  "room": "Ground",
  "slug": "39c3-2318-the-rising-misuse-of-ai-in-medical-research",
  "url": "https://cfp.cccv.de/39c3/talk/YWRSRY/",
  "title": "The rising misuse of AI in {medical} research",
  "subtitle": "",
  "track": "Science",
  "type": "Talk",
  "language": "en",
  "abstract": "Artificial intelligence (AI) is increasingly used in medical research, influencing how data are analyzed and how findings are presented. While some applications have led to genuine progress, others rely on overstated claims, unsuitable methods, or even manipulated data and outcomes. This talk examines the growing misuse of AI-related terminology and techniques in the scientific literature. By discussing what is actually meant by “AI” and related concepts, it will consider how inflated expectations, methodological misuse, and deliberate falsification can undermine the credibility and reproducibility of {medical} research.",
  "description": "This talk examines how AI is currently used - and increasingly misused - in medical research. It begins with examples where AI methods have achieved genuine advances and others where they have clearly failed. Between these extremes lies a wide area where the term “AI” is often applied inconsistently or without sufficient methodological justification. I will discuss what is actually meant by AI, machine learning, and related concepts, and clarify where these approaches can be useful and where they are not. The talk focuses on three main forms of misuse: the *selling argument* - using the label “AI” to make research appear more sophisticated; the *misuse of method* - applying AI techniques where they offer no real benefit; and *simple falsification*. To illustrate these issues, I will present a recent example from my own research on a biomarker for chronic pain, showing how such problems can arise and how difficult they are to flag and correct within the scientific and publishing landscape. The talk concludes with reflections on how the research community can promote more transparent, critical, and responsible uses of AI.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "EPSBYD",
      "name": "Ole Goltermann",
      "avatar": "https://cfp.cccv.de/media/avatars/EPSBYD_c9FAusS.jpg",
      "biography": "Hi, I am Ole!\r\nI work in neuroscience, studying how pain is processed and represented in the spinal cord and the brain.",
      "public_name": "Ole Goltermann",
      "guid": "7ab51d90-ec00-559a-97b1-7f59619293d5",
      "url": "https://cfp.cccv.de/39c3/speaker/EPSBYD/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/YWRSRY/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/YWRSRY/",
  "attachments": []
}