{
  "guid": "a4fe2316-1322-40e7-beed-96ab8a237fd3",
  "code": null,
  "id": 423161,
  "date": "2025-12-27T16:30:00+01:00",
  "start": "16:30",
  "duration": "01:20",
  "room": "SoS Lecture E",
  "slug": "39c3-anders-streiten-lernen",
  "title": "anders streiten lernen",
  "subtitle": null,
  "language": "de, en",
  "track": null,
  "type": "other",
  "abstract": "",
  "description": "We live in times of intense conflicts and their violent escalation. One of the central theses of Jalka's work is that a viable democracy and a conscious culture of constructive conflict resolution go hand in hand.\n\nCultivating this ability requires a conscious decision to engage with individual, collective and societal patterns of dispute behaviour and conflict management. Starting with oneself, as well as in our interactions with others, in public discourse and in our behaviour towards others. With a willingness to change something in order to reduce, and in the best case even prevent, the suffering and violence that can potentially arise from conflicts. And to learn from this for the future.\n\nWhat exactly will this SOS session be about?\n\nWe will engage in a number of exercises and discussion rounds based on the following questions:\n\nHow do you deal with conflicts? How do others deal with conflicts? How do you experience conflicts? What exactly are conflicts? What dynamics promote conflicts? What patterns are there in place? How can we deal with conflicts constructively? How do conflicts caused by individual, interpersonal and structural factors differ? And: How can conflict management be designed to be sensitive to discrimination?\n\nI will share with you my experiences from my work as a mediator and from past workshops I have held on this topic. In addition to exercises, I will also bring along some literature for further reading.\n\nPlease feel free to bring your own questions and insights to the session so that we can all learn from and with each other. I look forward to seeing you.\n\nin parts translated with DeepL.com (free version)\n",
  "logo": null,
  "persons": [
    {
      "guid": "e700c679-6b1e-4103-a70e-346758d066cb",
      "name": "Tomate_aka_Radikale_Liebe",
      "public_name": "Tomate_aka_Radikale_Liebe",
      "avatar": null,
      "biography": null,
      "url": "https://events.ccc.de/congress/2025/hub/user/tomate_aka_radikale_liebe"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/anders-streiten-lernen",
  "links": []
}