{
  "guid": "a58ff353-19ee-5241-a80c-cb7581b8c450",
  "code": "QV3MVU",
  "id": 500084,
  "date": "2025-12-28T17:00:00+01:00",
  "start": "17:00",
  "duration": "01:00",
  "room": "Wohnzimmerbühne",
  "slug": "39c3-openstreetmap",
  "title": "OpenStreetMap",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "Workshop",
  "abstract": "Im Workshop lernt ihr gemeinsam mit anderen Jugendlichen, aktiv zur OpenStreetMap beizutragen. Der Fokus liegt auf der Vermittlung von digitalen Kompetenzen, der Bedeutung freier Daten und der Förderung von Zusammenarbeit\r\n\r\nFür Jugendliche zwischen 12 und 18 Jahren",
  "description": "Entdecke die Welt von OpenStreetMap und werde ein Teil der OpenData-Bewegung! 🗺️\n\nEgal, ob du schon mal von OpenStreetMap gehört hast oder nicht, in unserem Workshop lernst du, wie du selbst aktiv an einer der größten freien Kartenprojekte der Welt mitwirken kannst. Hier erfährst du, warum OpenData so wichtig ist und wie jede:r Einzelne dazu beitragen kann, die Daten für alle Menschen besser zu machen.\n\nIm Gegensatz zu den Karten großer Firmen wie Google Maps ist OpenStreetMap von der Community für die Community. Das bedeutet, dass jede:r Daten hinzufügen oder korrigieren kann. Und das Beste daran? Es macht riesigen Spaß, dabei mitzumachen! 😃\n\nAlso komm vorbei und lass uns gemeinsam die Welt ein Stückchen besser kartieren! 🌍\n",
  "logo": "https://pretalx.chaos.jetzt/media/jugend/submissions/QV3MVU/lab-fuerstenberg-2020-openstreetmap_1nA_nSoKZj6.png",
  "persons": [
    {
      "guid": "3c99d053-d7cf-57e2-9c11-244372e4f1c4",
      "name": "Gerd Kant",
      "public_name": "Gerd Kant",
      "avatar": null,
      "biography": "Softwareentwickler mit Leidenschaft für Netzpolitik, Informationsfreiheit und Jugendarbeit. Als Lab Lead im Jugend hackt Lab Schwerin und Vorstandsmitglied des Hacklabors engagiere ich mich für Open Source, Open Data, Jugendbildung sowie die Vermittlung von Medienkompetenz und lebe dabei die Werte der Hacker*innenethik sowie Diversität, Offenheit, Teilhabe und kreative Zusammenarbeit. Es ist mir wichtig, Menschen einen Zugang zu dieser spannenden Welt zu ermöglichen, die ihn sonst vielleicht nicht hätten.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_3c99d053-d7cf-57e2-9c11-244372e4f1c4"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/openstreetmap",
  "links": [],
  "origin_url": "https://pretalx.chaos.jetzt/jugend/talk/QV3MVU/",
  "feedback_url": "https://pretalx.chaos.jetzt/jugend/talk/QV3MVU/feedback/"
}