{
  "guid": "a772df36-2b1c-46d2-b14b-33f155f9bbd2",
  "code": null,
  "id": 772362,
  "date": "2025-12-28T11:00:00+01:00",
  "start": "11:00",
  "duration": "03:00",
  "room": "SoS Workshop D",
  "slug": "39c3-rust-programming-language-an-absolute-beginner-wor",
  "title": "Rust programming language: An absolute beginner workshop with intro presentation",
  "subtitle": null,
  "language": "en, de",
  "track": null,
  "type": "other",
  "abstract": "",
  "description": "**A heartfelt welcome!**\n\nWe will hold a Rust workshop for beginners.\n\nWe will start with an introduction in the form of a lecture of about 45 minutes.\n\nThis will be followed by a period of about 120 minutes (including a break), during which you are going to work through exercises independently and at your own pace.\n\nWe will help with any questions. We — and you — will be supported by the automated Rustlings course.\n\nOther experienced Rust developers will be on hand to help all participants directly with questions during the workshop.\n\nDon't hold back: You are very welcome to ask questions during the workshop!\n\n**You will need:**\n\n- A laptop, prepared as described below, so we can get started right away.\n\n**Preparation**\n\n- Follow the instructions at **<https://rustlings.rust-lang.org/>** for the installation of Rust itself, as well as the interactive Rustlings course.\n- Also note the instructions for the editor and terminal. The integration with [**rust-analyzer**](https://rust-analyzer.github.io/) will make your Rust experience much more enjoyable!\n\n**Verify that your setup works ahead of time!**\n\nIf you would like to receive help setting this up or verifying that your setup works well (especially if you use Windows), please come by our friendly Rust assembly or contact me directly.\n\n**Power supply**\n\nThe workshop rooms at the venue are not well prepared for work with many laptops: unfortunately, there will not be any power sockets at the tables!\n\n- Please bring your laptop fully charged.\n- If you can, then bring a long cable and multi-sockets, so you can provide yourself and others with electricity.\n\n**See you at the workshop — great to have you!**\n\nLeonie ([**@calisti@chaos.social**](https://chaos.social/@calisti))\n",
  "logo": null,
  "persons": [
    {
      "guid": "2cd5b6e0-e7a5-4974-aba4-9df587aff364",
      "name": "calisti",
      "public_name": "calisti",
      "avatar": null,
      "biography": null,
      "url": "https://events.ccc.de/congress/2025/hub/user/calisti"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/rust-programming-language-an-absolute-beginner-wor",
  "links": []
}