{
  "guid": "ab19e1f1-ca13-531e-9d30-0ca5b0c7551c",
  "code": "SRCDYW",
  "id": 1785,
  "logo": null,
  "date": "2025-12-27T23:55:00+01:00",
  "start": "23:55",
  "duration": "00:40",
  "room": "Zero",
  "slug": "39c3-1785-building-a-noc-from-scratch",
  "url": "https://cfp.cccv.de/39c3/talk/SRCDYW/",
  "title": "Building a NOC from scratch",
  "subtitle": "",
  "track": "CCC & Community",
  "type": "Talk",
  "language": "de",
  "abstract": "Learn from our mistakes during the first iteration of Network Operations for Europe's largest furry convention, Eurofurence.\r\nThis year, a small team of Chaos and Furry creatures founded a fresh network team to fulfill the demands of the Eurofurence29 event. We will share details about the technical and personal challenges of building a team and network from scratch.",
  "description": "By the time of Eurofurence29, the event has reached the limit of what typical event venues are able to reasonably provide in terms of network services. Especially the Audio-Video production setup required a network capable of high-bandwith, low-latency, low-jitter, multicast transport in addition to precise time-synchronisation services. For this reason and for the first time ever, an onsite Eurofurence Network Operations Center (EFNOC) has been founded to tackle these increasing demands.\r\n\r\nDuring EF29 a fresh team built, for the first time in Eurofurence History, an onsite network capable of meeting these requirements. This network was also depended on for coordination and management of the event (e.g. Security and Registration) and we (the team) set it as a personal team goal to bring a usable WiFi connection to all attendees throughout the event venue.\r\nThe team was founded as a combination of well known EF staffers supported and completed by furries from the chaos community.\r\n\r\nWe will share details about the network architecture which roughly consisted of a simple VLAN based architecture using Arista DCS-7050TX-72Q switches for 40Gbit/s throughput capabilities in addition to native Precision-Time-Protocol support. We also utilized a hypervisor for network services like DHCP, DNS, monitoring, etc. During the event we encountered many fun issues with our NIC, our switch firmware, our config tooling which we will explain in detail.\r\nThe talk will also go into details about how we organized the team structure, which skills we observed as critically required, how we dealt with the encountered issues and what we plan to do better next year :)",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "Y7FLAX",
      "name": "lilly",
      "avatar": "https://cfp.cccv.de/media/avatars/Y7FLAX_Epjopod.jpg",
      "biography": "- Queer hacktivist from Hamburg\r\n- level 42 kubernetes wizard\r\n- network engineering hobbyist with an IPv6 fetish",
      "public_name": "lilly",
      "guid": "effa73d5-9fd2-5e52-a24b-9a7b0ed19827",
      "url": "https://cfp.cccv.de/39c3/speaker/Y7FLAX/"
    },
    {
      "code": "7GVBZ9",
      "name": "Scientress",
      "avatar": "https://cfp.cccv.de/media/avatars/7GVBZ9_McJrovU.jpeg",
      "biography": "Scientress, aka. Jenny, is a software and hardware developer, DevOps engineer and broadcast / media technician. Friends say about her that she is very cuddly and can operate almost everything except airplanes and helicopters, and that she is working on.\r\nAt chaos event one can usually find her in the voc, noc or at the c3nav assembly.\r\nOutside of the next chaos event you can find her in hackspaces all over Austria and Germany or on ICE trains.",
      "public_name": "Scientress",
      "guid": "fda207dd-fcf2-5187-b5cf-ac2ed770fdd9",
      "url": "https://cfp.cccv.de/39c3/speaker/7GVBZ9/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/SRCDYW/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/SRCDYW/",
  "attachments": []
}