{
  "guid": "ad5df397-cd49-50cb-a8d6-18862f01c507",
  "code": "QH8BTD",
  "id": 500086,
  "date": "2025-12-28T12:15:00+01:00",
  "start": "12:15",
  "duration": "01:00",
  "room": "Wohnzimmerbühne",
  "slug": "39c3-unplugtrump-deine-daten-deine-entscheidung",
  "title": "#unplugTrump – Deine Daten, deine Entscheidung",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "Workshop",
  "abstract": "Was haben WhatsApp, TikTok, YouTube und Instagram gemeinsam? Sie gehören zu riesigen Tech-Konzernen, die damit Geld verdienen, möglichst viel über dich zu wissen – was du magst, mit wem du chattest, wann du online bist und sogar, wo du dich aufhältst. Gerade jetzt, wo Plattformen sich immer stärker politischer Macht und wirtschaftlichen Interessen beugen – zum Beispiel in den USA – wird klar: Die Kontrolle über deine Daten liegt nicht bei dir, sondern bei ihnen.\r\n\r\nZeit, das zu ändern!\r\n\r\nFür Jugendliche zwischen 12 und 18 Jahren",
  "description": "In unserem Workshop [#unplugTrump](https://events.ccc.de/congress/2025/hub/tag/unplugTrump) schauen wir uns genau an, wie diese Plattformen funktionieren  Was ist ihr Geschäftsmodell? Warum sind sie „kostenlos“? Und was passiert mit den Daten, die du teilst?\n\nStatt nur zu kritisieren, zeigen wir dir Alternativen: freie Messenger, unabhängige Suchmaschinen, dezentrale soziale Netzwerke und andere Tools, mit denen du selbst entscheidest, was du teilst – und mit wem. 🔎🌍\n\nDu recherchierst selbst in kleinen Gruppen, testest Alternativen und findest heraus, was für dich funktioniert. Begleitet wirst du dabei von engagierten Mentor:innen, die dir Impulse geben, Fragen beantworten und dich beim Ausprobieren unterstützen. Am Ende präsentierst du deine Ergebnisse: Welche Tools kanntest du noch nicht? Welche könntest du dir vorstellen zu nutzen? Welche Plattformen verdienen dein Vertrauen?\n\nOb du bereits erste Erfahrungen mit diesen Themen hast oder dich zum ersten Mal damit beschäftigst: Du bist herzlich willkommen! Und gemeinsam machen wir den ersten Schritt in Richtung digitale Selbstbestimmung.\n",
  "logo": "https://pretalx.chaos.jetzt/media/jugend/submissions/QH8BTD/digitale_Selbstbestimmung_workshop-560x_2CX0aut.png",
  "persons": [
    {
      "guid": "3c99d053-d7cf-57e2-9c11-244372e4f1c4",
      "name": "Gerd Kant",
      "public_name": "Gerd Kant",
      "avatar": null,
      "biography": "Softwareentwickler mit Leidenschaft für Netzpolitik, Informationsfreiheit und Jugendarbeit. Als Lab Lead im Jugend hackt Lab Schwerin und Vorstandsmitglied des Hacklabors engagiere ich mich für Open Source, Open Data, Jugendbildung sowie die Vermittlung von Medienkompetenz und lebe dabei die Werte der Hacker*innenethik sowie Diversität, Offenheit, Teilhabe und kreative Zusammenarbeit. Es ist mir wichtig, Menschen einen Zugang zu dieser spannenden Welt zu ermöglichen, die ihn sonst vielleicht nicht hätten.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_3c99d053-d7cf-57e2-9c11-244372e4f1c4"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/unplugtrump-deine-daten-deine-entscheidung",
  "links": [],
  "origin_url": "https://pretalx.chaos.jetzt/jugend/talk/QH8BTD/",
  "feedback_url": "https://pretalx.chaos.jetzt/jugend/talk/QH8BTD/feedback/"
}