{
  "guid": "ad9fa823-820f-5846-825e-42e2b5934ef6",
  "code": "QPKEKK",
  "id": 1823,
  "date": "2025-12-29T23:00:00+01:00",
  "start": "23:00",
  "duration": "01:00",
  "room": "Ground",
  "slug": "39c3-peep-show-fur-die-polizei-staatliche-uberwachung-von-queers-in-hamburger-toiletten-bis-1980",
  "title": "Peep-Show für die Polizei. Staatliche Überwachung von Queers in Hamburger Toiletten bis 1980",
  "subtitle": null,
  "language": "de",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "abstract": "Oder: Wie die Hamburger Polizei queere Menschen auf öffentlichen Toiletten observierte, und wie ein anonymes Kollektiv im Juli 1980 dieses Überwachungsystem wortwörtlich mit dem Hammer zerschlagen hat. Ein analoger Überwachungskrimi mit sauberen Städten, lichtscheuen Elementen, queerem Aktivismus, und kollektiver Selbstorganisation; und mit einer Anleitung wie man Beamten Anfang der 80er das Handwerk legen konnte.",
  "description": "In den 1970er Jahren nutzt die Hamburger Polizei auf zehn öffentlichen Herrentoiletten in der Wand eingelassene Spionspiegel, um zu beobachten welche Männer am Pissoir ihrer Meinung nach etwas zu lange nebeneinander stehen. In einem Überwachungszeitraum von gut 18 Jahren sprechen Hamburger Beamte mit Berufung auf ‚Jugendschutz‘ und ‚Sauberkeit‘ hunderte Hausverbote an öffentlichen Toiletten aus, nehmen Personalien auf und legen dabei illegalerweise ‚Rosa Listen‘ genannte Homosexuellenregister an. \nDie unfreiwillige Peep-Show endet im Sommer 1980, als die Polizei völlig indiskret die Teilnehmenden der ersten lesbisch-trans-schwulen Demonstration in Hamburg fotografiert um nach Selbstaussage „die Karteien aufzufrischen“. Ein anonymes Kollektiv zerschlägt die Überwachungsspiegel und bringt die illegale Polizeipraxis ans Licht der Öffentlichkeit.\nMit zwei Fragen tauchen wir in diesem Vortrag in die Aborte der Geschichte: Wie ist das polizeiliche Toilettenüberwachungssystem in Hamburg entstanden? Welche technischen und sozialen Lücken nutzten die Aktivist:innen für den Exploit dieses Systems? Und was hat das eigentlich mit heute zu tun?\n",
  "logo": "https://cfp.cccv.de/media/39c3/submissions/QPKEKK/KB_AK_1980_181_061_ausschnitt_16-9_MVtN8yv.jpg",
  "persons": [
    {
      "guid": "db7775d4-77d2-5990-baaf-886c914c5a76",
      "name": "Simon Schultz",
      "public_name": "Simon Schultz",
      "avatar": "https://cfp.cccv.de/media/avatars/KTP7YW_Cmp5OMs.webp",
      "biography": "Simon Schultz (er/ihm) kommt aus der Medienkunst und macht Workshops, Performances, Ausstellungen und Vorträge. Seine Themen sind queere Geschichte, Community Building, künstlerische Bildforschung, sowie kollektives Handeln in Kunst und Aktivismus. Beim 38C3 war er Teil von ChaosGPT, für den 37C3 produzierte er Gitte Schmitz' \"Institut für Karaokeforschung\".\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_db7775d4-77d2-5990-baaf-886c914c5a76"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/peep-show-fur-die-polizei-staatliche-uberwachung-von-queers-in-hamburger-toiletten-bis-1980",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/QPKEKK/"
}