{
  "guid": "b51eb883-55db-5e30-9685-f7726b4da4d1",
  "code": "AHCWCJ",
  "id": 1295,
  "logo": null,
  "date": "2025-12-29T13:50:00+01:00",
  "start": "13:50",
  "duration": "00:40",
  "room": "Zero",
  "slug": "39c3-1295-watch-your-kids-inside-a-children-s-smartwatch",
  "url": "https://cfp.cccv.de/39c3/talk/AHCWCJ/",
  "title": "Watch Your Kids: Inside a Children's Smartwatch",
  "subtitle": "",
  "track": "Security",
  "type": "Talk",
  "language": "en",
  "abstract": "Join us as we hack at a popular children's smartwatch and expose the secrets of every fifth child in Norway, their parents, and millions more.",
  "description": "Smartwatches for children have entered the mainstream: Advertised on the subway and sold by your cell provider, manufacturers are charging premium prices comparable to an entry-level Apple watch.\r\n\r\nIn exchange, parents are promised peace of mind: A safe, gentle introduction into the world of technology — and a way to call, text, and locate their child at any time.\r\n\r\nBut how much are the vendor's promises of safety, privacy, GDPR compliance, apps made in Europe and cloud servers in Germany actually worth?\r\n\r\nWe take you along the process of hacking one of the most popular children's watches out there, from gaining initial access to running our own code on the watch. Along the way, we find critical security issues at every turn. Our PoC attacks allow us to read and write messages, virtually abduct arbitrary children, and take control over any given watch.\r\n\r\nFinally, we'll also talk about disclosure, funny ideas of what passes as a security fix, and how we can use what we found to build something better.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "ZT77FW",
      "name": "Nils Rollshausen",
      "avatar": null,
      "biography": "Somehow — and without ever having owned more than an iPod — Nils fell down the Apple rabbit hole and now spends their days reverse-engineering Apple's devices and uncovering the bits of magic hiding inside the machines that surround us every day. They are interested in all things privacy & security and like to build new things every now and then, instead of only breaking what's already there. Currently, they are pursuing a PhD in computer science at the Secure Mobile Networking Lab (SEEMOO) of TU Darmstadt.",
      "public_name": "Nils Rollshausen",
      "guid": "2598d4ba-38dc-551f-9a61-1318e01aea35",
      "url": "https://cfp.cccv.de/39c3/speaker/ZT77FW/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/AHCWCJ/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/AHCWCJ/",
  "attachments": []
}