{
  "guid": "b6069b0d-2d5d-438b-a611-4fb145e94815",
  "code": null,
  "id": 606902,
  "date": "2025-12-27T16:30:00+01:00",
  "start": "16:30",
  "duration": "01:20",
  "room": "SoS Workshop D",
  "slug": "39c3-selbsthilfegruppe-verwaltungsdigitalisierung-faxge",
  "title": "Selbsthilfegruppe Verwaltungsdigitalisierung (Faxgeräteclub)",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "other",
  "abstract": "",
  "description": "Ähnlich wie in den letzten Jahren wollen wir uns auch dieses Jahr wieder treffen und uns rund um das Thema Verwaltungsdigitalisierung austauschen und vernetzen.\n\nWas ist der Faxgeräteclub und warum machen wir das?\n\nWenn wir über Behörden-IT sprechen, dann sprechen wir oft über einen zwingend notwendigen Wissensaufbau und die Internalisierung von IT-Kompetenz in der öffentlichen Verwaltung. Aber wer sich dann tatsächlich für einen Job in der Verwaltung entscheidet oder aus der Zivilgesellschaft heraus positiv auf die Verwaltung einwirken will, die:der braucht viel Überzeugungstalent und oft auch Durchhaltevermögen. Aber wir können auch viel Positives bewirken.\n\nWoran scheitert es in der Praxis, wo liegen die strukturellen Probleme und welche Impulse braucht es jetzt aus der Politik?\n\nWir sprechen im Faxgeräteclub über unsere Erfahrungen im Alltag in und mit Behörden, darüber, was in der Verwaltung alles noch falsch läuft und wie wir gemeinsam etwas daran ändern können. Kommt vorbei uns lasst uns gemeinsam in lockerer Runde ein wenig diskutieren und Pläne schmieden! Willkommen sind alle, die sich für die IT der öffentlichen Verwaltung interessieren und/oder gerne mit uns ihre Ideen oder Fragen teilen möchten.\n",
  "logo": null,
  "persons": [
    {
      "guid": "94f716d3-c4c8-4c84-99c0-697ac28e6fb4",
      "name": "iusan",
      "public_name": "iusan",
      "avatar": null,
      "biography": null,
      "url": "https://events.ccc.de/congress/2025/hub/user/iusan"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/selbsthilfegruppe-verwaltungsdigitalisierung-faxge",
  "links": []
}