{
  "guid": "b98918cb-489e-5f5e-aa06-26753cb48418",
  "code": "SVTNYA",
  "id": 1454,
  "logo": "https://cfp.cccv.de/media/39c3/submissions/SVTNYA/ap_kMANWzf.png",
  "date": "2025-12-29T14:45:00+01:00",
  "start": "14:45",
  "duration": "01:00",
  "room": "Zero",
  "slug": "39c3-1454-making-the-magic-leap-past-nvidia-s-secure-bootchain-and-breaking-some-tesla-autopilots-along-the-way",
  "url": "https://cfp.cccv.de/39c3/talk/SVTNYA/",
  "title": "Making the Magic Leap past NVIDIA's secure bootchain and breaking some Tesla Autopilots along the way",
  "subtitle": "",
  "track": "Security",
  "type": "Talk",
  "language": "en",
  "abstract": "The Tegra X2 is an SoC used in devices such as the Magic Leap One, and Tesla's Autopilot 2 & 2.5 promising a secure bootchain. But how secure really is the secure boot? In this talk I go over how I went from a secured Magic Leap One headset, to exploiting the bootloader over USB, to doing fault injection to dump the BootROM, to finding and exploiting an unpatchable vulnerability in the BootROM's USB recovery mode affecting all Tegra X2s.",
  "description": "In mid 2024, a friend approached me about Magic Leap making their TX2 based XR headsets little more than a paperweight by disabling the mandatory activation servers. I morally dislike this, companies shouldn't turn functional devices into e-waste just because they want to sell newer devices.\r\n\r\nAfter obtaining one, and poking at the Fastboot implementation, I discovered it was based off NVIDIA's Fastboot implementation, which is source available. I found a vulnerability in the NVIDIA provided source code in how it unpacks SparseFS images (named sparsehax), and successfully blindly exploited the modified implementation on the Magic Leap One. I also found a vulnerability in it that allowed gaining persistence via how it loads the kernel DTB (named dtbhax).\r\n\r\nStill unsatisfied with this, I used fault injection to dump the BootROM from a Tegra X2 devkit.\r\n\r\nIn the BootROM I discovered a vulnerability in the USB recovery mode. Exploiting this vulnerability proved difficult due to only having access to memory from the perspective of the USB controller. I will explain what was tried, why it didn't work, and how I eventually got code execution at the highest privilege level via it. \r\n\r\nAs I will demonstrate, this exploit also functions on Tesla's autopilot hardware.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "ZZBSFH",
      "name": "EliseZeroTwo",
      "avatar": null,
      "biography": "Security researcher cat with a love for breaking embedded devices. Worked in the past on Nintendo Switch hacking and also held a talk on that at GPN21.",
      "public_name": "EliseZeroTwo",
      "guid": "5a4f947f-d3f0-5339-b1c2-2cf84af8022b",
      "url": "https://cfp.cccv.de/39c3/speaker/ZZBSFH/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/SVTNYA/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/SVTNYA/",
  "attachments": []
}