{
  "guid": "ba5269c3-88f7-50e8-b12c-63510ee697e8",
  "code": "8CVJUN",
  "id": 2258,
  "logo": "https://cfp.cccv.de/media/39c3/submissions/8CVJUN/hackerbible-p40_WmYht9p.png",
  "date": "2025-12-30T11:55:00+01:00",
  "start": "11:55",
  "duration": "00:40",
  "room": "Fuse",
  "slug": "39c3-2258-what-you-hack-is-what-you-mean-35-years-of-wiring-sense-into-text",
  "url": "https://cfp.cccv.de/39c3/talk/8CVJUN/",
  "title": "What You Hack Is What You Mean: 35 Years of Wiring Sense into Text",
  "subtitle": "",
  "track": "Art & Beauty",
  "type": "Talk",
  "language": "en",
  "abstract": "Encoding isn’t just for machines — it’s how humans shape meaning. This talk traces 35 years of hacking text through the Text Encoding Initiative (TEI), a community-driven, open-source standard for describing the deep structure of texts. We’ll explore how TEI turns literature, research, and even hacker lore into machine-readable, remixable data — and how it enables minimal, sustainable self-publishing without gatekeepers. From alphabets to XML and the Hacker Bible, we’ll look at text as a living system: something we can read, write, and hack together.",
  "description": "Computers can’t do much without encoding. They need ways to turn bytes into symbols, words, and meaning — to make text readable for both humans and machines. But encoding isn’t just for machines. Humans also encode: we describe, structure, and translate our thoughts into text. And while the number of text formats seems endless (and keeps growing), that’s not a bug — it’s a feature. Diversity in encoding is how we learn what works and what doesn’t.\r\n\r\nLong before ASCII tables or Unicode, text encoding already existed — in alphabets, printing presses, and typographic systems. Every technology of writing has been a way of hacking language into matter: from clay tablets to lead letters, from code pages to Markdown. Each era brings new formats and new constraints — and with them, new genres, new rules, new cultural codes. Think of poetry and protocol manuals, fairy tales and README files, the Hacker Bible itself — all shaped by the tools and conventions that carry them.\r\n\r\nSo here’s the question: can we encode not only what we see, but what we mean? Can we capture a poem’s rhythm, a play’s voices, or the alternate endings of a story — and do it in a way that’s open, remixable, and machine-readable?\r\n\r\nTurns out, yes — and the solution has existed since 1988. It’s called the Text Encoding Initiative (TEI), a long-running open-source standard that lets you describe the structure, semantics, and context of texts using XML. You can think of it as a humanities fork of hypertext — an extensible markup language for everything from medieval manuscripts to memes.\r\n\r\nTEI is more than a format: it’s a collaborative, living standard maintained by an international community of researchers, librarians, and digital humanists. It evolves with the world — adding elements for new text types (like social media posts) and for changing cultural realities (like non-binary gender markers). It embodies open science principles and keeps publishing in the hands of its creators.\r\n\r\nYou don’t need a publisher, a platform, or a big server farm. Just an XML-aware text editor, a few lines of CSS, and maybe a Git repo. From there, you can transform your encoded text into websites, PDFs, e-books — or share it directly in its raw, readable, hackable form. It’s sustainable, transparent, and low-energy. It even challenges the academic prestige economy by making every individual contribution visible — from editors to annotators to script writers.\r\n\r\nIn this talk, we’ll look at text as code and code as culture, from alphabets to XML, and explore how TEI can be a tool for hacking not machines but meaning itself. We’ll end with a practical example: a TEI-encoded page of the first Hacker Bible — because our own history also deserves to be archived, shared, and forked.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "CFCPYS",
      "name": "Torsten Roeder",
      "avatar": "https://cfp.cccv.de/media/avatars/dino_RaA5dRd.png",
      "biography": "Torsten Roeder works at the University of Wurzburg and is specialized on digital heritage research. His work in digital editing and textual history made him a member of the TEI Technical Council. Recently, he started a Retro Computing Lab at his department which is used for studying the digital culture of the 1980s and 1990s. He also holds a PhD in musicology and plays some guitar, and enjoys gardening. Jack of all trades, master of none.",
      "public_name": "Torsten Roeder",
      "guid": "d239daa2-337b-5fd8-acd9-9cf6033bf198",
      "url": "https://cfp.cccv.de/39c3/speaker/CFCPYS/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/8CVJUN/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/8CVJUN/",
  "attachments": []
}