{
  "guid": "ba655198-f461-5a1b-998c-12ed49fc7aae",
  "code": "FT3MEL",
  "id": 2424,
  "date": "2025-12-27T11:00:00+01:00",
  "start": "11:00",
  "duration": "00:40",
  "room": "Zero",
  "slug": "39c3-a-tale-of-two-leaks-how-hackers-breached-the-great",
  "title": "A Tale of Two Leaks: How Hackers Breached the Great Firewall of China",
  "subtitle": null,
  "language": "en",
  "track": "Security",
  "type": "Talk",
  "abstract": "The Great Firewall of China (GFW) is one of, if not arguably the most advanced Internet censorship systems in the world. Because repressive governments generally do not simply publish their censorship rules, the task of determining exactly what is and isn’t allowed falls upon the censorship measurement community, who run experiments over censored networks. In this talk, we’ll discuss two ways censorship measurement has evolved from passive experimentation to active attacks against the Great Firewall.",
  "description": "While probing the Great Firewall’s DNS injection system in 2021, we noticed something strange: Sometimes the injected responses contained weird garbage. After some investigation, we realized we’d stumbled onto a memory disclosure vulnerability that would give us an unprecedented window into the Great Firewall’s internals: Wallbleed.\n\nSo we crafted probes that could leak up to 125 bytes per response and repeatedly sent them for two years. Five billion responses later, the picture that emerged was... concerning. Over 2 million HTTP cookies leaked. Nearly 27,000 URL parameters with passwords. SMTP commands exposing email addresses. We found traffic from RFC 1918 private addresses - suggesting we were seeing the Great Firewall’s own internal network. We saw x86_64 stack frames with ASLR-enabled pointers. We even sent our own tagged traffic into China and later recovered those exact bytes in Wallbleed responses, proving definitively that real user traffic was being exposed.\n\nIn September 2023, the patching began. We watched in real-time as blocks of IP addresses stopped responding to our probes. But naturally the same developers that made this error in the first place made further mistakes. Within hours, we developed “Wallbleed v2” queries that still triggered the leak. The vulnerability persisted for another six months until March 2024.\n\nGFW measurement research went back to business as usual until September of this year when an anonymous source released 600GB of leaked source code, packages, and documentation via Enlace Hacktivista. This data came from Geedge Networks - a company closely connected to the GFW and the related MESA lab. Geedge Networks develops censorship software not only for the GFW but also for other repressive countries such as Pakistan, Myanmar, Kazakhstan, and Ethiopia.\n\nWe will discuss some of our novel findings from the Geedge Networks leak, including new insights about how the leak relates to Wallbleed.\n\nWallbleed and the Geedge Networks leak show that censorship measurement research can be about more than just actively probing censored networks. We hope this talk will be a call to arms for hackers against Internet censorship.\n\n\nMore information about Wallbleed can be found at the GFW Report:\nhttps://gfw.report/publications/ndss25/en/\n",
  "logo": null,
  "persons": [
    {
      "guid": "9d196b74-9458-54dc-af9d-8fe3955fcb0d",
      "name": "Jade Sheffey",
      "public_name": "Jade Sheffey",
      "avatar": "https://cfp.cccv.de/media/avatars/7KTGGW_8rrCU00.webp",
      "biography": "Jade Sheffey is a PhD student at SPIN (University of Massachusetts Amherst) working on Internet censorship measurement and circumvention. She was a contributing author to \"Wallbleed: A Memory Disclosure Vulnerability in the Great Firewall of China\", and is currently researching other leaks from the Great Leaky Dam of China. After a long day of analyzing packets and data leaks for work, Jade goes home and analyzes packets and data leaks for fun.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_9d196b74-9458-54dc-af9d-8fe3955fcb0d"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/a-tale-of-two-leaks-how-hackers-breached-the-great",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/FT3MEL/"
}