{
  "guid": "c20cbaea-51ca-462f-a058-af7d39473d29",
  "code": null,
  "id": 205146,
  "date": "2025-12-30T01:00:00+01:00",
  "start": "01:00",
  "duration": "00:50",
  "room": "SoS Saal 6",
  "slug": "39c3-reform-des-nachrichtendienstrechts-austausch-uber-",
  "title": "Reform des Nachrichtendienstrechts: Austausch über präventive Schutzkonzepte für hochgefährdete Personen",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "other",
  "abstract": "",
  "description": "Die deutsche Bundesregierung plant aktuell die Reform des Nachrichtendienstrechts. Was bei der medialen Aufregung oft unerwähnt bleibt: Die neuen Regelungen spielen mit Feuer mit Leib und Leben höchstgefährdeter Personen.\n\nDas Problem: Ein ex post Rechtsschutz kommt meistens zu spät, nachdem der gravierende Schaden bereits eingetreten ist. Das bedeutet, der Schadensfall muss bereits ex ante durch präventive Schutzkonzepte und Handlungsvorschläge möglichst verhindert werden.\n\nIn einer Austauschsession soll besprochen werden, wie mögliche Handlungsvorschläge, Standards und policy-Entwürfe für ex ante Schutzkonzepte und möglichst effizienten Rechtsschutz im Eilfall entwickelt und verbreitet werden können. Zielgruppe sind nicht nur Jurist:innen, sondern insbesondere auch gefährdete Personen und solche, die mit ihnen zusammenarbeiten (insb. Journalist:innen, Anwält:innen, etc).\n\nDie Organisationskreatur ist Jurastudi in Examensvorbereitung.\n",
  "logo": null,
  "persons": [
    {
      "guid": "36f11832-3d42-46d6-a47d-fbd26ae6d603",
      "name": "eugene (he/him)",
      "public_name": "eugene (he/him)",
      "avatar": null,
      "biography": "Just a dude trying to learn more about cyber security. Always open to meet new people in the community. Memes about adhd and/or academia are highly appreciated. When not @39c3, I‘m finishing my law degee.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/eugene"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/reform-des-nachrichtendienstrechts-austausch-uber-",
  "links": []
}