{
  "guid": "c216b3d6-9937-521f-a7ff-85dbb9e94d07",
  "code": "Y99YJ7",
  "id": 83786,
  "date": "2025-12-27T16:00:00+01:00",
  "start": "16:00",
  "duration": "00:45",
  "room": "Sendezentrum Bühne (Saal X 07)",
  "slug": "39c3-c-t-uplink-digitale-souvernitt-sind-hcker-innen-jetzt-frs-staatswohl-verantwortlich",
  "title": "c’t uplink: Digitale Souveränität – sind Häcker:innen jetzt fürs Staatswohl verantwortlich?",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "Live-Podcast Bühne",
  "abstract": "Spätestens seitdem Donald Trump wieder im Weißen Haus sitzt, geistert die „Digitale Souveränität“ verstärkt durch die politischen Diskussionen. Wir haben mittlerweile ein Zentrum dafür (ZenDiS) und einen Fonds, der sich zur Agentur gemausert hat (Sovereign Tech Fund/Agency). Aber ist jetzt das Schlagwort Digitale Souveränität der Türöffner für mehr Open-Source-Software in Behörden, Verwaltungen, Schulen und anderen öffentlichen Einrichtungen, oder erweist sich das als Bumerang? Sind Big Tech, die doch viel in Linux und Open Source investieren, wirklich das Problem?",
  "description": "In dieser Sonderfolge des c’t uplink blicken wir kritisch auf den Begriff Digitale Souveränität und diskutieren, welche Konzepte sich dahinter verbergen. Wir sprechen darüber, ob und warum gerade die Community den Karren aus dem Dreck ziehen soll. Außerdem schauen wir, warum es nur so langsam vorwärts geht mit freier Software in öffentlicher Hand und welche Lösungswege es gibt oder geben könnte.\n\nGäste (u.a.):\n- Anne Roth, Referentin Digitalpolitik im Bundestag\n- Bonnie Mehring, Senior-Projekt-Managerin Free Software Foundation Europe\n- Sven Neuhaus, Tech Lead Open-Source-Produkte, Zentrum Digitale Souveränität\n",
  "logo": "https://pretalx.c3voc.de/media/39c3-sendezentrum/submissions/Y99YJ7/Podcast_uplink_16_9_7F22NMv.jpg",
  "persons": [
    {
      "guid": "c68cba7c-8d09-50fd-b322-57d56b439145",
      "name": "Keywan Tonekaboni | c’t uplink",
      "public_name": "Keywan Tonekaboni | c’t uplink",
      "avatar": "https://pretalx.c3voc.de/media/avatars/KF3MKT_5ejjKdu.jpg",
      "biography": "Keywan Tonekaboni ist Technikjournalist und Redakteur bei der c’t und heise online. Dort schreibt er vor allem über Linux, Distributionen und Apps für den Linux-Desktop. Außerdem befasst er sich mit Entwicklungen freier Software allgemein, Themen wie digitale Souveränität, Open Source in Behörden und dem Einfluss von Technik auf die Gesellschaft.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_c68cba7c-8d09-50fd-b322-57d56b439145"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/c-t-uplink-digitale-souvernitt-sind-hcker-innen-jetzt-frs-staatswohl-verantwortlich",
  "links": [],
  "origin_url": "https://pretalx.c3voc.de/39c3-sendezentrum/talk/Y99YJ7/",
  "feedback_url": "https://pretalx.c3voc.de/39c3-sendezentrum/talk/Y99YJ7/feedback/"
}