{
  "guid": "c99513e3-06f5-5b86-86be-37e239db92fb",
  "code": "KCVEJK",
  "id": 83758,
  "date": "2025-12-29T20:30:00+01:00",
  "start": "20:30",
  "duration": "01:30",
  "room": "Sendezentrum Bühne (Saal X 07)",
  "slug": "39c3-denkangebot-rainer-mhlhoff-ber-ki-und-autoritre-sehnschte-im-silicon-valley",
  "title": "Denkangebot: Rainer Mühlhoff über KI und autoritäre Sehnsüchte im Silicon Valley",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "Live-Podcast Bühne (lang)",
  "abstract": "Der Hype um künstliche Intelligenz ist allgegenwärtig. Selbst Donald Trump postet KI-generierte Videos, in denen er sich wahlweise als Rockstar oder Kampfjetpilot inszeniert. Elon Musk prahlte öffentlich damit, dass in seinem \"Department of Goverment Efficiency\" der soziale Kahlschlag mit Unterstützung Künstlicher Intelligenz vorangetrieben wird. Und Peter Thiel meint allen ernstes, KI-Regulierung und das Erscheinen des Antichristen gingen Hand in Hand. Müssen wir uns Sorgen machen?",
  "description": "Rainer Mühlhoff ist Professor für Ethik und kritische Theorien der Künstlichen Intelligenz an der Universität Osnabrück. In seinem kürzlich erschienen Buch \"Künstliche Intelligenz und der neue Faschismus\" setzt er sich kritisch mit dem KI-Hype auseinander. Und er erklärt, welche toxischen Ideologien zentraler Akteure aus dem Silicon Valley Menschen empfänglich für autoritäre Gesellschaftsbilder machen.\n\nWir sprechen über die Zyklen von KI-Hypes, das problematische Narrativ vom \"Bürokratieabbau durch AI\" und die Funktion apokalyptischer Zukunftsvisionen. Vor allem aber will ich von Rainer wissen: Welche Bedeutung haben bei dieser Debatte die in Teilen des Silicon Valley einflussreichen ideologischen Strömungen – von radikalem Cyberlibertarismus über Longtermismus bis hin zum \"Dark Enlightment\"?\n",
  "logo": "https://pretalx.c3voc.de/media/39c3-sendezentrum/submissions/KCVEJK/denkangebot_cover_3000px_9IwopQx.jpg",
  "persons": [
    {
      "guid": "a8991e85-b553-5ed0-bc66-c219d3d8ba2f",
      "name": "Katharina Nocun",
      "public_name": "Katharina Nocun",
      "avatar": "https://cfp.cccv.de/media/avatars/HR8WJ8_r7IGrTs.jpg",
      "biography": "Katharina Nocun ist Publizistin und Politik- und Wirtschaftswissenschaftlerin. In ihrer Arbeit setzt sie sich vor allem mit dem Spannungsfeld Digitalisierung und Demokratie auseinander. Ihr Podcast Denkangebot war 2020 für den Grimme Online Award nominiert. Ihr erstes Buch \"Die Daten, die ich rief\" (2018) behandelt das Thema Digitalisierung und Demokratie. 2020 erschien der Bestseller \"Fake Facts – Wie Verschwörungstheorien unser Denken bestimmen\" (gemeinsam wie alle nachfolgenden mit Pia Lamberty). 2021 folgte \"True Facts – was gegen Verschwörungserzählungen wirklich hilft\" und 2022 \"Gefährlicher Glaube – Die radikale Gedankenwelt der Esoterik\". Für ihre publizistische Tätigkeit wurde Nocun 2017 mit dem Marburger Leuchtfeuer und 2023 mit dem Madsack Award ausgezeichnet.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_a8991e85-b553-5ed0-bc66-c219d3d8ba2f"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/denkangebot-rainer-mhlhoff-ber-ki-und-autoritre-sehnschte-im-silicon-valley",
  "links": [],
  "origin_url": "https://pretalx.c3voc.de/39c3-sendezentrum/talk/KCVEJK/",
  "feedback_url": "https://pretalx.c3voc.de/39c3-sendezentrum/talk/KCVEJK/feedback/"
}