{
  "guid": "cc2dc346-c1fc-58ad-a723-8472c9a8e5d1",
  "code": "TPSDAQ",
  "id": 1682,
  "logo": "https://cfp.cccv.de/media/39c3/submissions/TPSDAQ/Bridges_Kammerorchester__Salar_Baygan_Ko_B80CQb9.jpg",
  "date": "2025-12-29T19:15:00+01:00",
  "start": "19:15",
  "duration": "01:30",
  "room": "Zero",
  "slug": "39c3-1682-transkultureller-hack-auf-die-klassische-musikszene-vortrag-und-konzert",
  "url": "https://cfp.cccv.de/39c3/talk/TPSDAQ/",
  "title": "Transkultureller Hack auf die klassische Musikszene – Vortrag und Konzert",
  "subtitle": "",
  "track": "Art & Beauty",
  "type": "Talk",
  "language": "de",
  "abstract": "Das Bridges Kammerorchester hackt die klassische Musikszene, indem es die Regeln des traditionellen Konzertbetriebs aufbricht: Musiker*innen mit und ohne Flucht- und Migrationsbiografie bringen Instrumente wie Oud, Tar, Kamanche oder Daf in die europäische Orchestertradition. Statt überwiegend Werke verstorbener männlicher, europäischer Komponisten zu spielen, komponieren die Mitglieder ihre Musik selbst – ein radikaler Perspektivwechsel hin zu Vielfalt und Selbstbestimmung. Im Vortrag zeigen sie anhand von Hörbeispielen und persönlichen Geschichten, wie diese Hacks entstehen und machen im Anschluss in einem Konzert die musikalische Vielfalt live erlebbar.",
  "description": "Das transkulturelle Bridges Kammerorchester hackt die klassische Musikszene: es bringt Musizierende mit und ohne Flucht- und Migrationsbiografie zusammen und integriert Instrumente und Musikstile in die europäische Orchestertradition, die dort traditionell nicht vorgesehen sind. Neben klassischen Orchesterinstrumenten spielen Instrumente wie Oud, Tar, Tiple, Kaval, Kamanche, Shudraga, Daf und Riq zentrale Rollen.\r\n\r\nIhre Musik komponieren die Orchestermitglieder überwiegend selbst. Auch das ist ein Hack auf die klassische Musikszene, die bisher überwiegend Werke verstorbener männlicher Komponisten interpretiert. So steht die Musik des Bridges Kammerorchester für Vielfalt und Selbstbestimmung und macht die Diversität der in Deutschland lebenden Gesellschaft hörbar. \r\nIm Vortrag zeigen Mitglieder des Bridges Kammerorchesters anhand von Erfahrungen und Hörbeispielen – live und per Video – wie sie die klassische Musikszene hacken. Sie geben Einblicke in ihren kollektiven, heterogenen Kompositionsprozess, berichten von Freiheiten, Herausforderungen und Erfahrungen mit Publikum und Veranstaltern. Persönliche Migrationsgeschichten verdeutlichen, wie diese die musikalische Perspektive und Identität des Orchesters prägen. Anschließend folgt ein Konzert, das die Vielfalt ihrer Musik erlebbar macht.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "78FGTK",
      "name": "Johanna-Leonore Dahlhoff",
      "avatar": "https://cfp.cccv.de/media/avatars/78FGTK_rPVe2Rq.jpg",
      "biography": "Johanna-Leonore Dahlhoff ist Flötistin und Komponistin sowie Gründerin, Künstlerische Leiterin und Geschäftsführerin des transkulturellen Bridges Kammerorchester in Frankfurt. Sie arrangiert und komponiert transkulturelle Werke für Orchester und konzertiert weltweit.",
      "public_name": "Johanna-Leonore Dahlhoff",
      "guid": "b99572da-92e9-543f-b6d2-fd30812104dd",
      "url": "https://cfp.cccv.de/39c3/speaker/78FGTK/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/TPSDAQ/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/TPSDAQ/",
  "attachments": []
}