{
  "guid": "cd3af7ee-3204-5404-8714-f18d33f08bd8",
  "code": "9YBCSL",
  "id": 1891,
  "logo": null,
  "date": "2025-12-29T12:50:00+01:00",
  "start": "12:50",
  "duration": "00:40",
  "room": "Ground",
  "slug": "39c3-1891-teckids-eine-verstehbare-digitale-welt",
  "url": "https://cfp.cccv.de/39c3/talk/9YBCSL/",
  "title": "Teckids – eine verstehbare (digitale) Welt",
  "subtitle": "",
  "track": "CCC & Community",
  "type": "Talk",
  "language": "de",
  "abstract": "Die Teckids-Gemeinschaft bringt Kinder, Jugendliche und Erwachsene zusammen, um gemeinsam aktiv für eine verstehbare (digitale) Welt zu sein.",
  "description": "Bei Teckids geht es nicht \"nur\" um Technikbasteln und Programmieren mit Kindern, sondern darum, mit anderen, für andere, bei Events und gesellschaftlich aktiv zu werden.\r\n\r\nIn letzter Zeit haben wir viele Projekte dafür unternommen. Unter anderem haben wir den neuen Themen-Slot \"Jung und überwacht\" bei den BigBrotherAwards 2025 gestaltet und bereiten Jugendthemen für das nächste Jahr vor. Zum zweiten Mal laden wir beim 39c3 Kinder beim Fairydust-Türöffner-Tag \"hinter die Kulissen\" der Chaos-Teams ein.\r\n\r\nUnser Slogan mit dem etwas merkwürdigen Wort \"Verstehbarkeit\" steht dafür, dass alle nicht nur die Fähigkeiten, sondern auch das Recht behalten sollen, mit ihrer Technik zu machen, was sie wollen, und alles zu hinterfragen und zu verstehen. Dafür wollen wir noch mehr junge Menschen und auch Erwachsene erreichen.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "RDNA9C",
      "name": "Keno",
      "avatar": "https://cfp.cccv.de/media/avatars/RDNA9C_ElsYTK5.png",
      "biography": "Ich heiße Keno, bin 11 Jahre alt und bin aktives Mitglied in der Teckids-Gemeinschaft.\r\n\r\nSeit über zwei Jahren bin ich als eines der jüngsten Mitglieder bei Teckids aktiv und beschäftige mich mit vielen Themen, sowohl tecnisch als auch pädagogisch und didaktisch. Ich habe schon mehrere Workshops und Vorträge gehalten und gestalte fast alles in der Gemeinschaft mit – zuletzt einen Kreativbeitrag auf der Bühne der BigBrotherAwards. Im Moment lerne ich, neue Kinder in der Gemeinschaft zu begleiten.\r\n\r\nAuf dem 39c3 leite ich auch Workshops zu [Luanti (Minetest)](https://luanti.org) im Kidspace.",
      "public_name": "Keno",
      "guid": "a1f2b088-e43f-5870-9567-d25b01294e3f",
      "url": "https://cfp.cccv.de/39c3/speaker/RDNA9C/"
    },
    {
      "code": "LJETT9",
      "name": "Darius Auding",
      "avatar": null,
      "biography": "Hallo, mein Name ist Darius und ich bin seit ungefähr drei Jahren aktives Mitglied der Teckids-Gemeinschaft.\r\n\r\nMein Hauptgebiet sind Workshops; ich leite selber Workshops zu verschiedenen Coding-Themen und helfe auch anderen Kindern und Jugendlichen in der Teckids-Gemeinschaft dabei, Workshops vorzubereiten und durchzuführen.",
      "public_name": "Darius Auding",
      "guid": "48ceced7-15ca-5fb5-968b-c943873a4ca3",
      "url": "https://cfp.cccv.de/39c3/speaker/LJETT9/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/9YBCSL/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/9YBCSL/",
  "attachments": []
}