{
  "guid": "d08f6f41-a731-57f7-ba40-8f38464f2dcd",
  "code": "SRRFPA",
  "id": 1266,
  "logo": "https://cfp.cccv.de/media/39c3/submissions/SRRFPA/Screenshot_2025-11-30_164521_vP9NSli_gd_SdKd33W.webp",
  "date": "2025-12-28T20:10:00+01:00",
  "start": "20:10",
  "duration": "00:40",
  "room": "Zero",
  "slug": "39c3-1266-prometheus-reverse-engineering-overwatch",
  "url": "https://cfp.cccv.de/39c3/talk/SRRFPA/",
  "title": "Prometheus: Reverse-Engineering Overwatch",
  "subtitle": "",
  "track": "Hardware",
  "type": "Talk",
  "language": "en",
  "abstract": "This talk explores the internals of Overwatch which make the game work under the hood. \r\n\r\nThe end goal is to democratise development of Overwatch. Being able to host your own servers and modify the game client to your liking should not be up for discussion for a game many people have paid money for.",
  "description": "Hey you! Yes you! Do you want to pay for a game which gets forcibly taken away from you after only six years? Do you want to buy lootboxes in order to unlock cosmetics faster in the game you „own“?\r\n\r\nOverwatch 1 was released in 2016 to critical acclaim and millions of sales globally. It has permanently changed the hero-shooter landscape which was in much need of a fresh new game and playstyle. After a few hard years plagued with infrequent updates, long overdue hero nerfs / reworks and broken promises, Overwatch 1 was finally taken offline on October 3, 2022.\r\n\r\nEver since I started playing Overwatch I was fascinated by the game and it’s proprietary engine, Tank. Not much is known about it, only that core components were reused from the cancelled Blizzard IP, Titan. It’s a shame that this game (engine) is not getting the recognition it deserves. From the entity-component architecture to the deterministic graph based scripting engine which handles (almost) everything which happens ingame, it is a truly refreshing take on networking and game programming rarely seen in games. So, considering this, building a game server from scratch can’t be that hard, riiiight?\r\n\r\nJoin me in this documentation of my gradual descent into madness while I (jokingly) roast Overwatch developers for code which they probably do not even remember that theyve written 10+ years ago :)\r\n\r\nAll research presented in this talk was done on the first archived, still publicly available version which I could find, 0.8.0.0 Beta (0.8.24919), which got uploaded to archive.org.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "QFENQU",
      "name": "breakingbread",
      "avatar": "https://cfp.cccv.de/media/avatars/QFENQU_mYzMGP5.webp",
      "biography": "Hi!\r\n\r\nComputers have been a life-long hobby of mine. I have been programming for 9 years (and professionally for the past 3 years). Disassembling hardware and software has always been a great interest of mine. Thats probably why half of the stuff I own doesnt work properly anymore... But hey, at least I know how it works... :)\r\n\r\nYou can probably find me in a talk or walk aimlessly around the convention space, say hi if you have any questions! I dont (usually) bite :p\r\n\r\nFor any inquires please contact me via email: contact@breakingbread.at",
      "public_name": "breakingbread",
      "guid": "9ce1d702-f997-5fb3-9b64-30d8368281c0",
      "url": "https://cfp.cccv.de/39c3/speaker/QFENQU/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/SRRFPA/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/SRRFPA/",
  "attachments": []
}