{
  "guid": "d1a92d77-d8c6-524e-ba32-d2e9547723e0",
  "code": "37HY7V",
  "id": 1792,
  "date": "2025-12-28T12:15:00+01:00",
  "start": "12:15",
  "duration": "01:00",
  "room": "Ground",
  "slug": "39c3-suing-spyware-in-europe-news-from-the-front",
  "title": "Suing spyware in Europe: news from the front!",
  "subtitle": null,
  "language": "en",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "abstract": "In 2022, CitizenLab contacted a member of the Spanish non-profit Irídia to tell them that one of their members had likely been hacked with Pegasus spyware. The target, a lawyer, had been spied on by the Spanish government in 2020 because he represented a Catalan politician who was in prison. His phone was infected with Pegasus during the COVID-19 lockdown, on the same day he was having an online meeting with other lawyers working on the case.\r\n\r\nIrídia and the lawyer (Andreu) decided to take the case to court. A few years later, he met with Data Rights and invited them to join forces and bring in partners from across Europe to increase the impact. This collaboration led to the creation of the PEGA coalition in May 2025.\r\n\r\nThis talk goes over the status of the case and work we have done across Europe to bring spyware use in court.",
  "description": "Despite the European Parliament’s PEGA investigation in 2023, spyware scandals in Europe continue to grow, with little real action to stop or address them. Many EU countries were — or still are — clients of the world’s major spyware companies. As a result, nothing changes except the number of victims targeted by these technologies. Worst, offices or clients in the EU is useful for spyware companies' sales pitch. So, the EU is a growing hub for this ominous ecosystem! With no real political will to act, members of the PEGA investigation say the only hope for change is to take these cases to court — and that’s exactly the path we’ve chosen!\n\nIrídia’s case is one of the flagship cases in the EU, both for its depth and for what it has achieved so far. We will review the current status and implications of the case, examining issues that range from state responsibility to the role of the spyware company behind Pegasus — in its creation, sale, and export — which maintains a strong presence within the EU.\n\nAfter that, we will take a step back to look at what is happening across Europe. We will highlight the most significant cases currently moving forward, as well as some of the PEGA coalition’s strategies for driving accountability, strengthening safeguards, and ensuring remedies. The coalition’s mission goes beyond legal action — it aims to prevent the devastating impact of spyware and push for systemic change.\n",
  "logo": null,
  "persons": [
    {
      "guid": "58da2197-1abf-52fc-8865-d0fe0f06af6b",
      "name": "Lori Roussey",
      "public_name": "Lori Roussey",
      "avatar": "https://cfp.cccv.de/media/avatars/Gravatar_pic_xRrYBr1.png",
      "biography": "Lori Roussey is a data protection law and policy specialist. She focuses on public private partnerships litigation as well as new technologies regulation. Lori has experience as the Data Protection Officer of a major humanitarian organisation and is now the Founder and Director of Data Rights, a litigation and advocacy non-profit focused on surveillance, sustainability, and interoperability.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_58da2197-1abf-52fc-8865-d0fe0f06af6b"
    },
    {
      "guid": "62ca8c3c-1a12-5592-980d-9d6e5ef3d18f",
      "name": "Celia/Irídia",
      "public_name": "Celia/Irídia",
      "avatar": null,
      "biography": null,
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_62ca8c3c-1a12-5592-980d-9d6e5ef3d18f"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/suing-spyware-in-europe-news-from-the-front",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/37HY7V/"
}