{
  "guid": "d2380674-d290-41b5-b306-1372d6360e18",
  "code": null,
  "id": 238067,
  "date": "2025-12-30T01:00:00+01:00",
  "start": "01:00",
  "duration": "01:20",
  "room": "Komonin",
  "slug": "39c3-we-are-battlefields-film-mathieu-rigouste2024-das-",
  "title": "\"We are the Battlefields\" (Film: Mathieu Rigouste/2024) - Das Globale Geschäft mit Krieg und Kontrolle / Genre: Dokumentation / Reportage",
  "subtitle": null,
  "language": "en, de",
  "track": null,
  "type": "other",
  "abstract": "",
  "description": "CN: oppression, violance, repression\n\n“Since the early 2000s, I've been investigating oppressive security and surveillance systems oppressive security and surveillance systems while actively engaging with activism and political while actively engaging with activism and political\nmovements. Because of this, I've been put on movements. Because of this, I've been put on a watch-list by the French government’s government’s intelligence services.\n\nI believe that we need to better understand, to understand the control and crushing power forced upon us, the people, by the war machine. My determination to people, by the war machine. My determination to fight against these powers led me to go and fight against these powers led me to go and investigate the problem at the heart of the French investigate the problem at the heart of the French\nwar machine – Milipol – the world's leading trade war machine – Milipol – the world's leading trade fair for internal state security.\n\nFollow me behind the scenes of this global business. Together, we'll investigate the making of business. Together, we'll investigate the making of wars, the globalization of surveillance and the wars, the globalization of surveillance and the\nbusiness of repression.\n\nThe aim of this investigation is to shed light on the inner workings of a system by letting its main inner workings of a system by letting its main players tell their own stories, face-to-face with the players tell their own stories, face-to-face with the camera. We will reflect on our findings with camera. We will reflect on our findings with the help of those who suffer at the hands of the military industrial complex on a daily basis and military industrial complex on a daily basis and who are constantly fighting it in order to exist.\n\nThroughout our investigation, we question our participation in systems and the order of things in the world. Similarly, we question our ability to the world. Similarly, we question our ability to preserve and transform ourselves. \nIn the reflection of the war machine, we face ourselves and what we want to become.\"\nMathieu Rigouste - investigative journalist / filmmaker\n\nhttps://mathieurigouste.net/-Nous-sommes-des-champs-de-bataille-\n",
  "logo": null,
  "persons": [],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/we-are-battlefields-film-mathieu-rigouste2024-das-",
  "links": []
}