{
  "guid": "d3c7f85f-35b3-48af-92e3-4295130eb30b",
  "code": null,
  "id": 378535,
  "date": "2025-12-29T12:30:00+01:00",
  "start": "12:30",
  "duration": "00:50",
  "room": "Komonin",
  "slug": "39c3-die-waffen-nieder-im-westen-nichts-neues-runaround",
  "title": "\"Die Waffen nieder (1889)\", \"Im Westen nichts Neues (1929)\" & \"Runaround (1942)\"",
  "subtitle": null,
  "language": "de, en",
  "track": null,
  "type": "other",
  "abstract": "",
  "description": "In 1889, peace activist and pioneer of international peace work Berta von Suttner published the novel ‘Lay Down Your Arms' in what was then the Austro-Hungarian Empire.\n\nIn 1929, Erich Maria Remarque published his work ‘All Quiet on the Western Front' in Germany during the Weimar Republic. Both remain important works of anti-war literature to this day.\n\nIn 1942, Isaac Asimov wrote in ‘Runaround’ in the fictional handbook for robotics:\n\n\"1. A robot may not injure a human being or, through inaction, allow a human being to come to harm.\n2. A robot must obey the orders given to it by human beings except where such orders would conflict with the First Law.\n3. A robot must protect its own existence as long as such protection does not conflict with the First or Second Law.\"\n\nAre you familiar with any of these works? All of them? Others? What aspects of them are still relevant today? What can contemporary peace activism learn from them? Where is an update needed? What does peace activism look like when it incorporates modern machines, AI and the digital sphere? What works and initiatives do you know of that emerged after the Second World War and have had an impact on you?\n\nIn this session, I would like to invite you to join me in thinking about how we can stand up for peaceful conflict resolution and work for peace in our various professional disciplines and spheres of life in 2026+ in the face of ongoing warmongering and armament.\n\nWhat does your current peace practice look like? What examples of successful peace initiatives or anti-war art do you know? What is the current state of the transnational (and digitally connected) peace movement? And: How do we protect ourselves and others from repression and attacks by divisive forces and warmongers?\n\nFor several years now, I have been working intensively on the topic of peace and have designed a seminar on this topic this summer, from which I am happy to contribute preliminary work and insights to this session, if you are interested: https://www.udk-berlin.de/studium/studium-generale/lehrveranstaltungen-des-studium-generale/archiv-der-lehrveranstaltungen-des-studium-generale/archiv-sommersemester-2025/seminare-kulturwissenschaft-sose-2025/ peace-art-and-you-on-the-aesthetics-didactics-and-pedagogy-of-cultures-of-peace/\n\nLay Down Your Arms!\n\nTranslated with DeepL.com (free version)\n",
  "logo": null,
  "persons": [
    {
      "guid": "e700c679-6b1e-4103-a70e-346758d066cb",
      "name": "Tomate_aka_Radikale_Liebe",
      "public_name": "Tomate_aka_Radikale_Liebe",
      "avatar": null,
      "biography": null,
      "url": "https://events.ccc.de/congress/2025/hub/user/tomate_aka_radikale_liebe"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/die-waffen-nieder-im-westen-nichts-neues-runaround",
  "links": []
}