{
  "guid": "d743f89d-684b-5a29-a0e1-4b788caa4255",
  "code": "WDE9LR",
  "id": 2191,
  "logo": "https://cfp.cccv.de/media/39c3/submissions/WDE9LR/antiwarAI_ROD5BYp.png",
  "date": "2025-12-27T23:00:00+01:00",
  "start": "23:00",
  "duration": "00:40",
  "room": "Fuse",
  "slug": "39c3-2191-coding-dissent-art-technology-and-tactical-media",
  "url": "https://cfp.cccv.de/39c3/talk/WDE9LR/",
  "title": "Coding Dissent: Art, Technology, and Tactical Media",
  "subtitle": "",
  "track": "Art & Beauty",
  "type": "Talk",
  "language": "en",
  "abstract": "This presentation examines artistic practices that engage with sociotechnical systems through tactical interventions. The talk proposes art as a form of infrastructural critique and counter-technology. It also introduces a forthcoming HackLab designed to foster collaborative development of open-source tools addressing digital authoritarianism, surveillance capitalism, propaganda infrastructures, and ideological warfare.",
  "description": "In this talk, media artist and curator Helena Nikonole presents her work at the intersection of art, activism, and tactical technology — including interventions into surveillance systems, wearable mesh networks for off-grid communication, and AI-generated propaganda sabotage.\r\n\r\nFeaturing projects like Antiwar AI, the 868labs initiative, and the curatorial project Digital Resistance, the talk explores how art can do more than just comment on sociotechnical systems — it can interfere, infiltrate, and subvert them.\r\n\r\nThis is about prototypes as politics, networked interventions as civil disobedience, and media hacks as tools of strategic refusal. The talk asks: what happens when art stops decorating crisis and starts debugging it?\r\n\r\nThe talk will also introduce an upcoming HackLab initiative — a collaboration-in-progress that brings together artists, hackers, and activists to develop open-source tools for disruption, resilience, and collective agency — and invites potential collaborators to get involved.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "7BXDVF",
      "name": "Helena Nikonole",
      "avatar": "https://cfp.cccv.de/media/avatars/7BXDVF_n7bCiYc.png",
      "biography": "Helena Nikonole is a new media artist, independent curator, researcher, and educator based between Berlin and Istanbul. Her fields of interest include AI, hacktivism, hybrid art, and biosemiotics. She is the co-founder of 868labs — a Berlin-based collective developing tactical tools for decentralized, off-grid communication. One part of her practice is dedicated to utopian scenarios of a post-human future and art as innovation, while another focuses on the dystopian present and a critical approach to technology. She is currently pursuing a PhD on LLMs and political ideologies at the University of Applied Arts Vienna.",
      "public_name": "Helena Nikonole",
      "guid": "0f68b666-071d-5c5c-b6de-658473923b22",
      "url": "https://cfp.cccv.de/39c3/speaker/7BXDVF/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/WDE9LR/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/WDE9LR/",
  "attachments": []
}