{
  "guid": "da757f47-1606-55eb-8bd1-3dec1cb1b69e",
  "code": "9CXV8W",
  "id": 757471,
  "date": "2025-12-27T11:15:00+01:00",
  "start": "11:15",
  "duration": "01:00",
  "room": "Stonewall IO (Saal Y 06)",
  "slug": "39c3-lets-talk-entspannt-neue-kontakte-knupfen",
  "title": "Let’s Talk! Entspannt neue Kontakte knüpfen [FLINTA* only]",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "Workshop",
  "abstract": "Du möchtest auf dem 39C3 neue Leute kennenlernen? In entspannter Runde erhältst du praktische Tipps für den Einstieg und spannende Gespräche. Willkommen sind alle – egal, ob schüchtern oder gesprächig! Offen für: FLINTA",
  "description": "Auf den ersten Blick sind Veranstaltungen wie der 39C3 eine super Gelegenheit, Gleichgesinnte kennenzulernen und den eigenen Freundeskreis zu erweitern.\nIn der Praxis ist das aber oft gar nicht so einfach, wie es klingt. Vielleicht habt ihr euch auch schon einmal gefragt:\n- Ist es eigentlich okay, andere einfach so anzusprechen?\n- Mit welchen Fragen gelingt der Gesprächseinstieg?\n- Wie bleibt ein Gespräch für beide Seiten interessant?\n\nIn diesem Workshop verfolgen wir zwei Ziele:\n1. Ihr lernt euch in lockerer Atmosphäre untereinander kennen und habt somit schon einmal ein paar bekannte Gesichter auf dem Kongress dazugewonnen.\n2. Ihr bekommt praktisches Handwerkszeug, das es euch erleichtert, auf dem Kongress (und darüber hinaus) Gespräche mit euch unbekannten Personen zu starten und zu führen.\n\nUnd natürlich soll der Spaß dabei nicht zu kurz kommen!\nEgal, ob ihr eher schüchtern oder extrovertiert seid – bei diesem Workshop seid ihr herzlich willkommen.\n\nOffen für: FLINTA\n",
  "logo": null,
  "persons": [
    {
      "guid": "49b6f48e-42c8-5fd6-9cf3-9f8993bc9c60",
      "name": "Gigi",
      "public_name": "Gigi",
      "avatar": null,
      "biography": "Gigi beschäftigt sich seit vielen Jahren mit Kommunikation, Gruppendynamik und zwischenmenschlichem Austausch. Sie liebt es, Räume für Begegnung und Vernetzung zu schaffen – ob auf Kongressen, in Workshops oder im Alltag. Ihr Ziel: Hemmschwellen abbauen und echte Verbindungen ermöglichen.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_49b6f48e-42c8-5fd6-9cf3-9f8993bc9c60"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/lets-talk-entspannt-neue-kontakte-knupfen",
  "links": [],
  "origin_url": "https://pretalx.c3voc.de/39c3-haecksen-workshops-2025/talk/9CXV8W/",
  "feedback_url": "https://pretalx.c3voc.de/39c3-haecksen-workshops-2025/talk/9CXV8W/feedback/"
}