{
  "guid": "e03b0c7a-1b46-4a3f-92a3-ae5138ad595c",
  "code": null,
  "id": 30714,
  "date": "2025-12-28T18:00:00+01:00",
  "start": "18:00",
  "duration": "00:50",
  "room": "Komonin",
  "slug": "39c3-nach-der-revolte-ein-reisebericht-zu-uberwachung-u",
  "title": "nach der Revolte. Ein Reisebericht zu Überwachung und Widerstand in Hongkong",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "other",
  "abstract": "",
  "description": "Während wir uns auf dem 37C3 noch begeistert Aktionsstrategien der Hongkonger Demokratiebewegung abgeguckt haben, sind mittlerweile eine halbe Million HongkongerInnen ausgewandert, geflohen, oder im Knast. Seit dem Niederschlagen des Aufstands und der Installation des Nationalen Sicherheitsgesetzes hört man aus der Stadt nicht mehr viel. Wer ist da noch? Wie weit ist ein chinesischer Überwachungsstaat installiert? Und wie gehen Menschen mit der neuen Wirklichkeit um? Um diese Fragen zu beantworten, bin ich für ein halbes Jahr nach Hongkong gezogen. Das Buch „nach der Revolte“ (Alibri Verlag, Februar 2026) bietet Einblicke in die politische Gegenwart vor Ort, durch Gespräche mit HongkongerInnen, dem Nachzeichnen der technopolitischen Veränderungen der letzten Jahre, und dem Beschreiben von Alltag in einer Stadt, die so tut, als sei gar nichts passiert. Das Ganze ergibt ein Bild – von Resilienz und Ohnmacht, und von der Fragilität von Systemen, in denen schon ein, zwei Updates reichen, um eine Gesellschaft gänzlich zu ändern.\n\n„Im Film La Haine wird die Geschichte eines Mannes erzählt, der aus dem 50. Stock fällt und sich dabei immer wieder sagt: Bis hierher lief’s noch ganz gut. Das sind wir, wenn wir denken, dass unsere Gesellschaftsordnung grundsätzlich eine ist, die unsere politischen Freiheiten hält. Das Gegenteil ist der Fall. Nichts an dieser Ordnung schützt sie, außer die temporäre, arrogante Blindheit vor dem eigenen Aufprall.“\n",
  "logo": null,
  "persons": [
    {
      "guid": "cb63ea65-7633-4468-9896-d409220a479c",
      "name": "penny",
      "public_name": "penny",
      "avatar": null,
      "biography": null,
      "url": "https://events.ccc.de/congress/2025/hub/user/penny"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/nach-der-revolte-ein-reisebericht-zu-uberwachung-u",
  "links": []
}