{
  "guid": "e401c6b3-e8bb-4142-87e5-10510379dbf7",
  "code": null,
  "id": 401638,
  "date": "2025-12-29T16:00:00+01:00",
  "start": "16:00",
  "duration": "01:00",
  "room": "Komonin",
  "slug": "39c3-gesprachsrunde-zum-umgang-linksradikaler-und-anarc",
  "title": "Gesprächsrunde zum Umgang linksradikaler und anarchistischer Kontexte mit \"Social Media\"",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "other",
  "abstract": "",
  "description": "Instagram, Facebook, TikTok und co sind aus linker und/oder herrschaftskritischer Perspektive hoch problematisch. In a Nutshell lassen sich diese Dienste im Grunde zusammenfassen als digitale Designerdrogen mit einem Algorithmus der auf maximale Suchterzeugung optimiert ist. Im Grunde eines der ethisch fragwürdigsten Produkte die der Kapitalismus des 21. Jahrhunderts zu bieten hat. Dazu zentralisiert in den Händen von den ekelhaftesten der ekelhaften Großkonzerne und mit völlig normalisierter sexistischer und queerfeindlicher Zensur. Hier ließen sich noch eine Million weitere Gründe anführen, warum diese Dienst nicht nur aus linker und herrschaftskritischer Perspektive nicht genutzt werden sollten, sondern eigentlich neben Kohlekraftwerken und Waffenfabriken eines der Hauptziele von unseren Aktionen sein sollten. Aber nein, in den allermeisten linken und anarchistischen Kontexten, wird Instagram und co völlig unkritisch genutzt. Teilweise wird es sogar von Linken aktiv beworben oder es wird vorausgesetzt es zu nutzen um Informationen zu bekommen. What the Fuck?\n\nWir wollen darüber reden, wie um alles in der Welt es soweit kommen konnte und was wir dagegen tun können.\n\nPlease: Das ist kein Ort für die Grundsatzdebatte ob Instagram und co denn \"wirklich so schlimm\" sind. Wenn ihr so eine Session wollt macht eure eigene. Das hier soll eine Veranstaltung für Menschen sein, die die Kritik teilen und sich darüber austauschen wollen, wie sie in linker Szene Bewusstsein für die Problematik schaffen können. Und: es soll explizit um linkspolitische Kontexte gehen.\n",
  "logo": null,
  "persons": [
    {
      "guid": "c9ecb2d6-a76b-433d-b973-5f2c34b27c55",
      "name": "Luna",
      "public_name": "Luna",
      "avatar": null,
      "biography": null,
      "url": "https://events.ccc.de/congress/2025/hub/user/luna"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/gesprachsrunde-zum-umgang-linksradikaler-und-anarc",
  "links": []
}