{
  "guid": "e5377df9-07f4-5c8c-b510-8f64e58d95e3",
  "code": "8MPJXK",
  "id": 1504,
  "date": "2025-12-29T14:45:00+01:00",
  "start": "14:45",
  "duration": "01:00",
  "room": "One",
  "slug": "39c3-supplements-und-social-media-wenn-der-online-hype-zur-realen-gesundheitsgefahr-wird",
  "title": "Supplements und Social Media – wenn der Online-Hype zur realen Gesundheitsgefahr wird",
  "subtitle": null,
  "language": "de",
  "track": "Science",
  "type": "Talk",
  "abstract": "Nicht zuletzt durch die Werbung in den sozialen Medien werden in Deutschland immer mehr Nahrungsergänzungsmittel verkauft. Einige Influencer bringen sogar ihre eigenen Präparate auf den Markt. Gleichzeitig häufen sich Fälle, in denen die Einnahme von vermeintlich harmlosen „Supplements“ zu Gesundheitsschäden geführt hat. Der Vortrag will daher die Mechanismen hinter dem Supplement-Hype aufzeigen, zudem erklären, warum aktuell ein ausreichender Verbraucherschutz insbesondere im Internet nicht gewährleistet werden kann, wo Handlungsbedarf für die Politik besteht und wie man sich selbst vor fragwürdigen Produkten schützen kann.",
  "description": "Der Markt für Nahrungsergänzungsmittel boomt seit Jahren. Dafür sorgen unter anderem verschiedenste Influencer, die die Präparate in den sozialen Medien bewerben. Statt nur Produkte der großen Player in diesem Bereich anzupreisen, wie More Nutrition, ESN oder Holy Energy, haben einige Influencer mittlerweile sogar ihre eigenen Nahrungsergänzungsmittelmarken auf den Markt gebracht.\n\nVersprochen wird dabei vieles: Pre-Workout-Booster sollen die Leistung beim Krafttraining erhöhen und blitzschnell zum Traumkörper verhelfen, während Gaming-Booster Wachheit und eine Top-Performance beim Zocken versprechen. Wieder andere Kapseln oder auch Gummibärchen sollen für eine makellose Haut oder einen ruhigen Schlaf sorgen. Manche Präparate können angeblich sogar Krankheiten vorbeugen oder heilen.\n\nDoch was steckt tatsächlich in diesen Mitteln, die online regelrecht gehypt werden? Rein rechtlich handelt es sich um Lebensmittel, was wiederum bedeutet, dass sie ohne behördliche Zulassung auf den Markt gebracht werden dürfen. Es genügt schon, wenn der Unternehmer für die Sicherheit garantiert. Die Hürden für einen Marktzutritt sind damit denkbar niedrig, während gleichzeitig Gewinnmargen locken, die sogar den illegalen Drogenhandel übertreffen.\n\nDas Ergebnis zeigt sich in den Berichten der amtlichen Lebensmittelüberwachung: Bei den Proben, die das Niedersächsische Landesamt für Verbraucherschutz und Lebensmittelsicherheit im Jahr 2024 untersucht hat, entsprachen rund neun von zehn Proben (89 %) nicht den rechtlichen Vorgaben. Neben Mängeln bei der Kennzeichnung und Bewerbung, wodurch Verbraucher viel Geld für wirkungslose Pulver ausgeben, ist die stoffliche Zusammensetzung der Produkte besonders kritisch. So kann beispielsweise die Einnahme von überdosierten Vitamin-D-Präparaten zu Störungen des Calciumstoffwechsels führen (sog. Hypercalcämien). Vermeintlich harmlose pflanzliche Präparate, wie Kurkuma oder Ashwaganda, können zu Leberschäden bis hin zum Leberversagen führen. Besonders brisant ist dabei, dass die Wahrscheinlichkeit für die Erforderlichkeit einer Lebertransplantation oder den Tod des Patienten höher ist als bei Leberschäden durch Arzneimittel (83 vs. 66 %). Es kommen also Menschen durch die Einnahme von Präparaten zu Schaden, mit deren Hilfe sie ihrer Gesundheit eigentlich etwas Gutes tun wollten.\n\nDer Vortrag beleuchtet daher die aktuelle Marktsituation unter besonderer Berücksichtigung des Influencer-Marketings kritisch, erklärt den Unterschied zwischen Nahrungsergänzungs- und Arzneimitteln und stellt die rechtlichen Rahmenbedingungen für das Inverkehrbringen und die Bewerbung von Nahrungsergänzungsmitteln dar. Zudem wird aufgezeigt, warum ein ausreichender Verbraucherschutz durch die aktuellen Möglichkeiten des Lebensmittelrechts insbesondere im Internet nicht gewährleistet werden kann, wo Handlungsbedarf für die Politik besteht und wie man sich selbst vor fragwürdigen Produkten schützen kann.\n",
  "logo": null,
  "persons": [
    {
      "guid": "2e7fd088-f745-55f3-b4bd-7c26d9b0dbbb",
      "name": "Christoph Wiedmer",
      "public_name": "Christoph Wiedmer",
      "avatar": null,
      "biography": "Ich habe Lebensmittelchemie an der Friedrich-Alexander-Universität Erlangen-Nürnberg studiert und anschließend am Fraunhofer Institut für Verfahrenstechnik und Verpackung in Freising (bei München) promoviert. Danach habe ich eine Ausbildung zum staatlich geprüften Lebensmittelchemiker am Bayerischen Landesamt für Gesundheit und Lebensmittelsicherheit absolviert und war mehrere Jahre als lebensmittelchemischer Sachverständiger mit dem Schwerpunkt Nahrungsergänzungsmittel tätig. Seit Januar 2024 bin ich Professor für Lebensmittellehre an der Hochschule Anhalt.\n\nDarüber hinaus bin ich erfolgreicher Science Slammer und Autor (\"Lebensmittellügen\", Piper Verlag).\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_2e7fd088-f745-55f3-b4bd-7c26d9b0dbbb"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/supplements-und-social-media-wenn-der-online-hype-zur-realen-gesundheitsgefahr-wird",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/8MPJXK/"
}