{
  "guid": "e6b6ea01-8d44-5437-a82d-6972a93a4a9d",
  "code": "ZQ9WVE",
  "id": 2435,
  "date": "2025-12-27T15:00:00+01:00",
  "start": "15:00",
  "duration": "00:15",
  "room": "Am Spätverkauf",
  "slug": "39c3-wald-statt-repression-die-kreativitat-von-staat-un",
  "title": "Wald statt Repression - Die Kreativität von Staat und Kapital",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "Antifa Lightning Talk",
  "abstract": "Die Bauindustrie versteht sich auf der ganzen Herstellungs- und Lieferkette gut in der Umweltzerstörung und in der Verdrängung von Menschen für den Profit. Aber auch im Niderschlagen von Protesten und Widerständen ist sie bereits geübt.\r\nVor bald 3 Jahren wurde in der Schweiz ein wertvoller Wald besetzt. Die Menschen stellten sich damit gegen die Rodung des Waldes für eine Bauschuttdeponie und den Abrisswahn, sowie der damit verbundenen Gentrifizierung in der angrenzenden Stadt.\r\n\r\nDie Waldbesetzung und deren Zielen fand in breiten Kreisen Sympathien. Auf diese Blossstellung von Staat und Kapital, mussten diese sofort ihre Autorität an sich reissen. Da das Strafgesetz jedoch nur bedingt brauchbar war dafür, wurden sie kreativ nutzten auf der einen Seite das klassistische Justizsystem und auf der anderen Seite höhlten sie demokratische Institutionen weiter aus.",
  "description": "",
  "logo": null,
  "persons": [
    {
      "guid": "35d83add-5264-52ec-946b-60a6c17e3174",
      "name": "WSR",
      "public_name": "WSR",
      "avatar": null,
      "biography": "Wald statt Repression wehrt sich gegen die Überwälzung Polizeieinsatzkosten und leistet Widerstand um einen Präzedenzfall in der Schweiz zu schaffen, dass Polizeieinsatzkosten nicht überwälzt werden können.\n\nEntstanden ist das Kollektiv infolge einer Waldbesetzung in der Schweiz. Der Staat experimentierte infolge darauf mit der Überwälzung der Räumungskosten. Diese gefährliche antidemokratische Entwicklung versuchen wir zu bekämpfen.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_35d83add-5264-52ec-946b-60a6c17e3174"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/wald-statt-repression-die-kreativitat-von-staat-un",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3-call-for-punk/talk/ZQ9WVE/",
  "feedback_url": "https://cfp.cccv.de/39c3-call-for-punk/talk/ZQ9WVE/feedback/",
  "do_not_record": true
}