{
  "guid": "ee636d6e-7e89-51a5-9188-cf29c7fcf3d6",
  "code": null,
  "id": 100444,
  "date": "2025-12-27T19:00:00+01:00",
  "start": "19:00",
  "duration": "00:50",
  "room": "Bits&Bäume Workshop Area",
  "slug": "39c3-energie-von-uns-fur-uns-vergesellschaftung-als-los",
  "title": "Energie von uns für uns! Vergesellschaftung als Lösung für die Transformation unseres Energiesektors",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "Workshop 50 Minutes",
  "abstract": "Fünf Stromerzeuger dominieren den deutschen Strommarkt. Zusätzlich sitzt mit Katherina Reiche eine Person an der Spitze des Wirschafts- und Energieministeriums, die vier Jahre lang eine Führungsposition innerhalb des Energiekonzerns E.ON innehatte. Zwar gibt es Energiegenossenschaften und Balkonkraftwerkbesitzer*innen, die versuchen, sich von diesen Machtstrukturen ein Stück weit unabhängig zu machen, aber sie produzieren nur einen Bruchteil der Energie, die tagtäglich nachgefragt wird. Die Kampagne RWE und co enteignen setzt sich deswegen für einen Strommarkt ein, der nicht länger von Profitinteressen getrieben wird, und arbeitet an einem Plan, wie dies durch Vergesellschaftung umgesetzt werden kann.",
  "description": "Mit der Vergesellschaftung des Energiesektors in NRW wollen wir die Demokratisierung der (Energie)Wirtschaft und eine ernsthafte sozial-ökologische Energiewende erreichen. Auf juristischer Ebene beinhaltet das die Umwandlung von großen privatwirtschaftlich organisierten Unternehmen in Anstalten des öffentlichen Rechts, auf gesellschaftlicher Ebene leitet es einen Paradigmenwechsel ein: von Oligopolstruktur, Intransparenz und riesigen Profitmargen hin zu solidarischen Preismodellen, einem Energiemarkt, der auf Erneuerbare ausgelegt ist und vor allem hin zu einem direkt demokratischen Entscheidungsprozess, an dem alle Betroffenen beteiligt sind - Angestellte, Strombeziehende, von Klimawandel und Energieressourcenabbau Betroffene...\n\nWie könnten Entscheidungsprozesse in einem vergesellschafteten Betrieb aussehen? Erfüllt unser aktuelles Strommarktdesign die Voraussetzungen dafür? Wie funktioniert unser Energiesystem und warum scheitern privatwirtschaftliche Unternehmen an der Umsetzung der Energiewende? Und wo könnten gesellschaftliche Hebel liegen, um eine Vergesellschaftung auch tatsächlich umzusetzen?\n\nIm Workshop wollen wir unsere Überlegungen dazu vorstellen und sind gleichzeitig auch gespannt auf eure Gedanken zum Thema - denn auch Technik braucht Strom, also lasst uns überlegen, wie Produktion und Verteilung demokratischer organisiert werden können!\n",
  "logo": "https://pretalx.freifunktag.de/media/39c3-bub-workshops-2025/submissions/APGKWY/RWEx-Logo_6LTAqU5.png",
  "persons": [
    {
      "guid": "dc66a8d6-7d94-533f-a4fe-74f4a90ea1c2",
      "name": "RWE und co enteignen",
      "public_name": "RWE und co enteignen",
      "avatar": null,
      "biography": "RWE und co enteignen setzt sich für die Vergesellschaftung des Energiesektors in NRW ein - wir fordern also, dass zentrale Inftastruktur in öffentliche Hand gelegt und demokratisch verwaltet wird. Wenn euch Näheres interessiert, kommt gerne auch zu unserer Assembly! Dort informieren wir nicht ur über die Kampagne, sondern ihr könnt auch abstimmen, was genau vergesellschaftet werden sollte und designen, wie eine demokratische Verwaltung ausgestaltet sein könnte.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_dc66a8d6-7d94-533f-a4fe-74f4a90ea1c2"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/energie-von-uns-fur-uns-vergesellschaftung-als-los",
  "links": [],
  "origin_url": "https://pretalx.freifunktag.de/39c3-bub-workshops-2025/talk/APGKWY/"
}