{
  "guid": "eeb77e44-8a29-5235-960b-e50575570c5c",
  "code": "TKSNNS",
  "id": 1440,
  "date": "2025-12-27T14:45:00+01:00",
  "start": "14:45",
  "duration": "01:00",
  "room": "Zero",
  "slug": "39c3-kim-1-5-noch-mehr-kaos-in-der-medizinischen-telematikinfrastruktur-ti",
  "title": "KIM 1.5: Noch mehr Kaos In der Medizinischen Telematikinfrastruktur (TI)",
  "subtitle": null,
  "language": "de",
  "track": "Security",
  "type": "Talk",
  "abstract": "Zwei Jahre nach dem ersten KIM-Vortrag auf dem 37C3: Die gezeigten Schwachstellen wurden inzwischen geschlossen. Weiterhin können mit dem aktuellen KIM 1.5+ nun große Dateien bis 500 MB übertragen werden, das Signaturhandling wurde für die Nutzenden vereinfacht, indem die Detailinformationen der Signatur nicht mehr einsehbar sind. Aber ist das System jetzt sicher oder gibt es neue Probleme?",
  "description": "KIM hat sich als Dienst für medizinische E-Mails etabliert: Elektronische Arbeitsunfähigkeitsbescheinigungen (eAU), zahnärztliche Heil- und Kostenpläne, Laborinformationen, und Medikamentendosierungen sollen sicher per KIM übermittelt werden. Die Sicherheit soll unauffällig und automatisiert im Hintergrund, ohne Interaktion mit den Benutzenden gewährleistet werden. Dazu werden die Ver- und Entschlüsselung sowie die Signierungsfunktionalitäten in einer extra Software, dem sogenannten Clientmodul, abstrahiert.\n\nIn diesem Vortrag wird das Design dieser Sicherheits-Abstraktion und dadurch bedingte Schwachstellen, wie das Fälschen oder Entschlüsseln von KIMs, beleuchtet.\n\nFortsetzung von 37C3: KIM: Kaos In der Medizinischen Telematikinfrastruktur (TI) [https://media.ccc.de/v/37c3-12030-kim_kaos_in_der_medizinischen_telematikinfrastruktur_ti]\n",
  "logo": null,
  "persons": [
    {
      "guid": "cba9521d-ebd0-5587-81af-d349726dffe5",
      "name": "Christoph Saatjohann",
      "public_name": "Christoph Saatjohann",
      "avatar": "https://cfp.cccv.de/media/avatars/AFGBPY_xlbo05m.webp",
      "biography": "Christoph Saatjohann ist Professor für eingebettete und medizinische IT-Sicherheit an der FH Münster. Seit 2019 beobachtet er kritisch die Einführung der Telematikinfrastruktur (TI).\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_cba9521d-ebd0-5587-81af-d349726dffe5"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/kim-1-5-noch-mehr-kaos-in-der-medizinischen-telematikinfrastruktur-ti",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/TKSNNS/"
}