{
  "guid": "efa55b63-86b6-56c5-88ab-46408b59b18d",
  "code": "H37JAG",
  "id": 2405,
  "date": "2025-12-27T21:45:00+01:00",
  "start": "21:45",
  "duration": "01:00",
  "room": "One",
  "slug": "39c3-hacking-washing-machines",
  "title": "Hacking washing machines",
  "subtitle": null,
  "language": "en",
  "track": "Hardware",
  "type": "Talk",
  "abstract": "Almost everyone has a household appliance at home, whether it's a washing machine, dishwasher, or dryer. Despite their ubiquity, little is publicly documented about how these devices actually work or how their internal components communicate. This talk takes a closer look at proprietary bus systems, hidden diagnostic interfaces, and approaches to cloud-less integration of appliances from two well-known manufacturers into modern home automation systems.",
  "description": "Modern home appliances may seem simple from the outside, but inside they contain complex electronic systems, proprietary communication protocols, and diagnostic interfaces rarely documented outside the manufacturer. In this talk, we'll explore the challenges of reverse-engineering these systems: from analyzing appliance control boards and internal communication buses to decompiling and modifying firmware to better understand device functionality.\n\nWe'll also look at the security mechanisms designed to protect diagnostic access and firmware readout, and how these protections can be bypassed to enable deeper insight into device operation. Finally, this talk will demonstrate how the results of this research can be used to integrate even legacy home appliances into popular home automation platforms.\n\nThis session combines examples and insights from the reverse-engineering of B/S/H/ and Miele household appliances.\n",
  "logo": "https://cfp.cccv.de/media/39c3/submissions/H37JAG/39c3-washing-machine_6ch9wmg_3fF87MD.webp",
  "persons": [
    {
      "guid": "c2371c2d-a116-523d-949e-208a801c27b7",
      "name": "Severin von Wnuck-Lipinski",
      "public_name": "Severin von Wnuck-Lipinski",
      "avatar": "https://cfp.cccv.de/media/avatars/BMAEWE_TV6UXVQ.jpg",
      "biography": "I'm passionate about reverse engineering and communication systems. I enjoy taking things apart to understand how they work and occasionally contribute to Linux kernel development and various KDE projects.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_c2371c2d-a116-523d-949e-208a801c27b7"
    },
    {
      "guid": "89426c74-438d-5570-b3fd-bb9ecdf85691",
      "name": "Hajo Noerenberg",
      "public_name": "Hajo Noerenberg",
      "avatar": "https://cfp.cccv.de/media/avatars/NYRXHP_TYDl4Ir.webp",
      "biography": "Dissecting and enhancing everyday devices.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_89426c74-438d-5570-b3fd-bb9ecdf85691"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/hacking-washing-machines",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/H37JAG/"
}