{
  "guid": "f33636a7-e2a3-5925-87e3-1ba270e73ff5",
  "code": "DFFJ7G",
  "id": 1849,
  "logo": null,
  "date": "2025-12-28T13:30:00+01:00",
  "start": "13:30",
  "duration": "01:00",
  "room": "Fuse",
  "slug": "39c3-1849-selbstverstandlich-antifaschistisch-aktuelle-informationen-zu-den-verfahren-im-budapest-komplex-von-family-friends-hamburg",
  "url": "https://cfp.cccv.de/39c3/talk/DFFJ7G/",
  "title": "selbstverständlich antifaschistisch! Aktuelle Informationen zu den Verfahren im Budapest-Komplex - von family & friends Hamburg",
  "subtitle": "",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "language": "de",
  "abstract": "Mit den Prozessen im Budapest-Komplex wird ein Exempel statuiert - nicht nur gegen Einzelne, sondern gegen antifaschistische Praxis insgesamt. Die Behauptung einer kriminellen Vereinigung mit Mordabsichten stellt eine absurde juristische Eskalation des staatlichen Vorgehens gegen Antifaschist*innen dar und steht in keinem Verhältnis zu den verhandelten Vorkommnissen. Die Verfahren in dieser Weise zu verfolgen, lässt vor allem auf ein hohes Ausforschungs- und Einschüchterungsinteresse schließen.\r\nMit dieser Prozesswelle und den Repressionen gegen Freund*innen und Angehörige wird antifaschistisches Engagement massiv kriminalisiert und ein verzerrtes Bild von politischem Widerstand gezeichnet - während gleichzeitig rechte Gewalt europaweit zunimmt und faschistische Parteien erstarken.\r\nWir sehen, dass Angriffe auf Rechtsstaatlichkeit und Zivilgesellschaft immer weiter zunehmen. Die Art und Weise, wie gegen die Antifas im Budapest-Komplex und im Antifa-Ost Verfahren vorgegangen wird ist ein Vorgeschmack darauf, wie politische Opposition in einer autoritären Zukunft behandelt werden könnte.\r\nWir sind alle von der rechtsautoritären Entwicklung, von Faschisierung betroffen. Die Kriminalisierung von Antifas als \"terroristische Vereinigung\" ist Teil einer (weltweiten) Entdemokratisierung und Zersetzung von Rechtsstaatlichkeit.",
  "description": "Am 26. September wurde gegen Hanna vor dem OLG München das erste Urteil gegen eine der Antifaschist*innen im Rahmen des Budapest-Komplexes gefällt: 5 Jahre für ein lediglich auf Indizien basierendes Urteil. Dem Mordvorwurf der Staatsanwaltschaft wurde nicht entsprochen, behauptet wurde aber die Existenz einer gewalttätigen „kriminellen Vereinigung“.\r\nAm 12. Januar 2026 wird nun vor dem OLG Düsseldorf der Prozess gegen Nele, Emmi, Paula, Luca, Moritz und Clara, die seit Januar in verschiedenen Gefängnissen in U-Haft sitzen, eröffnet. Die Anklage konstruiert auch hier eine kriminelle Vereinigung nach §129 und enthält den Vorwurf des versuchten Mordes. Die Verfahren in dieser Weise zu verfolgen, lässt vor allem auf ein hohes Ausforschungs- und Einschüchterungsinteresse schließen.\r\nZaid, gegen den ein europäischer Haftbefehl aus Ungarn vorliegt, war Anfang Mai unter Meldeauflagen entlassen worden; aufgrund seiner nicht-deutschen Staatsangehörigkeit hatte der Generalbundesanwalt keine Anklage gegen ihn erhoben. Da er in Deutschland nach wie vor von einer Überstellung nach Ungarn bedroht ist, hält er sich seit Oktober 2025 in Paris auf. Er ist gegen Auflagen auf freiem Fuß.\r\nEin weiteres Verfahren im Budapest- Komplex wird in Dresden zusammen mit Vorwürfen aus dem Antifa Ost Verfahren verhandelt. Der Prozess gegen Tobi, Johann, Thomas (Nanuk), Paul und zwei weitere Personen wird bereits im November beginnen.\r\nIn Budapest sitzt Maja – entgegen einer einstweiligen Verfügung des BVerfG und festgestellt rechtswidrig im Juni 2024 nach Ungarn überstellt - weiterhin in Isolationshaft; der Prozess soll erst im Januar fortgeführt werden und voraussichtlich mit dem Urteil am 22.01. zu Ende gehen.\r\nMit den Prozessen im Budapest-Komplex wird ein Exempel statuiert – nicht nur gegen Einzelne, sondern gegen antifaschistische Praxis insgesamt. Die Behauptung einer kriminellen Vereinigung mit Mordabsichten stellt eine absurde juristische Eskalation des staatlichen Vorgehens gegen Antifaschist*innen dar und steht in keinem Verhältnis zu den verhandelten Vorkommnissen.\r\nMit dieser Prozesswelle und den Repressionen gegen Freund*innen und Angehörige wird antifaschistisches Engagement massiv kriminalisiert und ein verzerrtes Bild von politischem Widerstand gezeichnet – während gleichzeitig rechte Gewalt europaweit zunimmt und faschistische Parteien erstarken. Wir sehen, dass Angriffe auf Rechtsstaatlichkeit und Zivilgesellschaf immer weiter zunehmen. Die Art und Weise, wie gegen die Antifas im Budapest-Komplex vorgegangen wird, ist ein Vorgeschmack darauf, wie politische Opposition in einer autoritäreren Zukunft behandelt werden könnte. Wir sind alle von der rechtsautoritären Entwicklung, von Faschisierung betroffen. Die Kriminalisierung von Antifas als „terroristische Vereinigung\" ist Teil einer (weltweiten) Entdemokratisierung und Zersetzung von Rechtsstaatlichkeit.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "YQL7T9",
      "name": "family & friends Hamburg",
      "avatar": "https://cfp.cccv.de/media/avatars/YQL7T9_Nv2klST.jpg",
      "biography": "Die Solidaritätsgruppe family & friends Hamburg ist ein Zusammenschluss aus Familie, Freund\\*innen und Genoss\\*innen zur Unterstützung der beschuldigten Antifaschist*innen im Budapest-Komplex.",
      "public_name": "family & friends Hamburg",
      "guid": "98ba45fd-380d-5232-bd3b-e62fc52aff48",
      "url": "https://cfp.cccv.de/39c3/speaker/YQL7T9/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/DFFJ7G/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/DFFJ7G/",
  "attachments": []
}