{
  "guid": "f3941908-cda6-5e60-96c0-712dc4e61800",
  "code": "SAUGTF",
  "id": 394190,
  "date": "2025-12-28T12:30:00+01:00",
  "start": "12:30",
  "duration": "01:00",
  "room": "Stonewall IO (Saal Y 06)",
  "slug": "39c3-gegenhalten-vor-ort-flintas-als-kommunalpolitikeri",
  "title": "Gegenhalten vor Ort: FLINTAs als Kommunalpolitikerinnen im (ostdeutsch) ländlichen Patriarchat [FLINTA* only]",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "Workshop",
  "abstract": "Workshop zu rechter Bedrohung und sexistischer Kontrolle in ländlich-ostdeutschen Kommunen. Anhand eigener Erfahrungen werden Machtmechanismen offengelegt und Strategien erarbeitet, die politische Handlungsfähigkeit stärken.",
  "description": "Workshop zu politischem Druck von rechts und sexistischen Machtpraktiken in der Kommunalpolitik. Grundlage sind Situationen aus ostdeutsch-ländlichen Kommunen, in denen FLINTA*s bewusst isoliert, geschwächt oder aus politischen Prozessen gedrängt werden. In einem eigens für den Workshop entwickelten Serious Game werden mögliche Reaktionen durchgespielt und unter realistischen Bedingungen bewertet. Die Teilnehmenden müssen entscheiden, welche Schritte tragfähig sind und welche die eigene Position verschlechtern. Ziel ist es die Handlungssicherheit im Umgang mit  ausgrenzenden und abwertenden Situationen zu stärken.\n\nDer Workshop ist FLINTA-only. Der geschützte Rahmen soll ermöglichen, dass Erfahrungen ausgesprochen, Konflikte klar analysiert und Strategien ohne Beobachtungsdruck entwickelt werden können. „Safe Space“ meint hier die Abwesenheit jener Dynamiken, die in der Praxis Einschüchterung und Selbstzensur erzwingen.\n",
  "logo": null,
  "persons": [
    {
      "guid": "d1eda913-2ac0-503c-92d9-f2e88611b423",
      "name": "Cathleen Hoffmann",
      "public_name": "Cathleen Hoffmann",
      "avatar": "https://pretalx.c3voc.de/media/avatars/CRASSV_cioNJdI.jpeg",
      "biography": "Ich arbeite als Bildungsreferentin, für eine NGO in Sachsen-Anhalt (www.miteinander-ev.de), in der politischen Bildung mit dem Schwerpunkt Rechtsextremismusprävention und Holocaust Education. \nKommunalpolitisch bin ich in einer ländlich-ostdeutschen Region aktiv und beschäftige mich mit der Frage, wie man rechte Strukturen zurückdrängt, ohne die Leute vor Ort zu verlieren. Im Rahmen der letzten Kommunalwahl bin ich mit einer eigenen Liste angetreten - nur mit FLINTA-Personen ✊.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_d1eda913-2ac0-503c-92d9-f2e88611b423"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/gegenhalten-vor-ort-flintas-als-kommunalpolitikeri",
  "links": [],
  "origin_url": "https://pretalx.c3voc.de/39c3-haecksen-workshops-2025/talk/SAUGTF/",
  "feedback_url": "https://pretalx.c3voc.de/39c3-haecksen-workshops-2025/talk/SAUGTF/feedback/"
}