{
  "guid": "f7a3c3ba-a9d0-5aab-bf31-f63a034a8d22",
  "code": "CTZNNK",
  "id": 2085,
  "date": "2025-12-29T22:05:00+01:00",
  "start": "22:05",
  "duration": "00:40",
  "room": "Fuse",
  "slug": "39c3-the-spectrum-hackspace-beyond-hacking",
  "title": "The Spectrum - Hackspace Beyond Hacking",
  "subtitle": null,
  "language": "en",
  "track": "CCC & Community",
  "type": "Talk",
  "abstract": "The Spectrum is a newly founded queer-feminist, intersectional hackspace centering FLINTA+, disabled, and marginalized beings. We see hacking as playful exploration—of technology, art, and ideas—to reimagine what inclusion and collaboration can be. At 39C3, we share how awareness, accessibility, and transdisciplinary creation can transform community and hack the norm.",
  "description": "The Spectrum is a new queer-feminist, intersectional and transdisciplinary hackspace centering FLINTA+, creatures with disabilities, and other marginalized communities founded in 2025. We see hacking as more than code and machines—it’s a way of exploring the world through curiosity, play, and care. By taking things, systems, and ideas apart, we uncover new perspectives and possibilities for change. Our space is built around awareness, inclusion, and open access to knowledge. We aim to create an environment where everyone can learn, share, and experiment freely—without the constraints of “normality.” From art and music to activism and technology, The Spectrum brings together diverse disciplines and beings to co-create, collaborate, and imagine better futures.\n\nAt 39C3, we want to share our experiences of building such a space: how awareness work and accessibility can shape community dynamics, what transdisciplinary hacking can look like, and how centering marginalized perspectives transforms collective creation. Join us to explore what it means to hack not only systems, but also art, expectations, and realities.\n\nhttps://the-spectrum.space/en/\n",
  "logo": "https://cfp.cccv.de/media/39c3/submissions/CTZNNK/the_spectrum_banner_socials_3_NLDpf0r_9wfBz2X.webp",
  "persons": [
    {
      "guid": "b901ad85-595d-55a6-a4cc-2d1f82ec9775",
      "name": "sjaelv",
      "public_name": "sjaelv",
      "avatar": "https://cfp.cccv.de/media/avatars/URERAY_Xxe7HHD.webp",
      "biography": "Mirca ist Diversity-Trainerin, Kuratorin und Konzeptionskünstlerin und arbeitet an der Schnittstelle von Kultur, Community und gesellschaftlichem Wandel. Stationen umfassen u.a. das Filmfest München, die Virtual Worlds (Internationaler Wettbewerb für narrative VR) und die Most Wanted:Music Konferenz. 2017 initiierte Mirca We Make Waves mit, das erste internationale FLINTA+ Showcase & Konferenz, und ist seither Teil des internationalen Keychange-Programms für mehr Diversität in der Musik.\n\nMit Safe The Dance gründete they 2020 gemeinsam mit Johanna Bauhus und Carmen Westermeier eine Agentur für Awareness, Diversity und Inklusion. Safe the Dance arbeitet mit kleinsten Kollektiven bis hin zu Großveranstaltungen mit bis zu 60.000 Besucherinnen. Der Fokus liegt dabei nicht nur auf der Musikindustrie, sondern umfasst auch Museen, Theater, Universitäten, Sportveranstaltungen und mehr. Die jahrelangen Erfahrungen flossen 2023 in ein Awareness-Handbuch, dass allen Interessierten helfen soll, nachhaltige Safer Spaces zu errichten.\n\nAktuell steht der 2025 neu gegeründete queer-feministischen, interdisziplinären Hackspace The Spectrum in München, im Fokus.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_b901ad85-595d-55a6-a4cc-2d1f82ec9775"
    },
    {
      "guid": "9fc4619c-4c3d-52e5-82a6-187f0d220ee8",
      "name": "MultisampledNight",
      "public_name": "MultisampledNight",
      "avatar": "https://cfp.cccv.de/media/avatars/GJZC3P_XhprHRU.webp",
      "biography": "Sits around and doesn't do much. Purrs and meows. Does a lot of mistakes. Appreciates input and feedback. Loves introspecting and interacting with systems and behavior. Naive, empathic, curious and hopeful despite the horrors. Artist, researcher, engineer and hacker.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_9fc4619c-4c3d-52e5-82a6-187f0d220ee8"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/the-spectrum-hackspace-beyond-hacking",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/CTZNNK/"
}