{
  "guid": "f8c65205-19e4-4b7c-ad41-8ae1d62fdb44",
  "code": null,
  "id": 865205,
  "date": "2025-12-27T21:00:00+01:00",
  "start": "21:00",
  "duration": "01:00",
  "room": "CADUS Skill-Station",
  "slug": "39c3-from-rave-to-rubble-de-elitise-crisis-respons_q0xd",
  "title": "From Rave to Rubble - De-Elitise Crisis Response",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "other",
  "abstract": "",
  "description": "CADUS is currently active in war zones such as Ukraine, Gaza, and Sudan—but it all started backstage at a music festival.\nThe idea: to rethink humanitarian aid, beyond uniforms, hierarchy, and postcolonial “white charity” logic. Instead, sharing skills, hacking tools, and making knowledge openly accessible—disaster relief as a commons. In this talk, we'll share how a DIY project from the subculture has evolved into an organization that now builds medical infrastructure, tech solutions, and training in crisis areas—with bright minds from different disciplines, open-source hardware, and a lot of improvisation.\nWe talk about what it means to de-elitize humanitarian work: How can we act in conflicts, climate disasters, or collapses without slipping into old power logics? How can practical solidarity be scaled without becoming an NGO apparatus? And what can nerds, makers, and activists contribute in concrete terms when the world is burning? A reality check with hopefully contagious energy for action—from the idea to the reality of deployment. No hero stories, but many lessons learned and open construction sites.\nEspecially with regard to Gaza, Ukraine, Sudan, and the climate crisis, we want to show that the ability to act is not a question of profession, uniform, or mandate—but of collective creativity, technical openness, and solidarity-based courage.\n",
  "logo": null,
  "persons": [],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/from-rave-to-rubble-de-elitise-crisis-respons_q0xd",
  "links": []
}