{
  "guid": "f9204594-d3f2-5c45-ba71-542a99eb9e5d",
  "code": "FWPGUZ",
  "id": 2015,
  "logo": null,
  "date": "2025-12-28T14:45:00+01:00",
  "start": "14:45",
  "duration": "00:40",
  "room": "One",
  "slug": "39c3-2015-chaospager-how-to-construct-an-open-pager-system-for-c3",
  "url": "https://cfp.cccv.de/39c3/talk/FWPGUZ/",
  "title": "Chaospager - How to construct an Open Pager System for c3",
  "subtitle": "",
  "track": "Hardware",
  "type": "Talk",
  "language": "en",
  "abstract": "In this talk, we will give an introduction into the project (i.e. how it all started at 38c3 and why we are here now), provide an in-depth review of how the development process of our pager worked and what our future goals are.\r\n\r\nIn our introduction, we will talk about the origin and exploration phase of the inital pager idea (i.e. how we went from the idea of bringing POCSAG Pager transmitter to 38c3, over a cable-bound prototype, to a first working pager on a proper PCB). We will also present our plans of connecting our POCSAG transmitter infrastructure to THOT (CERTs own dispatch software).\r\n\r\nFor our in-depth review about the project, we explain how we encountered major reception problems, how we analyzed them at easterhegg22 and conducted experiments there, and why we are opting for a custom HF frontend design instead of an already-made one from chinese vendors. Moreover, we provide an overview of our transmitter devices and give some advice on how to replicate those.\r\n\r\nLastly, we will discuss further challenges and what our next goals are.\r\n\r\nIf we are reaching our milestone until 39c3, we will also give a live demo of the system.",
  "description": "At 38c3, we conducted an experiment to test out our self-built POCSAG Pager infrastructure. Together with DL0TUH and CERT, we are now working on an open pager solution leveraging well-known components in the maker commmunity (e.g. ESP32, SX1262) to support the alarming of action forces at c3 events. In this talk, we will guide you through the process of developing such a project, problems that are occuring and what our future plans are.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "YUCQAZ",
      "name": "Max",
      "avatar": null,
      "biography": "Hi, I am Max. My passion lies in computer science and amateur radio. I am happy to be a part of DL0TUH and Signalspielplatz, where I can collaborate with a talented group of crazy engineers from Hamburg.",
      "public_name": "Max",
      "guid": "d3715d6c-e622-5131-90de-127d60d1ed9e",
      "url": "https://cfp.cccv.de/39c3/speaker/YUCQAZ/"
    },
    {
      "code": "LGZAJZ",
      "name": "Julian",
      "avatar": null,
      "biography": "Hi, I am Julian and passsionate about everything about RF. Currently I'm doing a Masters degree in RF engineering at TUHH and am also part of the universitys hamradio club with the callsign DL0TUH. Through my friends there I slipped in the group Signalspielplatz who are developing pagers for c3.",
      "public_name": "Julian",
      "guid": "d620125d-bbe9-5f9a-a233-7228c7385c67",
      "url": "https://cfp.cccv.de/39c3/speaker/LGZAJZ/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/FWPGUZ/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/FWPGUZ/",
  "attachments": []
}