{
  "guid": "f9a035c9-f239-508c-a3ae-5cde981de8f2",
  "code": "QMYK3T",
  "id": 903592,
  "date": "2025-12-28T16:45:00+01:00",
  "start": "16:45",
  "duration": "01:00",
  "room": "Stonewall IO (Saal Y 06)",
  "slug": "39c3-tech-transcendentalism-as-hypermodern-myth-and-neo",
  "title": "Tech-Transcendentalism as Hypermodern Myth and Neofeudal Ideology [all creatures welcome]",
  "subtitle": null,
  "language": "en",
  "track": null,
  "type": "Workshop",
  "abstract": "The tech-libertarian transhumanist narrative is nothing but a hypermodern salvation myth. It is used to propagate a feudalist model of society in which a select few reap all the benefits. We discuss this ideology and how to oppose it.",
  "description": "**tl;dr:** A libertarian mindset among tech-affine people often goes together with political ideas that seem to promote freedom and progress, but really stand for a crypto-fascist neufeudalism, and the transhumanist idea that we can and need to take control of human evolution by technological means—in the narrow image of those who promote this view, and to the detriment of diverse people with other world views or ways of life.\n\nThe inclusion of Joscha Bach's talk at 39C3 and its subsequent cancellation, after his emails with Jeffrey Epstein were made public, has generated much needed discussion about this close connection between **the libertarian right in tech**, the **TESCREAL** bundle of throught schools (transhumanism, extropianism, singularitarianism, cosmism, rationalism, effective altruism, and longtermism), and covertly or overtly misogynist / queer- & transphobic / misanthropic **patriarchal**, **authoritarian**, and **fascist ideologies**.\n\nNone of this is particularly new. Analysis of these connections stretches back decades. It reveals a shocking amount of supremacism, egotism, and immaturity, a profound lack of responsibility, the celebration of behavior that targets undesired minorities, and political incorrectness under the guise of \"free speech,\" from the very beginnings of the tech industry to the present moment [1,2].\n\nLast year, Bach presented at 38C3, where he reduced the human mind to software, fetishized the mismeasure of human intelligence by IQ, and called for the effective dehumanization of humanity (quote: \"we anthropomorphize people way too much\") [3].\n\nRecently, another connection has been highlighted: that between **transhumanist narratives** and **religious salvation myths** [4,5,6] and **apocalyptic revelations** [7,8,9]. The basic idea is that our world is about to unravel and our capacities will soon be outclassed by superintelligent machines that—for all practical purposes—take on the role of god(s). For the *accelerationist*, this is a good thing because, with the proper alignment, it will enable us to upload our minds to the cloud, live forever, and thus conquer the galaxy. For the *doomer*, surprisingly, this is not a bad thing either, because humanity is but an intermediate stage—crossing Nietzsche's famous <a href=\"https://www.goodreads.com/quotes/384722-man-is-a-rope-stretched-between-the-animal-and-the\">rope</a>—between the primitive ape descending from the trees and the infallible machines that will inevitably replace us, marking the next step in some sort of strange imagined *<a href=\"https://en.wikipedia.org/wiki/Great_chain_of_being\">Great Chain of Being</a>*. Human extinction, therefore, is to be welcomed.\n\nIn these **hypermodern apocalypse myths**, God and the devil in the traditional religious narrative have simply been replaced by our future machine overlords. Just take Peter Thiel's invocation of the *antichrist* (nicely contextualized and summarized in [7,8,9]), some sinister force that prevents technological progress from saving humanity and leading us into our glorious future. Or Bach himself who—in an interview on the Jim Rutt Show—outlined an *Aquinean approach to alignment*: all it takes to get along with AGI is love, hope, and faith [10]. The *apotheotic drive* behind all this is not exactly subtle.\n\nSuch dramatic-sounding (and weirdly spiritual) visions of the future cover up a dark political agenda, sometimes called the **dark enlightenment** [11,12], which is being implemented in their shadow: a totalitarian form of **libertarian neufeudalism** designed to enrich a very small elite of billionaires at the cost of the rest of humanity and the ecological health of our planet. The idea is for the chosen few to survive the coming megacrisis without having to worry about us—the other 98%. This side of transhumanism looks more like a crazed end-time cult than the pan-rationalist utopia it pretends to be in public.\n\nThis entire view is based on an astonishing amount of hubris. It reveals a lack of empathy and human connection. It is also completely detached from reality, assuming technological capabilities and an individual capacity to survive that are very unlikely to ever come to pass. It is a myth in both senses of the term: a visionary narrative for this epoch of late-stage capitalism, but also a foolish fairy tale with no relevance to what is actually going on.\n\nWhat explains the **appeal** of such a **delusional** and **anti-human ideology**?\n\nOne reason is widespread *ignorance* when it comes to the true nature of this heterogeneous movement. It does not even try to hide from view but—backed by a spittle-licking tech-media information clique and the idea that \"boys will be boys\" but that's not too harmful and, anyway, this phase will pass—it manages to cover its tracks quite effectively and to get away with pretty much anything at the moment—even buying itself a Vice President of the U.S. of A. [13].\n\nThe second reason is the following: in this time of looming crisis, a lot of us are looking for *positive visions of the future*, for narratives that suggest workable paths our of our current predicament. This is why many otherwise intelligent and tech-savvy folks are surprisingly susceptible to the dangerous and anti-social delusion of the hypermodern myth of technological salvation. We desperately *want* it to be true.\n\n**Workshop Format:** (60 min)\n\nThis workshop consists of a short (10 min) introductory talk by Yogi Jaeger, which summarizes the main theses of his 2023 essay on tech-transcendentalism [6], followed by comments from ElleJay.\n\nThe main part of the workshop consists of a **moderated deliberative discussion with the audience**. We want to exchange ideas and perspectives, as well as experiences, especially from the standpoints of different minority groups impacted by this ideology.\n\n**The aim of our deliberations is to raise awareness of the presence and influence of transhumanist crypto-fascism in the community, and to come up with specific strategies how to oppose this problematic ideology while providing alternative visions for a thriving and diverse humanity in the 21st century.**\n\nThe time is perfect to raise this important topic at 39C3—not just because of the debate about Bach, but also because it seems to be garnering more and more attention, at least in English-speaking world.\n\n**References:**\n\n[1] Paulina Borsook (2001). Cyberselfish: A Critical Romp through the Terribly Libertarian Culture of High Tech (New York: PublicAffairs).\n\n[2] The Nerd Reich Podcast: Gil Duran interviews Paulina Borsook: https://youtu.be/DL-kwZdkiOA.\n\n[3] Documented in this Mastodon thread by Aline Blankertz: https://indieweb.social/@alineblankertz/113808990876980594.\n\n[4] Meghan O'Gieblyn (2021). God, Human, Animal, Machine: Technology, Metaphor, and the Search for Meaning (New York: Doubleday). Neatly summarized here: https://youtu.be/mgqdSJrutXg.\n\n[5] Mary-Jane Rubenstein (2022). Astrotopia: The Dangerous Religion of the Corporate Space Race (Chicago: University of Chicago Press).\n\n[6] In this blog from 2023, Jaeger compares tech-transcendentalism to the medieval catholic salvation myth: https://www.johannesjaeger.eu/blog/machine-metaphysics-and-the-cult-of-techno-transcendentalism.\n\n[7] The Nerd Reich Podcast: Gil Duran talks to Robert Fuller and Matthew Fox about Peter Thiel's \"Antichrist\" lectures: https://youtu.be/KegSMO9XcIY.\n\n[8] This Guardian article has lots of excerpts from Thiel's \"antichrist\" lectures: https://www.theguardian.com/us-news/2025/oct/10/peter-thiel-lectures-antichrist.\n\n[9] The Nation: \"Peter Thiel is the real Antichrist,\" https://www.thenation.com/podcast/archive/twsu112025.\n\n[10] Joscha Bach in one of his three appearances on the Jim Rutt Show: https://www.jimruttshow.com/currents-joscha-bach.\n\n[11] Guardian article on Curtis Yarvin (a.k.a. Mencius Moldbug): https://www.theguardian.com/us-news/2024/dec/21/curtis-yarvin-trump.\n\n[12] Nick Land's coining of \"Dark Englightenment\" is described in this essay: https://socialecologies.wordpress.com/2012/10/10/nick-land-on-the-dark-enlightenment.\n\n[13] See, for example: https://www.cbsnews.com/news/jd-vance-trump-vp-peter-thiel-billionaire.\n",
  "logo": null,
  "persons": [
    {
      "guid": "da60a636-3599-5421-bd23-ef63d52c5239",
      "name": "Johannes Jäger",
      "public_name": "Johannes Jäger",
      "avatar": "https://pretalx.c3voc.de/media/avatars/PMGLLC_GNP8yXK.png",
      "biography": "Yogi (he/him) is a freelance researcher, philosopher, artist, educator, facilitator, and mentor.\n\nHis various professional explorations include:\n<ul>\n<li>working as an experimental lab biologist with <i>Drosophila</i> and other flies,</li>\n<li>modeling the evolution of gene regulatory networks in these flies,</li>\n<li>developing methods to fit nonlinear models to data,</li>\n<li>running an empirical research group, and (later) an institute for the philosophy of biology,</li>\n<li>trying to understand the organization of the organism (and why it is <i>not</i> anything like a machine, especially <a href=\"https://arxiv.org/abs/2307.07515\">AI algorithms</a>),</li> \n<li>enriching decision theory with the concept of <a href=\"https://www.frontiersin.org/journals/psychology/articles/10.3389/fpsyg.2024.1362658/full\">relevance realization</a>,</li>\n<li>writing a book about a <a href=\"https://www.whatisemerging.com/opinions/toward-a-metamodern-science\">metamodern science</a> for the 21st century, called \"<a href=\"https://www.expandingpossibilities.org/an-emerging-book.html\">Beyond the Age of Machines</a>\",</li>\n<li>facilitating courses and workshops on <a href=\"https://www.johannesjaeger.eu/creativity.html\">creativity</a> and <a href=\"https://www.johannesjaeger.eu/philosophy.html\">philosophy</a> for scientists,</li>\n<li>pioneering the practice of metamodern mentoring, and</li>\n<li>being a founding member of the arts & science collective <a href=\"https://the-zone.at\">The ZoNE</a>.\n</ul>\n\nMore info about all this is available at https://johannesjaeger.eu, or\nspecifically about his work on organismal agents vs. AI \"agents\" at https://expandingpossibilities.org,\nand about his art & science workshops, and consultancy work at https://theperspective.studio.\n\nFull bio and publication record at <a href=\"https://orcid.org/my-orcid?orcid=0000-0002-2568-2103\">ORCID</a> or <a href=\"https://scholar.google.com/citations?user=Wk8kppcAAAAJ&hl=en\">Google Scholar</a>.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_da60a636-3599-5421-bd23-ef63d52c5239"
    },
    {
      "guid": "90c47dc5-070d-5b60-8d39-cc71773d101e",
      "name": "ElleJay (LJ)",
      "public_name": "ElleJay (LJ)",
      "avatar": "https://pretalx.c3voc.de/media/avatars/WALKSP_5O37Wwl.jpg",
      "biography": "Heyaaa!!\n\nI'm LJ (any), some people also know me as Leo (he/his) or Janis (she/her). I'm some kind of nyanbinary femby cat with too many special interests to count. Where my dayjob revolves mostly around securing orgs IT systems, my technical interests range from everything around AppSec, cryptography, reversing etc. to software archeology, encodings, file formats, POSIX, operating systems & firmware, theoretical CompSci, programming languages, uhhhh yeah, basically anything that is a good excuse to not do Lohnarbeiten at that time.\n\nBut I'm also interested in fashion, linguistics, history, politics, philosophy(!!), arts & writing, indoor design & architecture, music and sports (running, handball). I love to talk about weird intersections of seemingly very different topics and I apply this to my vocation: Teaching. It's the best thing I've ever done and ever will, because there's nothing lovelier than showing someone who doesn't think they'd ever understand $thing to a) prove them wrong in the best way possible, b) and show them how this stuff's actually interesting, ideally even igniting a spark that continues to grow.\n\nUnfortunately I'm also easily overwhelmed and may retreat randomly into my head, so please understand and don't take this too personally :3\n\nI also have a blog at https://www.ljrk.org/blog and maintain a much more personal microblog over on the Fediverse https://todon.eu/@ljrk. There's also an AO3 at [redacted] 0:-)\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_90c47dc5-070d-5b60-8d39-cc71773d101e"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/tech-transcendentalism-as-hypermodern-myth-and-neo",
  "links": [],
  "origin_url": "https://pretalx.c3voc.de/39c3-haecksen-workshops-2025/talk/QMYK3T/",
  "feedback_url": "https://pretalx.c3voc.de/39c3-haecksen-workshops-2025/talk/QMYK3T/feedback/"
}