{
  "guid": "f9e3dcd8-d398-4ee9-8bf4-b449f9f06b14",
  "code": null,
  "id": 938398,
  "date": "2025-12-29T00:00:00+01:00",
  "start": "00:00",
  "duration": "00:25",
  "room": "SoS Saal 6",
  "slug": "39c3-wtf-nochmal-das-ganze-ii",
  "title": "WTF, nochmal das Ganze? II",
  "subtitle": null,
  "language": "de",
  "track": null,
  "type": "other",
  "abstract": "",
  "description": "The system of harassing payment cards for people receiving asylum seeker benefits is not a new idea, but has been dusted off from the 1990s/2000s. But even back then, there was resistance—including in Thuringia!\n\nWe are showing “Change?! – No way!”, a 25-minute documentary by Filmpirat*innen about the voucher system for refugees. Using hidden cameras, the film pirates in Thuringia accompanied refugees while shopping to show the everyday, discriminatory madness at supermarket checkouts when vouchers have to be “used up” during a shopping trip or dictionaries “can't be bought with vouchers.” But they also show the everyday solidarity of people who exchange vouchers 1:1 for cash in exchange initiatives and do not stop there, but generally demand the abolition of the voucher practice – the precursor to today's payment cards.\n",
  "logo": null,
  "persons": [
    {
      "guid": "e6bd7fb9-1bc6-4c72-8041-f9da0bc9049d",
      "name": "neinzurbezahlkarte",
      "public_name": "neinzurbezahlkarte",
      "avatar": null,
      "biography": "As local initiatives against the payment card, we organize solidarity voucher exchanges and resistance against racist policies. As the nationwide network “Equal Social Rights for All,” we take a united political stand against socio-political injustices and racism.\n\nEnd the exclusion of marginalized groups! Cash for all!\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/neinzurbezahlkarte"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/wtf-nochmal-das-ganze-ii",
  "links": []
}