{
  "guid": "fa59ce23-205c-5cd9-a7de-8ba768e3bf3f",
  "code": "HNUX3N",
  "id": 1776,
  "date": "2025-12-29T20:30:00+01:00",
  "start": "20:30",
  "duration": "01:00",
  "room": "Ground",
  "slug": "39c3-aber-hier-leben-nein-danke-oder-doch-wie-wir-der-autoritaren-zuspitzung-begegnen-konnen",
  "title": "Aber hier Leben? Nein danke! …oder doch? Wie wir der autoritären Zuspitzung begegnen können.",
  "subtitle": null,
  "language": "de",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "abstract": "Im Osten stehen nächstes Jahr schon wieder Wahlen an und schon wieder sieht alles danach aus, als ob die AfD eine Regierungsbeteiligung bekommen könnte. Ganz konkret: In Sachsen-Anhalt und Mecklenburg-Vorpommern. Nicht nur diese \"rosigen\" Aussichten, sondern auch aktuelle Bevölkerungsprognosen werfen gar kein günstiges Licht auf die Regionen. Linke Akteur:innen vor Ort kämpfen täglich dagegen an und sie brauchen unsere Solidarität. Wir müssen dem etwas entgegensetzen. Egal ob als Hacker:innen auf dem Congress oder Westdeutsche in (noch) Grünen Gemeinden. \r\n\r\nWo kommt das alles her? Wer macht aktuell etwas dagegen und wie können wir dem rechten Sog begegnen?",
  "description": "Mit dem „Super-Ost-Wahljahr“ 2024 (Landtagswahlen in Sachsen, Thüringen und Brandenburg) wurden bereits alle möglichen AfD-Regierungs-Horrorszenarien in Ostdeutschland in den Medien diskutiert und ausgemalt. Nächstes Jahr stehen jedoch noch die Landtagswahlen in Sachsen-Anhalt und Mecklenburg-Vorpommern an. Und die Prognosen sehen auch dort übel aus. Wären morgen Wahlen, würde die AfD in Sachsen-Anhalt 39% der Stimmen und in Mecklenburg-Vorpommern 38% bekommen. Um dem etwas entgegenzusetzen müssten wüste Bündnisse aus CDU, Die Linke, SPD und BSW entstehen. Kurzum: LSA und MV sind verloren!\n\nZusätzlich schrumpfen beide Bundesländer und altern gleichzeitig. In Sachsen-Anhalt gibt es keinen einzigen „wachsenden“ Ort. Weniger Kinder, immer mehr ältere Menschen, Fachkräftemangel und ein „Männerüberschuss“ – wer will da schon noch Leben und dem rechten Sog die Stirn bieten? Emanzipatorische Akteur:innen verlassen das Land, denn sie werden angegriffen und kriminalisiert. Also: Mauer drum und sich selbst überlassen? Ganz nach dem alten Tocotronic Song „Aber hier Leben? Nein danke!“\n\nWir wollen den Osten aber nicht aufgeben, deshalb beleuchten wir in unserem Talk, wie wir mit einer gemeinsamen Kraftanstrengung die Mauer vermeiden können – denn es gibt sie (noch): Die Gegenstimmen und Linken Aktiven die in beiden Bundesländern täglich die Fähnchen hochhalten. Ob die „Zora“ in Halberstadt, das „AZ Kim Hubert“ in Salzwedel oder das „Zentrum für Randale und Melancholie“ in Schwerin: Sie organisieren Austauschräume, alternative Konzerte und Orte, die für alle Menschen offen sind. Sie brauchen unseren Support und wir zeigen euch Möglichkeiten wie dieser aussehen könnte.\n\nAußerdem wollen wir ins Gespräch kommen. Was hat eigentlich „der Westen“ mit all dem zu tun? Warum können wir es uns nicht länger leisten unpolitisch oder inaktiv zu sein? Wie kann die Chaos-Bubble sich in die ostdeutschen Herzen hacken? Und was können wir alle tun, um gemeinsam zu preppen und uns den Herausforderungen zu stellen?\n",
  "logo": "https://cfp.cccv.de/media/39c3/submissions/HNUX3N/Poly_2_8CTTGob.png",
  "persons": [
    {
      "guid": "bf8495e7-a087-5517-a625-9418519b9bb8",
      "name": "Jaša Hiergeblieben",
      "public_name": "Jaša Hiergeblieben",
      "avatar": "https://cfp.cccv.de/media/avatars/P4180048_AONSw12.JPG",
      "biography": "Das Netzwerk Polylux ist seit 2019 aktiv, um antifaschistische Projekte in Ostdeutschland - vor allem - finanziell zu unterstützen. Schon damals kam mit der Sorge um wegbrechende Finanzierungsmöglichkeiten angesichts einer schwachen Linken und der immer stärker werdenden Rechten die Idee auf, finanzielle Unabhängigkeit zu schaffen.\n\nDas Prinzip ist einfach: Polylux sammelt Geld über Fördermitgliedschaften und Spenden und verteilt sie an Projekte im ländlichen ostdeutschen Raum um. Durch das Netzwerk bekommen die Initiativen größere Sichtbarkeit. Allein im letzten Jahr konnte Polylux fast 200.000 Euro an linke, antifaschistische Projekte in Ostdeutschland umverteilen.\n\nMehr dazu unter  www.polylux.network\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_bf8495e7-a087-5517-a625-9418519b9bb8"
    },
    {
      "guid": "6f0813a6-ab03-5cdf-b0a7-d0cf59a108cd",
      "name": "Lisa Zugezogen",
      "public_name": "Lisa Zugezogen",
      "avatar": null,
      "biography": "Lisa Hoodie ist politische Aktivistin. Sie kämpft mit Polylux für eine antifaschistische Hegemonie in Ostdeutschland.\n",
      "url": "https://events.ccc.de/congress/2025/hub/user/speaker_6f0813a6-ab03-5cdf-b0a7-d0cf59a108cd"
    }
  ],
  "url": "https://events.ccc.de/congress/2025/hub/event/detail/aber-hier-leben-nein-danke-oder-doch-wie-wir-der-autoritaren-zuspitzung-begegnen-konnen",
  "links": [],
  "origin_url": "https://cfp.cccv.de/39c3/talk/HNUX3N/"
}