{
  "guid": "fae65b90-30c4-5ce1-8d59-d8f3600c7845",
  "code": "8TLLST",
  "id": 2393,
  "logo": null,
  "date": "2025-12-27T19:15:00+01:00",
  "start": "19:15",
  "duration": "01:00",
  "room": "Ground",
  "slug": "39c3-2393-and-so-it-begins-wie-unser-rechtsstaat-auf-den-highway-richtung-trumpismus-rast-und-warum-afghanische-klager-innen-fur-uns-die-notbremse-ziehen",
  "url": "https://cfp.cccv.de/39c3/talk/8TLLST/",
  "title": "And so it begins - Wie unser Rechtsstaat auf den Highway Richtung Trumpismus rast – und warum afghanische Kläger*innen für uns die Notbremse ziehen",
  "subtitle": "",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "language": "de",
  "abstract": "Wenn die Regierung sich nicht mehr an das eigene Recht gebunden fühlt, markiert das nicht nur einen politischen Spurwechsel, sondern die Auffahrt auf den Highway to Trumpism. Zeit die Notbremse zu ziehen!\r\nNormalerweise trifft es in solchen Situationen immer zuerst diejenigen, die sich am wenigsten wehren können. Doch was passiert, wenn genau diese Menschen mit juristischen Werkzeugen bewaffnet werden, um zurückzuschlagen?\r\nAnhand von über 100 Klagen afghanischer Schutzsuchender zeigen wir, wie Ministerien das Bundesaufnahmeprogramm sabotieren, Gerichte sie zurückpfeifen – und die Zivilgesellschaft zum letzten Schutzwall des Rechtsstaats wird. Und wir verraten, warum sich Beamte im BAMF vielleicht lieber krankmelden sollten und welche anderen Möglichkeiten sie haben, um nicht straffällig zu werden.",
  "description": "•\tVersprechen werden nicht gebrochen“ – das lernen wir schon als Kinder. Aber der Kindergarten ist schon lange her, und Politiker*innen haben zwar oft das Auftreten eines Elefanten, aber das Gedächtnis eines Goldfischs.\r\n•\tDeswegen hätte die Bundesregierung auch fast 2.500 Afghan*innen mit deutschen Aufnahmezusagen in Islamabad „vergessen“, die dort seit Monaten auf die Ausstellung ihrer deutschen Visa warten\r\n•\tDas Kalkül dahinter: Pakistan erledigt die Drecksarbeit und schiebt sie früher oder später ab, Problem solved! - selbst wenn dabei Menschenleben auf dem Spiel stehen.\r\n•\tWie kann die Zivilgesellschaft die Notbremse ziehen, wenn sich Regierung und Verwaltung nicht mehr an das eigene Recht gebunden fühlen?\r\n•\tEine Möglichkeit: wir vernetzen die afghanischen Familien mit Anwält*innen, damit sie Dobrindt und Wadephul verklagen - und sie gewinnen! Die Gerichtsbeschlüsse sind eindeutig: Visa sofort erteilen – sonst Strafzahlungen! Inzwischen laufen über 100 Verfahren an vier Verwaltungsgerichten, weitere kommen täglich hinzu. \r\n•\tDas dürfte nicht ganz das gewesen sein, was die neue Bundesregierung meinte, als sie im Koalitionsvertrag verkündete, „freiwillige Aufnahmeprogramme so weit wie möglich zu beenden“. \r\nÜbersetzung der politischen Realitätsversion: Wenn es nach Dobrindt und dem Kanzler geht, sollen möglichst gar keine Schutzsuchenden aus Afghanistan mehr nach Deutschland kommen – rechtsverbindliche Aufnahmezusagen hin oder her. Einreisen dürfen nur noch anerkannte Terroristen aus der Taliban-Regierung, um hier in Deutschland die afghanischen Botschaften und Konsulate zu übernehmen\r\n•\tDurch die Klagen konnten bereits 78 Menschen einreisen, etwa 80 weitere Visa sind in Bearbeitung – und weitere werden vorbereitet.\r\n•\tDoch wie in jedem Drehbuch gilt: The Empire strikes back! Die Regierung entwickelt laufend neue Methoden, um Urteile ins Leere laufen zu lassen und Einreisen weiterhin zu blockieren.\r\n•\tWillkommen im „Trumpismus made in Germany“.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "code": "NR9FC9",
      "name": "Eva",
      "avatar": "https://cfp.cccv.de/media/avatars/Luftbruecke_O_S_UPpPDM2.png",
      "biography": "Meine Kollegin Elaha und ich haben Monate und Jahre zwischen pakistanischen Guesthouses, und Grenzposten, Berliner Ministerien und Bundestagsfluren verbracht.\r\nWir haben die Razzien der pakistanischen Polizei hautnah miterlebt und kennen die Menschen, um die es geht zum Teil seit Jahren\r\nNach vier Jahren politischem „Migrations-Bullshit-Bingo“ ist es Zeit für eine juristische und politische Generalabrechnung:\r\nMit dem BMI, der Bundespolizei, dem AA, rechten Medien, korrupten Sicherheitsbehörden in Pakistan – und den Taliban. Ungefähr in dieser Reihenfolge.",
      "public_name": "Eva",
      "guid": "163d1679-2ce0-5bd0-830b-677d479ece88",
      "url": "https://cfp.cccv.de/39c3/speaker/NR9FC9/"
    },
    {
      "code": "FUEX8Z",
      "name": "Elaha",
      "avatar": null,
      "biography": null,
      "public_name": "Elaha",
      "guid": "34806dc2-faa8-5103-a6cc-01acb863f361",
      "url": "https://cfp.cccv.de/39c3/speaker/FUEX8Z/"
    }
  ],
  "links": [],
  "feedback_url": "https://cfp.cccv.de/39c3/talk/8TLLST/feedback/",
  "origin_url": "https://cfp.cccv.de/39c3/talk/8TLLST/",
  "attachments": []
}